[{
    "these are super cheap and mostly you get what you pay for.": ["price"],
    "The sound quality is not that good and they're not as sensitive as some others, but they're ok for the price.": ["sound quality", "price"]
}, {
    "I hate buying new earphones because they never seem to meet my standards (although to be fair they are really high).": [],
    "These however are excellent.": ["quality"],
    "They're great at noise cancellation; when you have just a small amount of audio playing, you cannot hear your surroundings at all.": ["noise cancellation"],
    "The sound (particularly bass) is very pronounced to the point that you can almost feel it.": ["sound quality"],
    "Amazing deal.": []
}, {
    "So I bought these headphones because I read a review of them on cnet.com's list of low cost headphones that are big hits.": [],
    "I have to say I am impressed.These have really great sound!": ["sound quality"],
    "I got these to use in place of some noise canceling headphones I have from Sony as they hurt my head after a while, and these are really great!": ["noise cancellation"],
    "They sound very rich, and they are incredibly compact and easy to throw in a bag and take with you.": ["sound quality", "size"],
    "That being said, I think they could get pretty tangled up easily, so I am careful to not put them anywhere without wrapping them neatly first.": ["cord"],
    "But if that doesn't bother you, these headphones are an incredible, rumbly bassy bang for your buck.": ["price worthy"]
}, {
    "Good product, but for the price and better bad as well as isolation, I'd totally recommend iLuv iEP322BLK City Lights In-Ear Earphones - Ultra Bass.": ["price", "quality"],
    "They are better in my opinion.": [],
    "Other than that I'd use this ones as replacements.": [],
    "Good sound": ["sound quality"]
}, {
    "I used to hate cheap headphone/earbuds because it was pain to wear it.": [],
    "And you know, can't expect much of sound quality.": [],
    "This product changed everything from that perspective.": ["quality"],
    "This is a very comfortable ear headphone.Comfort: 8.5/10Sound: 7/10Bass: 7/10Bass Ambient: 6/10Design: 8/10Material: 6/10": ["comfortability"]
}, {
    "So,bought one pair and lost it soon enough.": [],
    "Then got a second and found the first pair.": [],
    "Then got the first one stolen and bought a third.": [],
    "And the second pair was given as a present to an audiphile who had very expensive Sennheiser earbuds.": [],
    "These headphones are not only cheap, but extremely reliable; their sound quality and extent of frequencies is paramount for an item of their price.Only disadvantage:After wearing them for 3 hours the &#34;bud&#34; makes the cartilage on my ear a bit soared.": ["price", "sound quality"]
}, {
    "I bought two pair for my kids.": [],
    "They both think they are comfortable and sound good, but my son has complained that the insulation on the wires is maybe not thick enough.": [],
    "He says when the wire rubs against his clothes, it somehow transmits sound associated with that rubbing into the headphones.": [],
    "I don't know if it's the static generated by the plastic rubbing against his close or the actual sound of the two materials rubbing together but he sometimes finds it distracting enough that he mentioned it to me.": ["sound quality"],
    "Otherwise they like them and I think they are a good value for the money even with the previously mentioned flaw.": ["price"]
}, {
    "The dog chewed up a pair of my headphones, so I was looking to replace them.": [],
    "I have previously ordered headphones from another 3rd party seller, but saw that these were a good price and available on Prime.": ["price"],
    "I needed something quick, as I was about to go on vacation, so I decided to take a shot at these.After plugging them in and using them, I was blown away by the quality.": ["quality"],
    "I have bought several pairs of Skullcandy for a much higher price in the past, and the build and sound quality of these is far superior.": ["quality", "sound quality"],
    "I had no issues with the comfort of these headphones, or any issues with them falling out.": ["comfortability"],
    "Also included with these headphones are extra rubber ear pieces.": [],
    "If you are looking for headphones for a good price and sound, look no further, buy these.": ["price", "sound quality"]
}, {
    "These headphones work wonderfully.": [],
    "I was a little concerned because of how inexpensive they were, but they cancel noise out quite effectively, and the sound quality seems to be just as good as the $30 ear bud headphones that I had previously owened.": ["price", "noise cancellation", "sound quality"]
}, {
    "I bought three different sets of in-ear headphones at the same time.": [],
    "These were the cheapest and have had the best sounding of the three.": ["price", "sound quality"],
    "I was pleasently surprised.": [],
    "The only drawback I saw were that the part that inserts into mp3 player or phone is L shaped and I usually prefer a straight connection.": [],
    "It would be nice to have a mic/volume control and non-tangling flat wire cord, but for the price these would be hard to beat IMO.": []
}, {
    "I have severe hearing loss and have to wear BTE hearing aids.": [],
    "Muff type ear phones don't work very well for me so thought  I would try ear buds, knowing that I would have to use them without my hearing aids.": [],
    "They improve the sound considerably when used with my Kindle Fire but could still use more volume.": ["sound quality"]
}, {
    "Not terrible for the price but I will agree that that the bass is lacking, basically just a high tremble.": ["price", "sound quality"],
    "I didn't realize it but I had a pair of these before that I found at a store a year or so ago.": [],
    "They still work so I can't complain, other headphones I had lasted for only a few months before they stopped working.": [],
    "So I will give the product some points for \"going strong.": [],
    "\"If your not too picky about sound quality than these are perfect for the price.": ["sound quality"],
    "They have three different sized \"buds\" so you can choose the right size for your ear.": ["size"],
    "I have to use the large size even though I have small ears to get good sound quality.": ["sound quality"],
    "However they do bother the inside of my ears due to the way they are designed, as the plastic seems to rest on the outer walls of my ear.": ["design"]
}, {
    "When I came on Amazon and read the reviews, I wasn't quite sure if they'd be totally accurate.": [],
    "Such quality is rarely found for so cheap.": ["quality", "price"],
    "But, when I plugged these guys in, I realized the reviewers were correct: these headphones are the real deal.": [],
    "They look neat, are comfortable, and have a sound quality other manufacturers charge 6 to 8 time the price for.": ["comfortability", "sound quality"],
    "Still hard to believe, but these affordable earphones are the best I've used, and the price cannot be beaten!": ["quality", "price"]
}, {
    "Since these aren't normally $5, just on sale, I thought they would be decent pair of cheap headphones.": ["price"],
    "They worked.... okay.... You have to have them perfectly placed in the jack for it to work.": [],
    "If it gets knocked out of the position they don't work well.": [],
    "Not complaining because of the price, but they could be better for the regular price.": ["price"]
}, {
    "Good sounding and fitting ear buds.": ["sound quality"],
    "I have bought numerous ear/head phones over the years and these sound very good for the money.": ["sound quality", "price"],
    "Why spend hundreds?They fit my ears and my kids ears.": []
}, {
    "I'm not a huge earbud fan (prefer the discontinued Sony sports headphones for workouts), but these were a very pleasant surprise.": [],
    "Sound quality is great, they are comfortable, and stay in place while you're running or working out.": ["sound quality", "comfortability"],
    "Great 'buds!": ["quality"]
}, {
    "I ordered these earphones along with some iLuv City Lights Earphones (http://www.amazon.com/iLuv-iEP322BLK-Lights-In-Ear-Earphones/dp/B004PEIG12)These Panasonic earphones are alright, and sound ok...The iLuv City Lights earphones sounded AMAZING.": ["sound quality"],
    "They have a huge driver in them (13.5mm) to give you that unbeatable bass that is just incredible for rap and electronic music, but they still sound great for higher toned music with high female voices.": ["sound quality"],
    "If you want to spend less that $10 on a pair of amazing earphones, I'd recommend the iLuv City Lights.": ["price"]
}, {
    "I have been carrying these around for a year and no problems.": ["durability"],
    "They stay firmly in place during running.": ["comfortability"],
    "They are comfortable to wear all day at work.": ["comfortability"],
    "They never fall out.": [],
    "These are the best headphones I've ever owned.": ["quality"],
    "Way better then the ones that came with my ipod or android phone.": []
}, {
    "They work but don't expect much.": [],
    "If you need a cheap pair that you don't want to be concerned about getting stolen or lost then give them a try but they aren't going to blow you away.I'm on the fence as to whether I'd buy them again.": ["price"],
    "I'd be more inclined to probably try my luck again with something different.": []
}, {
    "These earphones are lightweight, gentle to the ears and better sounding than similarly priced earphones.": ["design", "sound quality"],
    "I can wear them for hours on end with no problems.": ["comfortability"]
}, {
    "These ear buds are comfortable, have good sound quality, and are, above all, CHEAP.": ["comfortability", "price", "sound quality"],
    "I can't envision buying another type now that these are on the market.": [],
    "A great deal.": []
}, {
    "I can honestly say, You can't go wrong with these in the sub $10 category of in-earphones.": [],
    "Sony quit making the ones I liked and I wanted something to go with my new blue Sandisk Sansa Cip+.": [],
    "Yes they are cheap but the sound is amazing for what you pay for these.": ["price", "sound quality"],
    "They do sound a bit rich in bass and have brighter treble but I'm okay with that.": ["sound quality"],
    "I was able to use the default medium plugs out of the package, and are pretty good at sealing out noise.": [],
    "I have bought many of Panasonic's cheaper products including VCR, blu-ray player, rice cooker, and some of their on-ear headphones; they all exceed my expectations for the value.": [],
    "I would certainly consider another pair of these earphones.": [],
    "Heck, they'd even make a great stocking stuffer at this price.": [],
    "Recipient would not be disappointed.": [],
    "All in all, great sound and value with the Panasonic RPHJE120A in-earphone.": ["sound quality"]
}, {
    "I tend to lose or break headphones so I got these.": [],
    "The sound quality is exceptional for 6 buck headphones, It is on par with 30 or 40 headphones.": ["sound quality"],
    "But it isn't perfect, it tend suffer at making high treble sound properly, such as rock music but any party like music, hip-hop or rap goes great.These are little more comfortable than other in ear headphones but make sure you right bud size otherwise it will be really uncomfortable.": ["sound quality", "comfortability"],
    "I use small bud size.If break these within 3 months, I don't mind stocking up a bunch of these decent headphones.": []
}, {
    "At under $10, these earphones easily compete with $30-40 earphones; they sound great and are built well.": ["sound quality", "price", "quality"],
    "I purchase a set for myself and my 2 kids.": [],
    "All three of us have enjoyed them.": [],
    "I would recommend these without reservation.": []
}, {
    "I bought these headphones for one reason, value.People in my family have a habit of destroying ear buds--cheap and expensive alike.": [],
    "Typically they were lasting 1-4 months.": [],
    "I didn't want to sacrifice audio quality, but with that track record I wasn't ready to spend $30 or even $15 on a pair.": ["sound quality", "price"],
    "With that in mind, I decided to find the best value sub $10 headphones I could find.": [],
    "It was between this model and another brand, which I wont name here, and I happy that I selected this one.If you want a cheap ear bud with great passive noise reduction, this is a great option.": ["price", "noise cancellation"],
    "They seal they create allows for great audio range that greatly exceeds Apple's ear buds and blocks ambient noise.I bought these and designated them to be only for our iPad, which kept them out of my son's backpack and my wife's purse.": ["noise cancellation"],
    "They are still going, and are in great shape.The value in these is so great that I don't see any advantage in spending more money on ear buds, unless you are ready to spend over $100 for an entry level audiophile product.": ["price"],
    "Even if there are some $40+ pairs out there that might be a little better (and there are many that are much worse), the quality you would gain for the $30+ is pretty insignificant until you start paying $$$ for very high signal to noise ratio--which is a measure of how &#34;clean&#34; the sound is.": ["sound quality", "noise cancellation"]
}, {
    "OK, I have small ears that aren't a perfect match, and earphones don't usually stay in my ears well at all.These however fit really nice and are comfortable too.": ["comfortability"],
    "The sound is fine for my purposes, which is primarily listening to audio on my laptop.I bought another brand at the same time, theCreative EP-660 In-Ear Noise Isolating Headphones (White), that cost almost 6 times as much and they didn't seem any better and didn't fit my ears as well either.": ["sound quality"],
    "These panasonic keep out exterior noise pretty well, too.": ["noise cancellation"],
    "For the price and quality, they are a definite bargain.": ["price", "quality"]
}, {
    "I kind of hate earbuds.": [],
    "Not the concept, but the fact that it's seemingly impossible to find a set that lasts more than a few months.": [],
    "At ~$6 these are a steal.": [],
    "They fit well and sound great.": ["sound quality"],
    "Not sure how long they'll last, but so far I'm very happy.EDIT - update 07/08/13:  just wanted to update.": [],
    "I've used these pretty much every day for several months and they're still going.": [],
    "I've had more expensive earbuds that I've babied die on me after 3 months of moderate use.": [],
    "I wear these Panasonic buds under heavy-duty hearing protection while mowing the lawn (they actually block out more of the mower noise and I don't have to turn my mp3 player up very loud) and while shoveling snow, while exercising, etc.": [],
    "My first pair of these just keeps going and going.": [],
    "By far my best set of earbuds yet.": []
}, {
    "Unbelievable sound for the price; Lightweight cable which doesn't pull earphones out while running (much).": ["price", "design"],
    "If they last through the sweat, would be worth to buy a second pair!": ["sound quality"]
}, {
    "They also aren't as comfortable as other earbuds I have had in the past.": ["comfortability"],
    "You want something for airport/airplane to block noise, Skullcandy earbuds are the way to go.": ["noise cancellation"],
    "I don't know why I veered from that path but I won't do it again.": []
}, {
    "For the price they really can't be beat.": ["price"],
    "I bought a second pair.": [],
    "I use one for the Gym and one for when I DJ with turntables late night at the house and I don't feel like wearing Bulky Headphones.": []
}, {
    "The sound quality is good but the rubber ear guards won't stay on.": ["sound quality"],
    "We've lost nearly all the sizes that come with these because they come off too easily, when inserting or removing from ears.": []
}, {
    "I thought these were just regular earbuds, but they are shaped uniquely and come with 3 different sizes of rubber covers.": [],
    "The design makes them much more comfortable and stable.": ["comfortability"],
    "It was a pleasant surprise for a cheap buy.Update: After 6 weeks of using these once about once a week, they died.": ["price"],
    "I know they are super cheap, but its still very inconvenient.": ["price"]
}, {
    "For only having paid $11 including shipping, these things are the best value earbuds I've ever owned.The sound quality is actually slightly better than my $100 pair of earbuds that I dropped in water; they have a more pleasant balance between bass and treble.": ["price", "sound quality"],
    "I bought a $30 pair of Sony headphones to replace the old ones but the sound quality was tinny (cymbals always sounded much louder than everything else, too).There has to be a catch, so I'm assuming that these aren't very reliable, considering the price, and guessing they might fail after a few months, but I could buy 9 pairs of them to equal the price of my more expensive pair, which probably wouldn't last as long as 9 pairs of these.": [],
    "Plus, if something happens again and they break due to my negligence, my wallet won't care if I buy a replacement pair.": []
}, {
    "A year or so ago I bought some of theCoby Jammerz High-Performance Isolation Stereo Earphones CVE52BLK (Black)because of the super cheap price, but the sound quality was sometimes noticeably bad and they stopped working randomly about a year later.": ["price", "sound quality"],
    "While I thought about buying another pair because of how cheap they are, I saw these Panasonic ones with great reviews and a comparable price ($2-$3 more).These are definitely worth the price.": [],
    "They have a great fit and come with three different sizes of buds to fit any person's ears.": ["comfortability", "size"],
    "They are slightly angled from the base of the earbud, so for people who don't like that they won't like these.": [],
    "Overall though, I've experienced great sound quality and comfort with these, much moreso than the Coby Jammerz.": ["sound quality", "comfortability"]
}, {
    "I have another set similar to these and I liked them so much that I wanted a second set.": [],
    "I could not find the exact pair so I opted for these.": [],
    "The sound quality is the same and they fit very well.": ["sound quality", "comfortability"],
    "Overall, I think they're worth the price.": ["price worthy"],
    "I did not give them five stars because they do not have a sliding piece that keeps the two cords untangled and the buds side by side when they aren't in use.": [],
    "My older set of plugs do and they're so much easier to store when on the move.": [],
    "I only use this set at home.": [],
    "I use the older set that I've had for almost three years when I'm on the go so I don't have to worry about untangling them every day when I take them out of my pocket, backpack, etc.": []
}, {
    "My head hurts from listening to things with these in.": ["comfortability"],
    "Music sounds like crap, TV shows sound like crap, idk anymore.": ["sound quality"],
    "My iPod earphones sound better than these.": ["sound quality"],
    "That's embarrassing considering that the left iPod earphone is partially blown out.": [],
    "They do stay in your ear though..": [],
    "I guess that's the only positive thing.": [],
    "Oh, and the wires look CHEAP.": [],
    "They tangle so much.": [],
    "Please, do not buy these.": [],
    "I feel so stupid for being these, I don't want anybody else to do the same.": []
}, {
    "I'm a bit of a headphone/earphone snob.": [],
    "I've owned very nice Sennheisers, AKGs and other brand names in the past and present.": [],
    "I own an awesome set of Sony, full-size headphones, which can produce super low bass sound.": [],
    "I've got several pair of JVC, half-size headphones that are great for reproducing a full range of sound and don't look awkward or stupid when you're sitting on the park bench or local bar, listening to your favorite jams from your Smartphone.": [],
    "I also have a pair of awesome, Philips earbud phones of which one set I keep in my motorcycle for listening to NPR or music while riding  case and another in my backpack for general travel use.I wanted to get an inexpensive pair for me and my wife when we are riding our bicycles or walking the neighborhood for exercise.": [],
    "If they were to get lost or damaged, I wouldn't be heart-broken.": [],
    "These produce a pretty good range of sound.": ["sound quality"],
    "They definitely don't have the low-end bass of my Philips earbuds or JVC half-phones, but then they are less than 1/3 the cost of those phones.": [],
    "They can't capture the full range and deep bass of my full-size Sony headphone, but these are less than 1/5 the cost of those.": [],
    "So, for the money, they are a pretty decent value for fairly decent sound.": ["sound quality", "price worthy"],
    "Buy them by the buckets if you have teens, tweens or pre-teens that are always losing their earbud phones.": []
}, {
    "I got these because I needed something inexpensive that wouldn't fall out of my ear when I walked/ran.Pros-fits in ear nicely-doesn't fall out with normal movements-fair price-works well with my iPod/iPhone-does a nice job of weeding out background noiseCons-these are not ear phones that will last for a long time so for the price you will have to re-purchase after a while.": ["price"]
}, {
    "These headphones have awesome noise cancelling, great volume and decent bass.": ["noise cancellation", "sound quality"],
    "Also the ergo fit design really works, the headphones haven't fallen out of my ears once which is awesome.": ["design"],
    "For $5.76 you cant beat this quality.": ["price"],
    "HIGHLY recommended!": []
}, {
    "I am an audiophile, but an audiophile who likes to work out and who is very prone to losing cheap headphones.": [],
    "These are exceptional for the amount of money that I paid for them, the bass is slightly boomy or overbearing and is controlled.": [],
    "The bass has the middle bass hump that you would expect from headphones this inexpensive, but all in all bass is above average in quality for this price range.": ["price"],
    "The midrange is not recessed although it is slightly harsh as midrange is usually the most difficult spectrum for any headphone of any price to reproduce, and these do an admirable job.": [],
    "The highs are decent, but definitely not exceptional and also not harsh at all, which is good.": [],
    "Cons include: an extraordinarily low quality cable, L-jack, and strange nozzle design.": ["quality"]
}, {
    "Being that earbuds take a lot of abuse and seem to wear out fast, I am always looking for cheapies.": [],
    "The good news is that these earbuds sound better than skull candy, have a better fit and are downright cheap.": ["sound quality", "price"],
    "I bought 5.": [],
    "These are more ergonomic in the ear and and have excellent sound.": ["sound quality"],
    "So as Mr T would say:  I pity the fool that pays more for less.": []
}, {
    "I bought some of these for gifts so my kids would stop borrowing my $30 ones, and they like them.": [],
    "2 of my kids are pickyabout earbuds, but they are using these with no complaints.": [],
    "as I said-Great for the price- not  bad for the sound.": ["price", "sound quality"]
}, {
    "Stellar ear phones for the money.": ["price"],
    "I tried these after my favorite V-Moda Bass Freq headphones continued to escalate in price.": [],
    "These don't isolate noise quite as well at the V-Moda's, but for less than I spend at Starbucks each morning, they do a great job.": ["noise cancellation"],
    "Similar sound to more expensive V-Moda's too....": []
}, {
    "They're cheap, high-qualtiy, and they're incredibly comfortable.": ["price", "quality", "durability"],
    "These are just about the same quality as Beats earphones, and a cheaper price, how can one go wrong?": ["price", "quality"],
    "They seem quite durable, and the sound quality on it is phenomenal.": ["sound quality"],
    "Vocals are crisp, and the bass is really balanced, highly recommended.": []
}, {
    "Hello, These are the Best ear-buds you can buy under $45.": ["quality"],
    "Trust me these sound Better than the Klipsch S3 ear-buds, and better than the more expensive Panasonic RPHJE355A High Fidelity Ergo-Fit ear-buds, and better than most Sony ear-buds.These Panasonic ear-buds have good bass, treble, balance and play loud.": ["sound quality"],
    "At only $7ea.": ["price"],
    "you can not go wrong in buying a set of these ear-buds.": [],
    "They sound great for only $7": ["sound quality", "price"]
}, {
    "Haven't bought headphones in probably 8 years .": [],
    "These are amazing to me , the sound is fantastic!": ["sound quality"],
    "Excellent bass , perfect crisp sound, decent length on the cord about 3-4 feet .": ["sound quality", "cord"],
    "Only paid just over 7 bux including shipping !": ["price"],
    "Amazing deal and very happy !": []
}, {
    "I'm not a headphone fanatic so I can't really judge if these provide the best quality of sound, but they certainly meet my expectations and the price + Prime shipping seals the deal.": ["price", "sound quality"],
    "One thing I will note is how well they fit your ear - they employ a curved design to fit well inside your ear and I've never had issues with them falling out like other earbuds.": ["fit", "design"],
    "My only other complaint is that they don't have a clamp/\"zipper\" to bind the two separate cords when not in usage, and as a result they get somewhat tangled every time I put them away.But I really haven't found any better for the price, if you're willing to spend double digits then you might find some with better bass but other than that I thoroughly recommend them.": ["price", "cord"]
}, {
    "I tried these in comparison with new iPhone 5 earphones; my older $20 Sennheiser earphones and I conclude that the sounds of these is a C-.": [],
    "No bass whatsover, highs sound to high as well.Not a quality product by any means.": ["quality", "sound quality"],
    "Cabling is very cheap and dangly.": ["quality", "cord"],
    "I don't think these will last very long under heavy use.": ["durability"],
    "Ohh well, $5..": []
}, {
    "Meets expectations, very good, and there IS bass.": ["quality"],
    "Not sure if very durable because im scared to test but i really like these earbuds and i do reccomend them.": ["durability"],
    "I love the quality BTW.": ["quality"]
}, {
    "The design is pretty simple.": ["design"],
    "They reduce outside noise pretty well and fit pretty comfortably too.": ["noise cancellation", "comfortability", "fit"],
    "The color is okay but I'm wondering if I should have just gotten black because the pink cords are quite conspicuous.": ["color"]
}, {
    "These were bought because of the high ratings here, but I'm not as impressed as some people were.": [],
    "The sound is reasonable, not the best I've heard from cheap earbuds, but I'm most unhappy with them insofar as the amount of external sound they let in; perhaps they just don't fit my ear well, but--well, I guess they don't.": ["sound quality"],
    "I've bought cheap JVC earbuds that I liked a lot more than these.I won't buy these again when the die or get lost.UPDATE Mar 2, 2014:  I've had more time to use these earbuds and have modified my opinion of them.": [],
    "The sound from them seems, to me, to be essentially flat, with no real emphasis on any part of the audio spectrum, which is desirable (for quality sound), or perhaps with a slight boost at the extremes, the bass and treble (perhaps a de-emphasis of the mid range).": ["sound quality"],
    "The bass is not muddy, the mid's not overpowering (as mid's tend to be in cheap, crummy, earbuds), and the highs are also clean and detailed (keep in mind this is compared to other earbuds I've used, *not* high-end speaker systems and headphones!)": ["sound quality"],
    "But these fine tonal qualities only present themselves in a quite place.As such, my original complaint stands, insofar as too much outside sound allowed in.": [],
    "Someone had mentioned that this is due to poor-fitting, but, sorry, that's not the case.": [],
    "These are great earbuds in a quite environ, but not nearly as good, or useful, in a normal-noise or loud area, i.e., an airplane or some workplaces, like mine.": ["noise cancellation"]
}, {
    "This pair is good for music as it picks up bass clearly, but it's not good for watching movies or t.v.": ["sound quality"],
    "Shows on an iPad because the music or noises in the movies and t.v.": ["sound quality"],
    "shows come out louder than the voices of the movie actors.": ["sound quality"],
    "That's why I gave it 4 stars.": [],
    "But it is better than expected for music.": []
}, {
    "Great deal for in-ear headphones; I have a pair of nicer ones for when I am not running, but these do the trick wherever I'm at - the gym, on the bus, or work.": [],
    "One thing I really like is that they don't have as much of a problem with the wire thumping.": ["cord"]
}, {
    "These headphones are easily the best headphones I have owned.": ["quality"],
    "Granted, I have never owned any high end headphones, but these beat the pants off of any other set in the $15-20 range.Pros:Super ComfortableGreat bass soundCustomizabe colorsAmazing priceStill working perfectly 1 year after purchase (Can't say that about many other inexpensive headphones)Cons:None": ["price", "comfortability", "sound quality", "color"]
}, {
    "I like the color and the build, I wish it has a built in mic tho.": ["color", "quality"],
    "I prefer earphones with mic to control the on/off and volume since I'm always on the go and mostly use my phone while walking to talk with clients.": []
}, {
    "Great headphones.": ["quality"],
    "I've had these for 4 months and never had a problem with them.": [],
    "Longest pair of headphones i've ever had.": [],
    "The earbuds give you great sound, without being too loud for anyone else to hear.": ["sound quality"],
    "Plus they cancel out \"outside noises\".": ["noise cancellation"],
    "Usually by this time, I have problems with headphones.": [],
    "Whether they stop working, or one ear stops working, but these are really cheap and durable.": ["durability", "price"],
    "Plus comes in a nice variety of colors.": ["color"],
    "I don't find them uncomfortable to use.": ["comfortability"],
    "At first glance, they could look awkward, but thats how your ear canal is actually shaped, thus the headphones never fall out.": ["design", "fit"]
}, {
    "Item received right on time, and delivery was Quick.": ["delivery time"],
    "Came with spare earbuds, which is always a plus.": [],
    "Odd shaped earpieces, but they fit suprisingly well, and sound better than the price would suggest.": ["design", "fit", "sound quality"],
    "And I Love the \"L\" shaped haedphone jack, which seems more durable than the traditional straight-ilne jack.": ["durability"],
    "Worth the money, Thanks.": ["price worthy"]
}, {
    "Black earbuds, easy to place in the ear where they stay without falling out or causing discomfort.": ["fit"],
    "Sound quality is just fine for listening to laptop music.": ["sound quality"],
    "Several different ear-adapter-cups are supplied, but the normal one is working fine for me.": [],
    "Reasonably priced and rapid delivery...looks like a winner to me!": ["delivery time", "price"]
}, {
    "Has great mids and hi's and the bass is good but weak.": ["sound quality"],
    "I have a pair of Nakamichi headphones and they produce a lot of bass but the treble is weak.": [],
    "I had to turn down the setting on the Panasonics in order for them to sound good.": [],
    "Once adjustments were made, the headphones sounded great.": ["sound quality"],
    "If you are not into heavy bass, these are great.": ["sound quality"]
}, {
    "These earphones have to be one of the best earphones I have bought.": ["quality"],
    "I went through so many pairs of skullcandy like the ink and inkd 2.0, but these have really good bass for like dubstep which I like.": [],
    "I'm not saying skullcandy is bad, trust me the inkd earphones are actually really loud, but the music clarity of these doesn't need a really loud sound.": [],
    "These earphones in all have good bass, a nice sound that you won't be saying you want it louder, and they also are a good fit in your ear.": ["sound quality"],
    "They won't come off if you pull on them or when your running which is nice.": [],
    "They are also comfortable if you have the right size buds and have them in right.": ["comfortability"]
}, {
    "These are a very good set of earphones that are inexpensive.": ["price"],
    "Perfect for take everywhere everyday use with my tablet or smartphone.": [],
    "They do sound quite good and the ear buds come in three sizes to fit very different ears.": ["sound quality"],
    "For the price these actually surprised me in quality and I would definitely recommend.": ["price"],
    "I've been using these for awhile now and I can totally echo the other positive reviews here.": []
}, {
    "This is completely worth $5.": ["price"],
    "These earphones block out noise pretty well, and have very good audio quality.": ["noise cancellation", "sound quality"],
    "Also, I'm someone who bikes alot, and I usually have my earphones on when I'm biking.": [],
    "When I do that, I end up hearing the wind blowing against the earpiece which is really annoying; but these earphones are angled in such a way so that you don't hear the wind blowing: all you hear is your music.": []
}, {
    "The quality of sound is great.": ["sound quality"],
    "It outperforms my 20 USD marshmallows in every category.": [],
    "The only issue I have with them is A) they feel cheap and B) they don't have the little slider that keeps them organized while wrapped up.": [],
    "It couldn't cost more than half a penny for that little slider, but they neglect to put it on there.": [],
    "What can you expect for this price range?4/5 wouldn't buy again but would recommend to anyone on a budget who doesn't mind not having the slider.": []
}, {
    "At this price, you can't find a better set of earphones.": ["price"],
    "They come with different size inserts and should fit pretty much anyone and I find them pretty comfortable.": ["fit", "sound quality", "comfortability"],
    "The cable jacket feels like PVC, which I prefer.": ["cord"],
    "I know silicone jackets are more durable, but my Creative earbuds with silicone jackets were very tangle prone.There is a small problem with these earphone and I think it can be fixed, but I haven't had time to do it yet.": ["cord"],
    "The cables enter the buds from the bottom, through a hard plastic tube.": ["cord"],
    "When you move around, the cables hit the tubes and the sound travels through the earbuds.": ["cord"],
    "I think I can fix this issue with some rubber cement or clear caulk.If the color is not important to you, check out all the colors.": [],
    "The price varies greatly with the color.": []
}, {
    "I have never liked ear buds, ever!": [],
    "They are always hard, uncomfortable, and adamant about falling out of your ears.But not these!": [],
    "They are contoured for each ear.": [],
    "I use the smallest cushions and they fit amazingly well in my ear canal.": ["fit"],
    "My husband has a pair and uses the standard size cushion.The sound quality is fantastic, as well.": ["sound quality"],
    "I am shocked at how these extremely inexpensive ear buds perform and fit better than ear buds 3 or 4 times their cost.": ["price", "fit", "comfortability"],
    "I would repurchase these if they ever fell apart, though they seem to be very durable.": ["durability"],
    "I would also recommend to friends or family if they were looking for ear buds.": [],
    "Awesome product!": []
}, {
    "I mean they work but as soon as I pulled them out of the plastic I knew they were cheap.": [],
    "The cord is thin.": ["cord"],
    "They fit fine even with the strange shape.": ["fit"],
    "I guess they're comfortable, I've had better.Here's the bad part.": ["comfortability"],
    "There's no bass....at all.": ["sound quality"],
    "They make the quality of the music worse.": ["sound quality"],
    "It sounds like you're in the nosebleeds of an arena.": ["sound quality"],
    "They say you get what you pay for but I've paid the same price and got better.": [],
    "I think I'm going back to the Coby's I had last time.": [],
    "Try again.": [],
    "Keep looking.": [],
    "You don't want them.": []
}, {
    "I have read from another reviewer how these headphones blew him away and i thought ill give them a try and let me tell you these are worth every penny.": ["price worthy"],
    "Every time I loose or break headphones I will continue to purchase these.": []
}, {
    "I'm hard on earbuds.": [],
    "I love them.": [],
    "Wear them daily to listen to audiobooks as I putz around the house and go to sleep.": [],
    "(There's something so soothing about being read to sleep!)": [],
    "and these are wonderful.": [],
    "They fit great.": ["fit"],
    "They sound even better.": ["sound quality"],
    "I usually go through a pair every few months because I buy the cheapos from wal-mart or best buy and because I mostly use them for audiobooks sound quality isn't a huge deal breaker.": [],
    "These are the best I've encountered and if you factor in how downright NICE the price is?": [],
    "Amazing.": [],
    "They're wonderful.": [],
    "I wish I'd bought more than one pair at a time!Disclaimer: I'm no audiophile.": [],
    "The difference between \"horrific\" and \"okay\" sound is noticable but the difference between \"okay\" and \"super flippin nice\" is not to my ears.": [],
    "So, if you are one of those people who notice such things, I'm no help.": [],
    "But if you're an average book/music listener looking for nice sounding, cheap costing, and well fitting earbuds?": ["price", "fit", "sound quality"],
    "These are a wonderful buy.": ["price"]
}, {
    "Don't know if I got the lucky set that only wanted to work in certain positions inside the audio jack and is broken or what but mine had plenty of static in them.": []
}, {
    "I was looking for an inexpensive pair of earbuds to keep with my tablet.": [],
    "I've owned some decent Sony & JLabs but did not something I'd miss too much if they got lost/broken.": [],
    "These sound tinny out of the package, which by the way was a damn blister pack that cut my hand.": [],
    "The packing probably cost more than the product!": [],
    "Nontheless I turned my mp3 palyer on a moderate volume level and walked away.": [],
    "About 8 or so hours later I checked them and the sound was really good.": ["sound quality"],
    "I'm going to keep burning them in for about another 10-15 hours and start using them.": [],
    "For now the only &#34;con&#34; is the wire is a bit on the very-thin side, with some thicker cables it would rank a 5.": ["cord"]
}, {
    "For the money these plugs can't be beat.": ["price worthy"],
    "Audiophiles probably wouldn't let these pugs within  foot of their canals but if your looking for something that replicates better than average then this is the ticket.": [],
    "I bought 3 pairs to leave in various locations and for that purpose they are ideal.": [],
    "Can you find better?": [],
    "No doubt.": [],
    "I listen to all different kinds of music as well as talk shows with my portable devices and these do just fine are comfortable and cheap.": [],
    "I would recommend this product for the type of use I described.": []
}, {
    "great  earbud  love  the  bass  love  the  sound  love  the  way  they  fit  in  my  ear  this  is  one  good  sounding  earbud  yes  I  would  buy  this  item  again.": ["sound quality", "fit"]
}, {
    "My Sennheiser earbuds went missing, my Apple earbuds are long gone, so I needed a new pair.": [],
    "Tried using an old, bulky pair of Aiwa Noise Cancelling on ear headphones and the sound wasn't as good, the active noise cancelling worked, but earbuds are nearly as effective.": [],
    "I don't remember the model number of my Sennheiser, but they sounded great and I had them for a few years.": [],
    "They were $50 new, so they weren't inexpensive.": [],
    "After reading many favorable reviews here and deciding I didn't really want to spend $50 again, I bought these.I am not disappointed.": [],
    "They don't sound as good as the Sennheisers, they aren't nearly as crisp in detail and a bit muddy, especially on older recordings played on an iPod Touch 1G.": ["quality"],
    "But for under $10, they are fine and are probably much better than the no-name earbuds I was considering from a discount store.": [],
    "I've always had good luck with Panasonic brand items.True audiophiles will want to look elsewhere, but if you need decent sound for a  price that won't cause you to worry about losing them or breaking them, these are for you.": [],
    "I found them comfortable to wear, personally, on the smallest earpiece.": ["comfortability"]
}, {
    "I used to have a problem listening to low volume output sounds.": [],
    "Especially for those not original movies.": [],
    "But with this unique ergo design, it addresses that problem.": ["design"],
    "It's just like putting both hands on each ear to capture all the sounds.": ["sound quality"],
    "Likewise, if you don't like the whole sound, you can adjust the fitting in your ears.": ["fit"],
    "I like it and bought my second piece right away.": []
}, {
    "These by far are the best headphones I have ever had.": ["quality"],
    "The sound quality if great, obviously not top of the line but it gets the job done well.": ["sound quality"],
    "Usually headphones only last me about a year before something goes wrong.": [],
    "One side goes out or the cable needs to be help a certain way for the sound to work.": [],
    "I have had 3 different DRE beats headphones and many other skullycandy, sony, and you name it brands that have all last less than a year.These have laster me over 2 years and the only reason I'm replacing them is because i dropped them outside my house on the street.": ["durability"],
    "My girlfriend found them later that day and they had some damage, as if a car ran over one and the sound was a bit low on that side.": [],
    "Amazingly they still work but I'm replacing them because I really don't expect them to last too long with that damage.": [],
    "I wouldn't recommend anyone run over their headphones but WOW can't believe how good the build quality is.The only thing I don't like is that it has no volume control on the wire.": ["quality"],
    "I would gladly pay a little more for a future model that includes this.": [],
    "If you go through headphones like I do then look no further.": [],
    "THESE ARE FOR YOU!": []
}, {
    "Good sound... pretty colors... the price matches the quality well... great if u just need some basic, pretty earbuds... especially good for a classroom": ["sound quality", "color", "price"]
}, {
    "I realize they probably sound good for the money, but Apple EarPods blow them away, as do the previous generation iPhone headphones.": ["price worthy"],
    "You can do much better.": [],
    "Search the web for a multi-IEM review.": [],
    "(IEM stands for 'In Ear Monitors')": []
}, {
    "I wasn't expecting much from this inexpensive ear bud but I didn't expect it to sound as bad as it did.": ["sound quality"],
    "There was absolutely no bass and treble wasn't much better.": ["sound quality"],
    "it sounded like an old AM radio with bad speakers.": ["sound quality"],
    "Yuck.": []
}, {
    "I got these for my grandson to listen to his iPod and he says he likes them better than the Apple original.": [],
    "Well packaged and shipped in a timely fashion.": ["packaging", "delivery time"]
}, {
    "I bought 3 pair.": [],
    "My husband was always complaining about my having earphones in & listening to a book.": [],
    "I wouldn't hear him when he talked to me without my attention.Also he didn't understand about my listening to a book for an hour before sleep.": [],
    "So I gave him a pair to use with my Kindle & he is stuck!": [],
    "Listening for an hour before sleep every night!": [],
    "They're comfortable (you have to make sure you are putting them in right) & I was pleased that each pair came with a choice of 3 size cushions.": ["comfortability"],
    "I use Med & he uses the Large.My sister does not like them because they cancel out most of outside noise.": ["noise cancellation"],
    "That is one reason I like them so well.The earphones that came with my iPod (she loves those) hurt my ears & fell out a lot.": [],
    "NO problems with these!": []
}, {
    "Very nice, balanced sound from these - no boomy base, no high end sparkle, just inoffensive, nice, reproduction up and down the spectrum.": ["sound quality"],
    "Angled insertion works very well.": [],
    "For the money (like $6), a fantastic purchase, and a great starter bud to introduce folks to &#34;sound without spikes&#34;, i.e., no artificial bass bump nor exaggerated highs.": ["price", "sound quality"],
    "These allow enjoyable listening for long periods without fatigue, in itself a wonderful attribute.Recommended.": ["comfortability"]
}, {
    "comfortable to wear and they do not hurt your ears.": ["comfortability"],
    "light and love how I can wear them for a long time while working out or just somewhere quiet and you want to watch movies on the phone or tablet.": ["comfortability"]
}, {
    "Fantastic sound at a great price.": ["sound quality", "price"],
    "Our son is extremely hard on earphones.": [],
    "These sound great, they have several different sizes of earpieces to fit small to large ears.": ["fit", "sound quality"],
    "I use them as well.": [],
    "Plan on buying several more.": [],
    "Just great.": []
}, {
    "First I need to say I didn't give it 5 stars for the wrong reasons.": [],
    "I really like Apple's cord on their headphones and I'd have given these 5 if they had the same type.": [],
    "But I cannot knock them at all considering the price.": [],
    "Really good sound but seem quieter than some of the other different headphones I have.": ["sound quality"],
    "If you want a basic set of ear buds without any controls on them you can't go wrong with these.": [],
    "I have more expensive ear buds I use normally but I got these for an upcoming trip.": [],
    "I didn't want to take my $$$ ones with me.": [],
    "I'll edit this review if it turns out I don't like them for some reason.": [],
    "But they really do sound great.": ["sound quality"],
    "The plug fits into my iPhone w/ the Amazon TPU case no problem.": ["fit"],
    "It also fits into my Nexus 7 w/ Seidio Active case.": ["fit"]
}, {
    "For the price these are awesome, I have multiple pairs in different bags so always have some handy for the gym, sound quality is great and has different in ear inserts to help with fit.": ["price", "sound quality", "fit"]
}, {
    "I can't recommend these at all.": [],
    "There is absolutely no bass at all.": ["sound quality"],
    "There's no &#34;fullness&#34; to the sound.": ["sound quality"],
    "It's all treble.I orignally wanted Auvio earbuds to replace the pair I've been using for several years.": ["sound quality"],
    "But, there were no Auvio earbuds available via Amazon Prime and I needed a new pair right away.": [],
    "My old pair finally gave up the ghost.I'm ordering a pair of Auvio and will use the Panasonic only in an emergency.": []
}, {
    "I don't really like the shape of these headphones, not comfortable to wear to bed - but they are good if you don't want to sleep in them.": ["design", "comfortability"],
    "They stay in your ears and sound fine.": ["design", "sound quality", "fit"]
}, {
    "I loved the feel of these in my ear and they sounded great, but in less than a year of daily use, they fraeyed and one of them almost broke off, the sound quite before that happened.": ["sound quality"]
}, {
    "I never buy super expensive ear buds since I just listen for enjoyment and don't worry about the appropriate levels of bass, etc.": [],
    "Also, I am frequently losing headphones or lending them out so I don't want to spend a lot of money on them.": [],
    "These work well for the price.": ["price"]
}, {
    "In my never ending quest to find a reasonably priced headset that has good sound, I gave these a try.": [],
    "The best compliment I can pay these is to say that at least it did not cost me that much money to be disappointed.": [],
    "Uncomfortable (of course, I find most in-ear headphones uncomfortable until I replace the cheapo silicone cushions with foam), and with poor (IMHO) sound quality.": [],
    "I am older, and my hearing is not what it used to be, but...": [],
    "I did expect that these -in-ear headphones would provide adequate amplification.": [],
    "They did not, and the sound they did produce was what I could only describe as tinny.": ["sound quality"]
}, {
    "I purchased these after a positive review by a cnet editor, who claimed they are cheap and deliver good sound.": [],
    "But alas...These headphones are a last resort, in-the-pinch sort.": [],
    "I won't give them one star since they work (i.e.": [],
    "deliver sound).": [],
    "But the sound is very tinny and distorts very easily if the music volume is at or above street-listening level (as opposed to library-listening level), as well as if your EQ is set to deliver any small amount of bass.": ["sound quality"],
    "Another thing I didn't like: when you move your head while wearing these, or if the very thin cords move against your clothing (e.g.": [],
    "walking or jogging), the cord rattling sound is very loudly transferred to your ears; so much so that it was very distracting.I'm not picky about style so the minimalist design of these Panasonics suits me fine.": ["cord"],
    "Another plus for me is that the cord splits and two equal lengths lead to each ear piece, as opposed to a short cord for one side and a longer cord for the other side after the split.": ["cord"],
    "But these are very minor pluses.": [],
    "This Panasonic line offers great selection in colors and unbeatable prices.": ["color", "price"],
    "The set comes with three sizes of comfortable ear fittings.Despite the few redemptive qualities, these headphones lack what I consider the most important attribute of any headphones; good sound quality.": ["fit", "sound quality"]
}, {
    "I think my opinion on these headphones are about a mixture of the Most Helpful Favorable and Critical Review.": [],
    "On one side of the fence these things are pretty darn good for a pair that costs &#60;$10 and as somebody who isn't an audiophile I am very happy with the quality that I get from a pair of in-ear headphones that I won't have to protect like a price Jewel.": ["price", "quality"],
    "The bass in these things will leave you shocked by how great they sound in your ear.": ["sound quality"],
    "Now with that being said, I have a pair of $30 Over the Ear Seinheisers that blow these out of the water so the point should be made that if you trying to get quality with a strict budget, you may want to look elsewhere and spend just a bit more money.": []
}, {
    "I've bought several pairs of earbuds hoping to find great bass in an inexpensive earbud, but I've been disappointed every time.": [],
    "These earbuds are no exception.": [],
    "They certainly have good, accurate treble, and *maybe* at a volume high enough to damage your ears they would have good bass (I wouldn't know), but they don't meet my requirement for a good workout earbud with a strong (but accurate) bass.": ["sound quality"],
    "I own the Thinksound ts01 and the V-MODA Vibe and both of these buds have a much superior bass even at a moderate volume.": [],
    "I paid a lot more for them than the current price here on Amazon (as of today) too.": []
}, {
    "Remember there are no iPod controls or anything, but if you need some headphones that sound pretty good and seal up in your ear with one of the 3 sizes of rubber that come with...these are what you want.": ["sound quality", "fit"],
    "I use them while riding my motorcycle.": []
}, {
    "Shipped  as advertised and in original packaging.": ["packaging"],
    "These sound as good as a set we have costing much more and the fit is excellent.": ["sound quality", "fit"],
    "Construction for the cost involved is very good and what we had expected.": [],
    "We have ordered another pair and would very highly recommend these for the price!": ["price worthy"]
}, {
    "Sound good and fit comfortably.": ["fit", "sound quality"],
    "I bought these to replace a high end pair and I wish I could have kept the Silicon wires as these will always keep the kinks and look cheap and messy.": [],
    "5  stars for sound and minus 1 for cheap cord.": ["sound quality", "cord"]
}, {
    "the headphones are a little boomy with little depth.": [],
    "Bought these for my wife to use on an airplane for the noise isolation.": [],
    "The noise isolation means nothing to airplane noise and this set required my ipad sound to be turned way up to hear anything.The oddly shaped ear plug is nice, however, and fits so much better than your traditional plug.": ["noise cancellation", "design", "fit"]
}, {
    "These are great earbuds with a decent sound for the price.": ["sound quality", "price"],
    "Definitely has good bass and clear treble for the most part.": ["sound quality"],
    "Obviously not the crystal clear audio from some boss or klipsch earbuds but they are great.": ["sound quality"],
    "I use them to go to the gym and plug in to my bluetooth device, so far they work as expected.": [],
    "In order to hear the bass stick those suckers deep in your ears, but not too deep, sont want to get hurt haha.": []
}, {
    "These are much better than the normal earphones included with most MP3 players and at this price point are a good set of phones to have around as a spare set.": ["price"],
    "You won't shed any tears if you break or lose these.": [],
    "They provide an adequate sound for most types of music.": ["sound quality"],
    "If you want a fantastic set of earphones, then these aren't the ones you want, but if you're looking for a pretty good pair at a very low price, then grab these.": ["price worthy"]
}, {
    "These earbuds twist and tangle worse than any others I have had.": ["cord"],
    "After about two weeks use, they still will not straighten out and will tangle themselves up as soon as you let go of them.": ["cord"],
    "The sound is just so so, not much bass at all.": ["sound quality"]
}]
