[
    [
        ["I like my touch screens and love amazon.", "Screen is responsive and clear.For the price you can't beat it.", "I should have done more research...If you want an e-reader with a beautiful screen for video playback, internet access and SOME apps, get the Kindle Fire HD; however, if you want a full fledged android tablet look elsewhere.", "The wifi is pretty fast even with only 2 bars , very impressive .Lovely crisp screen.I am actually waiting for the Windows Tablet to improve so I can eventually get  that with work related apps since I  am a windows pc user...( dont know about 8 though)  And when I get a new MacBook Pro then I will get the iPad ...since I am both windows and mac user , I will end up with both devicesHowever I am not an Android user, I tried it but didnt like it so  this is the farthest  of an an Android type hardware I will get.", "The screen is very readable in any light.", "No problems getting the screen protector in place.", "Finally, no more restrictions.While I do slightly miss the clarity of the Kindle's screen and the speakers, it just isn't worth an additional $80 and the absence of the Google Playstore.", "It doesn't take a genius to figure out the basics, and I figure I'll figure the rest out later!CONS:Not being able to change the wallpaper, instead I have to look at ads all day.The set up is annoying- in order to find something quickly I have to swipe for like 5 minutes.", "Just a note to buy a good thick case because the Kindle screen will crack extensively if it is drooped onto a hard surface without a good bumper type case.", "After the second cracked screen I realized the hard way that the Kindle is not tough like my Motorola Droid Phone!", "This Kindle has a great picture.", "The Fire's speakers are by far more impressive than the Mini's and the display is much clearer.", "The backlit screen has cured all of her problems.", "Brighter screen plus you can watch Amazon Prime videos and get to borrow a free book a month.", "The screen is awesome.", "My friend has a Nexus and the screen looks like my old gameboy screen.", "The sound from it is amazing, and the picture quality is actually better that the Nook, even though the Nook specs appear to be better.", "I think it is related to the way the pixels are arranged.", "It certainly has a sharper display.One of the best features isn't the device - it's the service!", "The screen is very bright, colors are nice, and I can't see pixels, even when reading small print.", "It does these things well and I am still learning the many other things it can do also.A few things I like:the beautiful screen, excellent sound, the sepia background for reading books is very restful on the eyes,long battery life, easy to use, lightweight even in it's case, 7 inch size makes it very easy to take anywhere,I can use it outside in the sun with the brightness turned up,Text to speech sounds great, lots of free and inexpensive apps in the Amazon store.The ads don't bother me at all and I like the carousel, also the little star for favorites.What I don't like: it did not come with a  wall charger, no collections, and a hard to access power button, (I bought a MoKo case with the wake/sleep feature so that takes care of that problem) butall in all it's a very nice tablet for $199.", "My wife has an iPad and there are some things it certainly does better, bigger screen, internet browsing, but it cost 2.5 times more!", "I like the size for reading and set the screen lock on, turn the brightness down and enjoy reading in bed!", "The only downside, and the one that kept my wife from wanting one, is that it is significantly heavier than other Kindle readers.I access the web on my laptop and phone as well as on this, but the Fire HD has a gorgeous display and works well for most quick web access needs.Highly recommended.", "They are only on the lock screen.", "the picture is amazing.", "It has a great picture on the 7&#34; screen and you can connect it to your HDTV to play the movies on it.", "The latest Android 4.3 gives excellent multi-user capabilities and the graphics are very smooth and makes the overall tablet perform faster.3) We have to PAY additional money to buy the charger?", "It just does so many thing, just about anything i can do on my laptop and with the case and screen protector I dont worry too much about it getting damaged.", "The picture quality is AMAZING!", "It has issues such as pixel out on screen (leaves a blind spot on screen) , will not take a charge, goes on and on.", "The HD screen is stunning as I use Netflix and watch hd youtube videos which really look amazing.", "The screen went out and Staples would not stand behind it because it was purchased during sale at a sale price that Amazon was giving.", "I was impressed with the screen resolution and audio on the Kindle Fire HD and decided to purchase one for use as a smaller device that I can easily take with me anywhere and listen to audio books in the car.", "The screen resolution is great, the audio is great and it is easy to set up and use.", "If I decide to remove them it will only be to get rid of the lock screen which is an extra step I don't care for.", "The display is stunning, sharp, and beautiful ... the audio is good (for a small device) ... the size is perfect for my needs, plenty big enough to be an excellent reader, but not to large too carry around.The keyboard and other touch-screen interfaces work beautifully ... this truly is a user-friendly device!I really like the combined inbox format, which puts my e-mails from all of my e-mail accounts right at hand ... so easy to use!I also like the huge assortment of apps, books, games, etc for the device!The only minor downside I've had with it is a little bit of adjustment and time in getting used to the Silk interface (the Amazon proprietary user interface that's atop the Android operating system).", "I love my new Kindle Fire, although I have to say the design of the &#34;home&#34; screen leaves a lot to be desired.", "The sound is decent and the picture crystal clear.", "People with memberships to Audible will notice the integrated bookshelf and the fact that the books no longer share a single entry on the carousel - they appear like a kindle book with a picture of the cover and a percentage indicating how much you have completed.", "The screen is so sharp and responsive.", "I already have a few tablets but all of them are 10\" displays so this would take the place when I wanted a smaller display.", "The display KILLS the iPad and iPad mini as well as the android tablets I have.", "You can use the pinch zoom feature to increase the screen image and zoom in, but this so annoying when you are reading because you have to constantly scroll.", "I no longer have to mess with cds for audiobooks  i can stream from prime or netflix anywhere in my house  one of the best things is that the screen has backlight so you can actually read books in the dark on it.", "The fact that it has better screen resolution than the iPad Mini is what originally caught my attention.", "But for the rest of us, this device does pretty much everything that its Apple counterpart does and does so with better screen resolution (and at a fraction of the price).", "It's been a little over a month so far I love it definitely a media geared device but that's what I wanted as far as complaints about adds its only when you turn it on when screen is locked so who cares unless you want to look at a locked screen great picture quality great for reading very easy on eye's so far I love it", "It works well and has a nice sharp and colorful display.", "The screen looks great.That being said, it is noticeably slower than the nexus 7.", "i dislike the related purchase bar at the bottom of the screen.", "I got my daughter the second generationKindle Fire 7\", LCD Display, Wi-Fi, 8 GB - Includes Special Offersfor Christmas 2012, and when I used it a few times, I realized it was MUCH better than my first generation Kindle Fire.", "Plus the screen itself is clearer in HD.", "The screen on my old Fire was great, but this is better.", "Everyday tasks can be performed with easeThe screen is beautiful and it is way cheaper than an iPad.", "There are also way too many ads, I don't mind the lock screen but at the bottom of the home screen is more ads/suggestions......", "Easy to operate and has a great screen as far as clarity goes.", "It's a full color book with graphics, charts and photos and I'm anxious to see how it looks using the KF8 technology.The value can't be beat when it serves both business and personal needs for an up to date device.", "It hasn't been in use long but I am hopeful that there won't be the problems that have been associated with touch-screen technology in the past (ie screen quits responding, broken internal ports, weak pixel refresh rate etc).", "Great picture for watching TV shows or movies.", "The backlighting on the screen is very bright and the color screen has a nice sharp image.", "Organizing pictures is super difficult and the camera is not very user friendly.", "Easy to read for the brightness.", "I can read in almost any light (bright to dim) and be comfortable.", "Cell phones certainly provide all of that, but clearly with a smaller screen.", "The fireworks, teaching colors, animal sounds, games.", "The boy learned quickly how to touch the screen to hear an elephant or a fire engine.", "In portrait mode 1/3rd of your entire screen is taken up by \"Recommendations\"I cant look at my tablet and admire its beauty without something telling me what I might like.Like an annoying X-girlfriend you want to tell it to leave you alone!Even if I paid the $15.00 ad free fee, those stupid recommendations are still there.", "I'm capable of finding what I like.If you ever used another android tablet, an Ipad or even an HD Touchpad - you will feel very caged using this tablet.It goes back Monday.", "Android really makes the kindle fire HD shine !We plugged into our HD tv last night to see how movies played on the big screen wooohooooo simply out of this world ..", "Pixels make the screen so bright and colorful its hard to put down we have not even scratched the surface yet .", "Here are my observations:Pros -+ Quality; I could not tell that either of these were refurbished+ Screen; bright and sharp, much better than the original Kindle Fire+ Touch Screen; responsive and easy to use+ Apps; runs most Android compatible apps, including most of Amazon's free app of the day+ Kindle; supports kindle book format, which is good since we have used these for quite awhile+ Cloud Access; great for accessing my pictures, music, and books while on the roadCons -- Sound; while OK, it lags behind other devicesMisc -* Wi-Fi Only; the model we have only supports Wi-Fi, not cellular, which we knew when buying but it might not be the right choice for everyone* Ads; again, we knew these showed adds and are happy that they are non-obtrusiveOverall, we are all pleased with these and use them daily!Recommended!CFH", "This screen is not yellow like my previous one.", "plus me and touch screens, not too compatible.", "and I was surprised to find how easy it was to set up, touch screen fears are quite eased now.", "I also bought a bluetooth keyboard, and that is nice when I'm writing emails or commenting on Facebook; it's easier to use than the on-screen keyboard (which seems to not like to register the space key sometimes, so my words run together).All in all, I am very satisfied.", "iPad not as easy.-I get books from the Kindle lending library free, you can ONLY do that on a Kindle-Home page is a little over-engineered on the Kindle, but now that I'm used to it, I can get to stuff really quickly, and it's very intuitive.-Screen is very clear.", "Another complaint is that the screen doesn't auto correct so you have to turn the game upside down/or around to be able to play", "The HD screen is very good for my needs and love the dolby sound and the speaker work great for my needs.", "I was pleasantly surprised that I could easily check out and return ebooks from my local library while I was traveling, and I caught up on my Game of Thrones which looked great on the screen.", "I love the fact that it has such a great screen and great graphics.", "(Yes ,better than the smaller HDX of  this year, the newest version)The screen ,while not as sharp as the HDX,is brilliant.It has an HDMI connection that projects to my big screen TV with remarkable clarity.It is blu ray quality.Curiously, the picture is sharper on the TV from this 7 inch tablet than from the 8.9 version.Of course as you may or may not know the HDX does NOT have a HDMI connection and you must rely on having a smart samsung TV or other equipment(playstation) to get it on the big screen.", "The Kindle screen image is far better than my brand X .", "I got the one with ads, and it's not annoying at all to me, it's only on the first lock screen, and most of time it's useful ads that you can actually look into and find interesting stuff.", "The screen is great for reading books.", "Love the Cloud feature to store books and pictures.", "But, it's what is on the screen that is different.", "But, I love it because the picture is great, the sound is tons better.", "I also appreciate the customers also bought items displayed it gives me options of selecting other books I may be interested in.", "The screen is flawless and crystal clear.", "I have been thinking about getting a tablet for years... Just could not bring myself to spending 500+ on an iPad but could not find a reliable tablet with good apps and graphics for video.This is not a iPad replacement but a great alternative that costs must less!", "As far as usability and portability, the 7\" HD screen is perfect in my option.", "You can buy 2.5 of these for the price of one iPad....If you are between this and the $159 non HD, get this, it's well worth it just for the screen and the sound quality!!", "There are few printers compatible with iOS products, the Kindle fire recongnized my Epson NX420 and printed in color, same with an older HP laser jet.", "The screen is amazing.", "I havent turned off the lockscreen offers yet since I actually dont mind them n find some helpful.", "The screen is brighter, the sound is so much better, I love that I can control it, the touch screen has quicker.", "It is in full color, the reader is a crisp white that can be toned down per preference.", "Its light weight I really like this.", "The crispness of the screen is amazing, it responds so quickly to touch, and it operates faster than the old Kindle Fire.", "We have had our Kindle fire for nearly two years now, and it gets used almost every day.The feel, the look, the graphics and display are all very good.", "When it does display lists in the in box, it often will not open the message.", "I have the version with the advertisement when the screen first opens, and that is fine, but I wish it would show the time on that screen.", "The fingerprints on the screen are bad unlike Samsung tab.", "The screen is crystal clear and super sharp.", "The HD picture quality is absolutely fantastic.", "The picture is awesome and it's very easy to navigate!", "The display for text in books is very easy on the eyes, which is really important for me.", "iPad mini seems to be slightly larger screen.", "Wasn't sure I would like a lighted display but that concern went away after about two minutes.", "The best part for me is the size, weight (can be heavey but not terrible) and the screen is truely beautiful.", "The only area for improvement would be that the apps available are not as widespread as the Googly store; however, I find it to be sufficient in this area.", "I have to say even though the screen is smaller, I actually prefer to watch video on my Fire.", "It works great...great screen quality...the speakers have a lot to be said for...not so great...but have not tried with headphones yet so can't say if that is better.The headphones I have don't seem to work...it would appear not all will work with it as my sons original pair did not work with his as well.One word of caution...have heard this from a lot of people and can easily see it...the apps are generally real cheap and you will spend a lot of money without even knowing it...a little bit here and there can add up fast in a month.So far I would have to say I would highly recommend this...I know my son is happy with it...if he is happy I guess I am happy.", "The inch bigger screen than the Kindle makes a big difference but it still can be held in one hand.", "I also wish It wasn't locked into Amazon so tightly.The quality of the screen and the service is great.", "So far I have no complaints except for applying the screen protector which I noted at the appropriate board.", "To the key spacing and the \"touchability\" of the screen which is a nice improvement too,that I actually seen some people complaining about here.", "The screen resolution is so much better then ipad mini.", "I flew with the other day and the person next to me had an iPad mini and their resolution was not as good as mine.", "The second thing you notice is the screen is very nice.", "Such a small screen!", "I am really impressed with the screen, the sound and the speed.", "It is a nicer screen.", "Sharp display with great color.", "The display is picture perfect.", "He tells me that he is able to read books, Internet browse, take pictures, and a host of other things that this item provides.", "I've also been able to drag and drop photos in Windows 8 file explorer that I've taken with my Canon camera onto the device and display them to friends and family.", "This is my first touch screen device, so I don't have much to compare it with, but I got to say, It is a lot of fun.", "The screen is the perfect resolution for this limited size (7 inch) and it's bright and crisp.", "Great screen.", "Amazing gadget, not going to replace my computer at home, but travels well.Con:  Screen lock keeps coming on when moving tablet.", "The screen resolution is wonderful.", "It rivals the clarity of my flat screen TV in its color depth and contrast.", "I have not yet tried any videos but have up loaded pictures and they are excellent.", "I recommend purchasing a stylus so as not to scratch the screen with your finger.", "The screen was bright enough where my eyes didn't suffer.", "The picture and sound put my laptop and computer to shame.", "I got the smaller screen for the portability function; however, after buying my parents the HD 8.9, I will likely upgrade to the larger screen in the future.", "I have the Wi-Fi unit which connects without a hitch.The screen is bright and sharp, and the color is brilliant.", "Very easy to use, brilliant screen and great sound.", "The quality of the HD is great even though you may not compare that to apple product with retina display.", "The screen is so clear, i love watching movies on it.My son is loving every bit of it.", "I would of loved being able to take pictures beign that the clarity if so perfect.", "The larger screen is not only bigger but also has a sharper image.", "Still having to learn how to get to full screen.", "The high definition screen is terrific, both pictures and text.", "I also have and iPad and an Asus tf300 tablet running Jelly bean so my experience with tablets is not limited.I think Amazon has done a great job with the 7\" hd, the screen is absolutely gorgeous and the experience all together is very satisfying.", "Not as fast as my Android tablet or iPad but not so slow it matters.Altogether I give the tablet a 5 star because of the build quality, the beautiful screen and value for money.", "I find that it has performed admirably for everything I wanted to use it for.Pros:The screen is great quality, even next to my retina ipad.", "It's hard to keep the charger plugged in and watch video since the plug gets in the way plugged into the bottom of the screen.And side note -Get the Amazon Kindle Fire cover for it.", "No manual and the on screen instructions are very minimal.", "There are many reviews of customers purchasing falsely advertised apllications and ending up with something (example a 2 minute puzzle of the picture dipicted in the display) instead of the game that was advertised in the description.", "On the plus side: the screen is gorgeous; the browser fast; the sound a 100% improvement on the original Fire.The negatives: the ads are horribly intrusive (I own three Kindles with the special offers and haven't unsubscribed from any of them); on the Fire they take over half the screen.", "(I have a huge laptop that I hate lugging around).The Kindle fire hd covers these bases with flying colors, for a very fair price.", "Terrific HD picture, lots of features, including good speakers.", "I am amazed at how fast it works, how good the hd picture is , and the amount you can get done with a little portable touchscreen.", "Great picture quality."],
        ["screen", "picture", "display", "color", "graphics", "clear screen", "hd picture", "surface", "picture quality", "hd screen", "sharp display", "clear picture", "color grapichs", "bright screen", "great graphics", "picture quality", "screen quality", "resolution", "touchscreen"]
    ],
    [
        ["My grandson plays Subway Surfer and he worked for months to get the guys and prices by collecting all the boxes and points.", "That being said, I gave it 5 stars, because what it does do, it does REALLY well and for a SUPER cheap price!", "Well worth the price I paid.", "I was able to see and hear my movie without any pauses.I absolutely love the tablet and can't believe the price!!", "On the other hand, I already have a laptop for mobile computing, and was already an Amazon Prime member so this provided extra free content in addition to the lower cost.", "(I considered giving this a 4 rating because of that omission but took into consideration price differential).", "Hope that capability will be available in the future if price is not the issue.", "My cost was $0.00.", "It's just as fast as the kindle and it's half the price.", "Ok I love my kindle fire HD but the only thing is that it says with special offers and I selected it and apparently it cost more as well but I did not receive and thing extra and it would be nice if it came with a wall charger but it just comes with a usb charger that you would hook up to a computer but on the other hand it's the supercharger as most smart phones today the flat charger and it works just the same and it would be nice if it did have a sd card slot for more memory but I guess it just depends on what you plan on using it for i am on it now but overall it's a great investment I just know next time to spend a lil more money and get the 32g kindle", "Couldn't beat the price.", "After buying the Fire I cannot see why the Ipad is still selling at the prices it does.", "Very high quality feel and appearance, easily the equal of tablets costing twice as much.", "FAR better than other tablets at this price point and below.", "Good pricing on sale, excellent video, better audio than ipad.", "It is especially wonderful for kids, well worth the price.", "First and foremost...Hardware... 1.2 ghz is ok, video is very good, but I don't think it's noticeable enough to pass up it's competition that is $30 cheaper and has some major advantages.", "Right now the Samsung Galaxy Tab 2 is the same size, good looking screen...slightly (not very notiecable) slower processor and is in a very similar, if not better price range.", "I bought this because all the other tablets were too expensive.", "A week later the new price dropped 10 bucks lower than the refurb... go figure... then a week after that my refurb starts shutting down in the middle of whatever I'm doing and has to restart.", "This is my first touch screen and I have found I have a little bit of trouble getting it to register my touch but I ordered a stylus (cheap one .99 on Amazon.com) and I'm hoping this will help.", "The price is right, also.", "Much cheaper than other devices.", "I love the library option and the prime membership was/is well worth the price.", "I ordered another item with another name from another web site, because they had a great low price on it, got the and it was listed as brand new, but it was used it had a family pictures on it already, and on top or that before the day was out it stop working.", "It was purchased early for a gift because it was a great priceI contacted Amazon and they had no problem exchanging itI works great and very happy with it.Amazon has been very good about taking care of their customers.Thanks AmazonBut please do not go up on your Prime account pricing.", "It has all the features we ever wanted and is cheaper than most MP3s nowadays.", "We won this in a raffle, and I'm glad we didn't spend a couple hundred bucks on it (or whatever it costs).", "It is a fantastic piece of technology and for the price you can't beat it.", "Let's remember that it is $300 cheaper than an iPad.", "Overall, I love this device and its great price.", "Picture, size and audio all are good and well worth the low price in comparison to other tablets for the functions it performs.", "Didn't give it a 5 star only because of comparing to other higher cost tablets.", "It is half the price of an ipad, but just as cool, in my opinion.", "The price was right for me and I would not be without it...", "It's well worth the price, and I feel more love for my Kindle every day.", "The features that you might miss out on when compared to other tablets is nothing when you consider the price.The small drawbacks here are that while the item is very user friendly it can still take a while to get used to the layout, especially for first time users.", "We do however think it is a little pricy for what you get and of course we do realize that Christmas isn't the time to purchase new items like this as they most often come down in price relatively soon.", "I was going to grab the nexus 7 but the kindle fire was cheaper when I was shopping.", "I paid less than 1/3 of the price of an iPod mini for my last Fire HD.", "I love the price.", "Considering the relatively low cost ($200) the kindle fire is an excellent buy.", "Also the price I paid was in my price range (affordable).I have it with me all the time.", "the price.", "The Kindle Fire HD 7\" is certainly worth the price.", "I love the device, good value for $199.Pros: Price, functionality, performanceCons: A little heavy.", "then one day I was mentally listing all the things I wanted to DO with a tablet (email, Facebook, surf web, pay bills, watch video), and realized that the Kindle Fire HD did everything I needed, at a much lower price.I had to turn the autocorrect off, because it was annoying.", "At this price it was an unbeatable deal.", "its a good device for the price and if you use Amazon Prime and Prime videos its good device.", "Great Price!", "At only $199, the looks, usability, durability, beats the Nook or any other comparable low-price tablet out there.", "Overall, for the price, and being an avid Amazon user, this little device is awesome, fits great in your hands, big enough screen for most activities, and just pretty sweet.", "I want to Thank Amazon for having it at the still low cost.", "The Kindle fire HD is well worth the price.", "Great product for the price.", "If all these little things bother you then get the Apple I Pad and pay the higher price.", "Personally I think this Kindle HD is an excellent product for the price.", "The Kindle Fire HD is amazing, especially considering the price!", "Also, there are many many Kindle books available on line for little or no cost.", "It is frustrating and surprising not to have the outlet charger adapter included in the box, so adding the price to buy one should be considered as the total cost for purchasing it ($20 for an adapter?", "really?)", "It's price had come down significantly to make it affordable.", "It's amazing you can get a device like this for this price!", "easy to set up, easy to get apps and pretty much does everything but cook for me &#60;3 super duper awesome price super fast shipping i am so happy i got this it acutally linked my first kindle to it what a great product", "Finally, and not least important, the Kindle Fire won out over the iPad mini based on price.", "This is a wonderful tablet, and price is better than others.", "Seems kind of cheap, especially since we are also purchasing Prime content from Amazon through the device.But, I like it, I want one (the one we purchased is for my son).", "I think its a great piece of hardware and worth almost every penny (even more now since they dropped the price to $140!)", "I love the fact that you can order e-books from the local library and it doesn't cost a thing.", "In addition, there are many books that aren't full price - $0.99 to $2.99 - so I'm not constantly charging expensive e-books.", "Kindle fire HD 7 inch is one of the best tablets for less than $200 price.", "If you  have this situation with your original Kindle Fire, this is an option, even if it is refurbished and cost you almost the same as the brand new one.", "for the price I recomend you getting one for your kids than a mini I pad.", "Kind of wish you could set something that it is a 9 year olds so have a logon right away when you turn it on because she won't really go into that part now because she knows she needs a password to get out.Very fast and well built product at a great price.", "But even at $79 a year it's still cheaper than NetFlix and you get more for you money.", "All Amazon offered was a $50 discount off a new HDX, or a replacement HD for $30 off the current price.", "But Kindle's $199 price is a winner."],
        ["price", "cost"]
    ],
    [
        ["There is a lot of overlap between a Kindle and a tablet, but the Kindle is designed mainly to deliver content, movies, books, music through Amazon and some other sources (public library, etc).", "Haven't downloaded any movies or music yet either, but I'm sure it will be great for those as well.", "My favorite feature is watching movies on it.", "I previously had a Kindle Paperwhite and really liked the size factor for reading, but I wanted the ability to read books as well as watch movies, so the KFHD 7&#34; was really more what I was looking for.", "I watch movies and read in bed and the 7&#34; had such a better form factor than the 8.9.", "However, I wanted to be able to use the lender's library and watch videos with my prime account, so I bought the kindle HD and gave my Nexus to my husband.First thing I noticed is that Amazon's app store is nowhere as good as the Google store.", "I was also able to listen to Pandora radio, read a novel in the dark, play games and watch a movie while waiting on a 2 hour line to get gas.My kindle was with me at all times during the week.", "Its portable and has awesome battery life.What I really appreciated about my kindle this week was that I could recharge it in the car so that I didn't need to constantly go back to the recharging station, and the charge lasted through movies, music, novels and games.I was able to take my kindle to the local library which still has wifi and surf the web and keep on top of the local news.", "My only complain is that I can not use all the video and music content in my location (South America).", "It has a serviceable web browser and lets one watch movies and videos as well as reading Kindle books.", "My only complaint would be that it starts to move very slow once you get some videos and music downloaded to it.", "I take it to work with me so I can still watch movies and keep up on my emails!!", "He also watches movies and some of his favorite cartoons.", "The screen is bright and clear and I often watch movies on it when I am in bed and nothing much is on TV.", "The prime is a must with an endless supply of free tv & movies, a good selection of free games, & you can download certain magazines if you have a subscription to them.", "My only problem with the Kindle was after about a month, I went to use it & it stopped working.", "She has a traditional one for her books, and this one is for books, magazines, movies, travel.", "Hello!The kindle fire HD works good and has very nice capabilities.However, when the things are about web surfing its really limitating the factthat you cant see web pages built in flash or even videos in the amazon web store as the first edition of the kindle fire 7\" let to do.", "I watched a movie with my free Amazon Prime trial which was fun and no less satisfying than watching one on the iPad.", "Plus I am having trouble downloading a couple didgetal movies we also got for Christmas.", "She has watched movies and read books and doesn't leave home without it.", "Movies & videos are very vivid & clear !", "Being able to listen to Pandora is perfect, not to mention the optionof viewing movies, checking e-mail, and fb.", "example: there are more tabs by the books and movies such as they added a photos tab.6.", "I have an original Kindle Fire, but I wanted to be able to watch my movies on my TV instead of just on my Kindle.", "I have an ipad 3 and the only time I use my ipad is to watch movies or use ebay.", "I mainly watch movies and read books.", "It has such a clear picture with video/photos, it blew me away.", "Bad move, Amazon.Anyway, you can put your own movies on it easily enough, and it's easy for my three year old to navigate.", "I bought this for a 3-week international trip so I could access wireless and watch some movies I downloaded before I left.", "Sorting movies, tv shows by Prime membership would be a bonus.", "Movies and apps download very fast, much faster than my wife's new iPad (iPad 3).", "However, if you simply want a device that allows for you to surf the net, watch videos, and listen to music and have it easily accessible, this device is for you.", "I got the free  month of Prime and we have watched movies, read books, magazines,  skyped, listened to music that I had transferred from my computer,  used the camera, dowloaded contacts, emailed, searched the web, bought from Amazon...", "so much to do with this device movies ,books magazines,apps.", "I am a musician and trust me when i say huge sound i cant wait to record some video and play it back with our Kindle .", "I ordered the Kindle Fire HD 7&#34; mainly for reading and viewing videos.", "I especially like the ability to download movies and watch them on flights.Convenient is the email feature.", "He just found out he can stream movies to it and I hope he doesn't figure it out.", "She enjoys watching videos, movies and playing games and gets hours of enjoyment out of it.", "I downloaded some books, some videos, some music, some apps, since my daughter in law has a kindle fire hd on my account and all of these things are available from our cloud.", "I haven't watched any movies on netflix or amazon prime videos yet.", "I have not attempted downloading movies to date.", "Watching videos that were uploaded or on prime, is awesome.", "Apps as well as movies are perfect for me.", "I load it up with movies for my grand children.", "It seems they would rather sit on my lap and watch a movie on the Kindle Fire than watch it on the big TV sitting right in front of us.", "I am use to HD quality videos, but not HD web browsing.", ")The biggest con, I have found so far is while I know there is less reflection on the screen when viewing movies, etc.,  it is still somewhat distracting to be able to see my face on the screen while watching.There isn't a wall charger included with the Fire, which is a shame.", "The video playback was far superior to the original.", "Looked great with PrimeHD videos.2.", "I bought this to take with me on vacation to watch shows and movies while traveling...or so I thought.", "I was able to download only the movies I purchased through Amazon.", "I have Amazon prime so I can easily watch movies at no additional price and have regained my interest in reading before bedtime w/out having the light on.", "I highly recommend becoming a Prime Member --I had the free trial when I bought this and decided to join because you get to watch movies and read books for free, which really makes it nice if you are stuck at an airport, or you aren't sure about a particular author and want to sample some of their writing.", "I've had some connection problems to the Video site but I'm not sure if that is Kindle related or something else.", "This was my first tablet.Amazon did a great job with both the picture and sound quality.Amazon prime makes this a perfect little device for watching movies.You can also &#34;1-click&#34; purchases just like you can on your computer.Very convenient.", "We have netflix, but he has been enjoying the movies on the Amazon prime library which seems to have some newer movies he likes.", "Videos Viditate!", "My daughters love the amazon library and we have both Netflix and now amazon instant video so we are never without something to watch.", "If it didn't have the benefit of Prime Membership (movies), I would probably not consider it for purchase.", "Movies and books get their own tab.", "Ive watched, two tv shows and half of a movie.", "The video looks great.", "I am an Ipad fan, but for the purpose of travel- reading a book or watching a movie while waiting in the airport or in flight- this was perfect.", "I watched The Grey, which might not be a great movie to watch before flying, however the qaulity of the viewing experience was very good!", "Such a great idea and I love the fact that I can limit the time on certain things like videos (those most on the freetime app are educational).What I wish is that I could put apps I purchase into the freetime app so that they wouldn't have to exit freetime to get to the other apps.", "Another big reason is I am a faithful Amazon Prime member and wanted all of my free prime video content, which Apple refuses to let me watch on my ipad.", "The 32 GB is the best version to purchase because it holds more books, movies, etc.", "Now I am using this tablet to browse the web, watch videos, play games, email, review documents, look at pictures from my cloud storage...etc etc.", "I was able to put my own movies/videos on it which was very nice.", "It is strange that the titles of your personal videos does not show up until you click and hold them for a second.", "Although I'm not a big movie buff, in recent years, our local movie rental places have been closing so when I did rent movies, I had been streaming them from amazon.", "The only problem I have with it is that when she tries to watch any type of TV show, movie, video, ect, it freezes alot.", "She also loves to read and find interesting videos.", "So many free movies, tv shows, books, the internet and within seconds she had her email set up!!", "Also purchased a video player - BS Player, and ES3 file manager, both of which I love and works like a charm.", "I drag and drop youtube videos downloaded with Real Player from the Real Player video folder into the kindle fire video folder and I'm able to watch them with the BS Player.", "Also have watched movies from Amazon, as I'm a prime member.", "I have two laptops for work and my small business, but when I want to relax and read a book or play a game or look up something quick on the web or watch a movie (order the less than $10 cable connector here for your Kindle to your tv).", "I added the Amazon Prime because I get to borrow one book free a month, like the videos better than Netflix and the quality of the streaming, and there are added percs and discounts like the expedited shipping.", "Very nice , easy to use , simple tablet , I have Lenovo and Apple to , but this one is rely good for movies music and a fast use , keep in the pocket , use in car , truck everywhere.", "They have for me their own cons and pros w/o comparing them and I can use them both for most stuff, but I prefer one over the other in a few things... like reading is better in the Kindle, and to watch movies as well...  iPad have somethings I like better than the Kindle..But AMAZON CUSTOMER SERVICE outdoes Apple anytime.", "Mostly for watching HD movies.", "You can download your own pictures and videos to the Kindle.", "I have downloaded music (@.99) from Amazon to the mp3 player on the Kindle and rented a video ($2.99).", "I have a new ipad I use for productivity and studying, so I meant this to be a smaller way to read news and books, watch videos, play games, and browse the web.", "As a Prime member, I love watching videos on the super-fantabulous screen, and I like being able to stick it in my purse.", "My wife and I also recommend Amazon Prime which we joined when we bought the Kindle.You have access to thousands of books and hundreds of good movies with your membership as well as 2 day free shipping for any item purchased and fulfilled by Amazon.", "Fifty percent or more of the movies are current movies unlike NetFlix.", "The movies alone are worth the membership and the total membership is less a year than NetFlix.", "With the BlueRiggerHigh Speed HDMI cable you hook up to your flat screen and get BluRay quality video.", "Great for watching videos and movies (a bit small screen for movies but very good quality).", "About $6 a month for movies, tv, one book rental a month, and two day shipping?", "You want movies, tv, or books on the Nexus you have to buy them all a la carte.The small cons of the Kindle Fire are as follows:Not really the full Android experience, so if you expect the navigation to be the same as your android phone you will be disappointed.", "I have downloaded a few music albums and love the sound that this little tablet has...I have had no glitches in watching movies..they all stream quite nicely..It is so easy to go to the Amazon store and download anything..I have tried many free games, play them and delete them from the device if I don't like them..", "It allows me to set up an account for my kids, but set limits on how long they can watch videos, play games, and read.", "Beside reading you can do so much more,weather apps, language translation, watch movies, download music, the web to name a few.", "(movies or comedy specials) I can browse the internet just like my pc or laptop.", "Movies are playable, with excellent image quality, though ultimately your'e still staring at a screen the size of your hand and hearing a soundtrack with analogous auditory constraints.", "My main gripe: I bought the \"Kindle Edition\" of a book with \"enhanced content\" (i.e., embedded videos) that will not play on the Kindle."],
        ["movie", "video", "prime video"]
    ],
    [
        ["But why not be honest and tell us we need to buy a charger because usb charging is a joke.", "Battery life is many hours (several hours with video streaming), and it does everythingthat is is advertized to do without a glitch.Perfect.I would strongly recommend purchase of this device.", "The power charger, screen protector and stylus work well.", "Charger does charge quickly.", "Battery only lasts about 3 to 4 hours max when I used it to just do echat via Yahoo Instant Messenger (YIM) w/o webcam - not as it's described2.", "Hard to activate the Battery.", "I have bought two kindle fires (one original and one HD), and both had power/charging issues--something happened with the connector port.", "The power button is also flush with the side of the Kindle and it can be a huge pain to find without looking for it (good luck finding it in the dark).", "I USE IS EVERY DAY...DO MY EMAILS FROM 4 DIFFERENT EMAIL SITES...I HAVE THEM ALL MERGED INTO ONE SITE NOW...LOVE IT...I HAVE ALL MY KIDS PICTURES AT HAND, PLAY GAMES...LOOK UP INFO ON THE WEB...AND WATCH TV & MOVIES...AND OF COURSE READ BOOKS...I WISH THE BATTERY LASTED LONGER THAN IT DOES, BUT THAT IS NOT A REAL PROBLEM...I JUST HAVE TO REMEMBER TO CHARGE IT...IF THERE WAS A PHONE IN IT, IT WOULD BE PERFECT...", "Movies are great, books outstanding, and the battery - well, you know how that is.", "Just remember to charge it every night and you'll have no problem.", "A couple of things I would change, though:  the power connection is on the bottom, so when you use the leather standing case (which I have)and want to watch a movie with the charger plugged in so you won't run the battery down, you're out of luck.", "It would be better, in my opinion, to have the charger connection on the side or top.", "It's very simple to use and has a pretty decent battery life.", "We tried the \"hold power button for 20 seconds\", switching USB ports, switching USB cables, and adjusting preferences to \"show hidden items\".", "Beats lugging my laptop with me.The only downside other than being more clear about not having a charger included, is they could havesaid it was needed if you did not have anything that needed usb chargers at all.", "But I hopethe selection of apps will improve in time.", "at first I had a problem with the battery but Amazon worked with me right away and we got it straighten out.", "I received my Kindle HD as a gift and I am very happy, the battery has lasted for nearly 2 days and that's after watching a couple of movies and web-browsing or playing games.", "Amazon makes it easy to buy exactly what you want, and get charged in a manner you would expect.", "I was able to recharge it quickly at a charging station and watch movies (downloaded to my device using the librarys wifi) during the cold nights in my home.", "It was much easier to carry around than my laptop, and kept its charge much longer.", "PLEASE NOTE: The charger does NOT come with the new Kindles so MAKE SURE YOU PURCHASE A CHARGER unless you don't mind the 11-13 hours to charge on your computer (yes it comes with the USB cable).", "Not really a complaint but just wanted to mention that the battery life doesn&#8217;t last as long as the advertised 11 hours.", "I let the battery run down to about 20%, recharged it, & it works fine now.", "Perfect size and great battery life.", "When your reading turn off your Wifi cause it will drain the battery faster.", "I also recommend the Amazon case which fits perfectly, the fast charger and Belkin stylus.", "The battery life it good, the reading experience is awesome, the movies and video are fantastic!", "Battery life is great as I only have to charge it once a day.", "I use mine mostly on flights and had to purchase one of their battery pack devices to keep it charged.", "The battery life is really good as I may notuse it as much as some people but I only have to recharge every fewdays as being wifi I only use it at home so far.", "My only regret is that I did not purchase a wall charger, I plan on fixing that very soon.", "I would like a way to separate the unread books from the books I am done with.This Kindle uses up battery time in a heartbeat.", "Any time I am not reading I have to be charging it.I do like the calendar, but it took me forever to figure out how to get it to work.", "The battery dies pretty quickly and takes a super long time to charge.", "However outside of that, long battery life, and easy to use.A quality and inexpensive add that is great for watching video, gaming, or just being a Kindle.", "Even if you have to spend extra on the wall charging adapter, this devise does almost everything I could ask from it.", "The iPad Mini is a much more attractive and lighter product (better battery too)", "only the cost of the kindle, a cover, and a fast charge socket were involved.", "The battery life is amazing and the kindle reader app is the seller for me.", "Battery life is good.", "The battery seems to last a long time.", "Oh, I miss the little green light about your battery.", "Also, can use any charger that has a USB port.", "the picture is crisp and it is as fast as ever.....I have a Saddleback leather sleeve that has protected it from all of my drops.The battery life is fantastic and lasts a long time....I have an IPAD and do not use it ....I use this and love it!", "Bought this for the Wife she likes Facebook and playing slots on the computer this works for her its light and has great battery life although it does not come with  a charger but we had several that would fit it.", "Battery life seems good.", "The advertisements and recommendations are really no big deal and the charging having no led light is really not needed since you can see your battery charging symbol on the top of the menu screen.", "The usb port links the device to pc and charger but nothing else, like wireless devices and flash drives.", "The battery does not last as long as advertised.", "I did find it necessary to purchase the quick charge adapter and I was a little disappointed at the cost (19.99) but I am glad I purchased it because I use my Kindle Fire so much.", "I have never experienced a charging problem with my Fire which I had read several other customers complained about.", "Only problem is the battery life is bad.", "I set it to use less power as suggested but doesn't seem to help.", "The battery life is superb.", "The battery life is really good.", "The battery lasted through the movie and several episodes of a tv show.", "However, I'm disappointed in the battery life.", "Battery life is impressive but drains faster on some games though!", "The battery lasts me all day long.", "At nite I charge it and use the alarm clockApp.", "Even during a recent storm, I was without power for three days, and my Fire chugged right along with only an ocassional charge from my vehicles battery.", "I gave this to my grandson for his birthday, along with a charger/glass protector/ and standing case.", "It's slightly heaver then a paperback, but with the proper cover is easy to close, turn the unit off and not worry about the battery.", "The battery is not as superior as ipad, and the quality of Wifi unfortunately is not as great as Ipad as well.", "Good tablet, super fast; it is however lacking in several waysPROS---Extremely Fast--Easy to use UI--Great battery--Screen qualitysCONS---Very Heavy--Limited number of apps--Outdated UI--Annoying charging port placement--Lack of included wall adapter--Stuck in Amazon store foreverI love this tablet, but it just cannot stand up to its competitors like the Nexus 7, in terms of design and OS.", "You have to purchase the charger separately.", "I love it....I will recommend you go ahead, spend the $$$ and get a power plug for it.", "The one I already had on hand for charging some other items was not heavy duty enough for the Kindle and almost caught fire.Other than that small issue....I've enjoyed two books, listened to music, watched movies, played on facebook and twitter without any other problems.", "But that stupid power button hardly even has a groove on it.", "I advise paying the litttle extra to get the 'no adds or spam&#34; version and the accelerated charger.", "The physical problem are the power button being flush with the frame and getting used to the keyboard, which is much larger than a cell phone, for someone that has only used a standard size keyboard and no keyboard cell phone.", "Very easy to hold with one hand.It is easy to get and consume content (of course, since this IS what amazon designed it for).Great battery life, great wifi reception/speeds, ease of use and setup.Cons:Side bezels are too wide in portrait mode, makes typing a little awkward.Silk browser is relatively slow compared to other mobile browsers.", "Power users who want a great 7 inch tablet would be wise to get a Google nexus 7.", "Power and HDMI plug location - I would prefer it on the short side.", "It's a big plus the way the way opening and closing the cover turns the unit off and on automatically - again, power key and volume keys are needlessly difficult to find and use.Finally, does not sync well with my Ford Sync system via Bluetooth.", "Battery life about the same as Fire.", "I suggest getting the fast charge power adapted.", "The battery time is great, but I read and use the tablet so much that it runs out of juice.I highly recommend this tablet.", "And when I unsubscribed from them for the $15 charge, I still found ads on the bottom of the carousel that I was informed I was not able to remove (they are ads disguised as Recommendations Features); the touch screen is very erratic and unresponsive; and the interface has become very clunky and way too 'busy'.As much as I am a fan of Amazon and love the products, I can't help but think this is a big step backwards for them."],
        ["battery", "charger", "charge", "power", "charging", "charge adapter", "power plug"]
    ],
    [
        ["The Kindle Fire delivered all that at a low cost, now with the Kindle Fire HD it's still affordable, but much faster, sounds much better and looks much sharper.", "I love that the HD has Bluetooth, I paired it to some speakers I have and also a headset.As far as keeping it safe for my young daughter, I have it set up where she logs into her own account and can only access the stuff in her library or other kid friendly items.", "The speakers sound is OK,they do place loud to hear music ,or movies.You don't need portable speakers.But it will sound better,if you do use some.", "Its very loud, I didnt expect for it to have such great sound.", "This is one beautiful piece of audio/video electronic equipment.", "The video definition and sound quality are outstanding.", "I Purchased my first Kindle fire HD two weeks ago, I already owned tablets but not the iguys,and i wanted a tablet to do my emailing,surfing the web, and listening to music,my budget was very small so my choices were very limited, i was seriouly considered getting the  google nexus,but then i started reading the features on both products and saw that the kindle fire hd  had dual audio output to google's mono, It was the decider.", "I can honestly tell you this is the best audio on a device i have every heard,i like listening with an inexpensive pair of headphones and amp the volume a little and i'm totally immersed,it is that good i sometimes lose tasks i should be doing.", "The vaunted audio improvements are not just marketing hype; it was amazing the first time hearing \"surround sound\" coming from a 7-inch tablet.", "the sound is awesome as is the display.", "The sound is great compared to original.. Screen really isnt that different..", "Called amazon to get a third replacement, got it and charged it she started using it and the volume on this one randomly goes up on it's own and makes a annoying sound, she will try to turn the volume down but it turns itself back up.", "Love my Kindle Fire HD!PS: The speakers??", "Sounds like a win win.", "I just love the sound system.", "Good rendering of movies and good audio.", "While I was very disappointed by the flimsy last generation Kindles and skipped the original Fire the HD is a winner.PROS* Nothing flimsy about it very solid unit* easy to use with one hand* Reliable, I've carried this every day in a pocket without a single glitch* Sound is phoenomenal for a device this size - sounds significantly better than the new IPad for a quarter the price* Image quality is amazing, can watch a few movies* Works well with the Amazon cloud services* Works well with Caliber to handle older MOBI, PDF and Text booksCons* I've spent more in content than this device cost since I got it.", "I was looking for more of a google tablet which is why mine is going back.Pros- awesome speakers- light- great screen- easy to use menu options- easy use of amazon contentcons- stunted google support (only shows primary calendar of connected google account for example)- amazon walled app store- app bought in google play has to be purchased again- too simplistic interface for me...not customizable.Overall great tablet for a consumer who wants a no fuss tablet and loves amazon content....just wasnt for me.", "Wow, those speakers were awesome.", "Great for listening to music, reading books and magazines.", "It's kind of fun listening to music as I shop; people haven't the foggiest idea of where the music is coming from.The only negative is that the leading and width settings are not as flexible as the older one had.", "I usually ask for permission to record a speaker but at time when I know that for no good reason they will not permit recording...well, let's just say it records nicely while in my purse.Being able to listen to a book that one is reading just enhances the overall value of the KFHD.", "The HD picture is very, very nice, and have also watched a couple of movies, they are quite smooth, great picture, w/pretty decent audio, although on \"Act of Valor\", I did hook the speakers up to an Altec-Lansing IMT-MIX 810 (also purchased from Amazon Prime), these speakers sound better than my Bose system, but on the Kindle it was simply outstanding.", "This is my first tablet ever, I bought it mainly as a color e-reader, for light browsing and listening to music.", "Great for reading, web-browsing, music-listening and game-playing.", "Sound is fantastic!!", "and I would definitely recommend this to anyone who loves to read, listen to music, play games, watch movies and surf the web.Great product!", "It is very portable, nice graphics and sound.", "The display is stunning, and the sound is awesome!", "I didn&#8217;t expect the sound quality to be as good as it was, and it actually surprised me.", "I love reading books on it and I love that you can take special music with you ... that you have downloaded from Amazon MP3.", "The quality of the HD is wonderful and the sound coming from the stereo speakers if fine.", "I bought the Fire HD 32 MB as an adjunct to my Droid SmartPhone, to add several capabilities:1)  Easily view web content such as FaceBook, etc..2)  View pdf diagrams,3)  Listen to my music,4)  Store and read books while traveling.5)  Secure internet transactions.I was surprised to find that listening to music actually was better via the Fire HD, the Dolby sound really enhanced my music, a great deal of which is theater pipe organ.", "Fantastic bass with crystal clear rendition throughout the audio range.", "The best for traveling, and sounds are very good from the speakers.", "The sound is great as well.", "I have used it while playing music a couple of times to view chord charts, but that's about it.", "Unlike the original fire, which had two speakers on one side, the HD has a true sense of stereo.", "In addition, the built-in speakers easily reach volumes which can be heard over highway road noise; you will not need to strain or hold it in your lap to hear an audio book on your way to work.", "It does have a lot more glare, but if you are not playing with audio/video then the savings, slightly smaller size, and lack of advertisements would make up for any other deficiencies.", "I love the idea of two speakers.", "I use it primarily for a quick check of my e-mail and some magazines and browsing the internet.Great screen resolution - good sound for a tablet size pc - and if you can do a 'screen swipe' it is easy to use!The Kindle was an ideal purchase for us - and I think as long as one realizes that is it not an Apple IPAD and expect to have the software (aka games) that the IPAD has they will be okay.", "the sound is better quality.5.", "I like the voice better that narrates the book, it's not quite as mechanical as on my Kindle Keyboard.", "Great sound and picture, and I have not had any problems with it.", "I purchased for my mother for books, written and audio but in addition it streams &#34;prime&#34; shows as well.", "The speakers on it are also much louder than I expected, and very clear.", "This review is from: Kindle Fire HD 7\", Dolby Audio, Dual-Band Wi-Fi, 16 GB - Includes Special Offers (Electronics)I have purchased one of these for my parents and they seem to like it.", "The sound is amazing...it blows my iPad away.The only annoyance I have is that my family owns five Kindles, yet we only get ONE prime free rental per month.", "I have another Kindle I bought 2 years ago and all the books and music were already loaded to this one when I turned it on.", "The speaker sound is great though I suspect I will be using headphones to listen to videos or music.The only \"dings\" I would give the device is that it doesn't have a SD/microSD card slot, the location of the microUSB connection - it's in the middle of the long side of device not at the bottom or top, no charger, though I knew it didn't come with one and I understand why it doesn't, and the location fo the power button, for some reason I have trouble finding it.", "If you're submerged in the Amazon ecosystem, music; videos; apps and books, then it's a good buy.", "The audio, as you've read everywhere else, is amazing, relative to all other portable devices of this nature.", "Truly impressed with the device and the battery life, the sound quality.", "Update i forgot one of the most important things on my Kindle fire !The Dolby sound OMG these speakers sound like their 4 times as big you will not believe the sound .", "when i saw the add i thought wow they might have finally made a small set of speakers that really do sound good .", "I love the dolby that comes with it, the first time I used it I could not believe it had such great sound that It sounded like I had speakers every where in the room while I was watching a movie.", "When I went anywhere I would load up the  CD book, player and headset which was quite cumbersome.", "I have now had my eyes fixed so can read the book and not need the headset.!", "Even the Dolby speakers are great.", "You can download books, music, and movies onto it.", "Oh, and by the way, the speakers and sound on this one are really great!!", "I wish it was loulder, I don't want to have to use headphones all the time.", "I was not planing on buying  another kindle fire or another tablet (I have 3 and now with this one ,4) This one (the baby sibling to last years 8.9 )  is the best,imo.It is small and sleek and sharp and the sound is stupendous.", "I'll keep this simple, for a $200 tablet, it's probably the best deal out there, sound and picture are great, quality and durability seem second to none, only negative is that the apps are slightly limited, since you pretty much stuck with Amazon App store.", "The Dolby speakers surprised me.", "I can be holding it in my hand watching it, but the sound seems to fill the room.", "I have it with me constantly.One of my favorite features on this new Kindle Fire HD is the new Whispersync for Voice which literally combines the e-book with the audio book so you can simultaneously use both of them at your convenience and have your progress consistent across all your devices.", "What I am most impressed with is the sound.", "No longer will headphones be the first choice.", "The new speakers make a huge difference for moving watching.", "For tiny speakers they sure do sound great, and are loud enough for everything I have needed so far.", "The Music musics!", "Small screen but sharp and bright, so movies look and sound great, even for two.", "With the external speakers the sound quality is excelent.", "At first, I wasn't that impressed with reading on the Fire HD, but after some adjusting, I have it dialed in pretty well for my tastes.Some likes:- Versatility (comparing to e-books)- Full color for newsstand items (makes mag subscriptions a worth-while proposition)- Great sound from a small package- Great videoReally the only knock I have (and it isn't a deal-breaker) is the carousel.", "I was a little disappointed in how to transfer files and music from my computer.", "AND I listen to music.", "Music,movies,games,youtube, tons of free apps.", "When I entertain, I hook it up to my home stereo system, and all my favorite playlistsPlay automatically, like a dj.", "Kindle Fire HD is the perfect tablet for my books, music, pictures, games and so much more.", "I do want to look into listening to music on the Kindle since I understand the speakers are of good quality, although I can't confirm that just yet.", "She even found a birding book with sounds and everything (she is into that stuff).", "After some initial getting used to it, I find it is a wonderful all-in-one for Documents, Videos, Pictures, Audio Books, E-Books and E-Zines.", "The sound is very good for a tablet.", "It did take a bit of doing to be able to listen to the movie audio through my stereo and connect the video to my TV using a mini hdmi thingie, but now it works great.I don't use it much for reading books.", "I haven't used the camera feature much, nor the music.", "You get music in Dolby sound with dual speakers, books, magazines, videos, games, email, Facebook and other apps that you want to add.", "The downloading of games is fast and just the clarity of the sound and screen alone amazes me.", "He wanted to upgrade to better sound, and at the special deal we got, he moved up to the larger one and loves it.", "The one thing that beats the Nook all hollow is the speaker quality.", "You don't need earphones to hear your Kindle.", "Sound much better than Fire.", "I bought this device and love it at well..has great sound and picture quality.", "The sound is a 200% improvement, though I got along fine with an external speaker or headphones on the original.", "Amazon is wonderful and so is my Kindel Fire HD.It has a very clear screen, wicked sound, and is addicting.", "The picture is awesome and the sound is great..", "so many free apps ( but read the reviews before you install them), i bought a micro hdmi to hdmi cable that lets me hook it up to my 47&#34; 3d tv , and that looks great & sounds great.", "I can actually see myself doing real work on a kindle that I can easily transfer back & forth to my desktop.For music/apps the ipad fits in to the established habitual iPod/iTunes ecosystem & sync's up with their music library easily, but I can't stand iTunes or the iTunes store.The kindle too was a snap for me (a windows guy) to just copy over the iTunes music library to the kindle music folder, although just copying files old school like this intimidates some people these days."],
        ["sound", "music", "speaker", "audio", "headphone", "sound quality", "voice", "stereo system", "earphone"]
    ],
    [
        ["Everything is fine except one of the games I noticed didn't hold anything.", "he is only 7 yrs old with some issues and it broke my heart that this game wasn't saved for him.", "I am now on my second kindle and am still having major problems with the app store and the silk mechanism on this device.", "I have been advised that a new update will be coming out for the app store but it still is not available.", "Kindle does not show apps that are ordered, apps disappear after download, and half of the time the silk app does not respond.", "She has only tried a few apps so far to include angry birds and wordfeud and they both work perfectly much better than on her phone.", "Can't use Google Play store, you have to use Amazon.", "The Kindle does not have access to the Google Play Store out of the box and the Amazon App Market does not have all the apps my wife wants (or for that matter has payed for to use on android).", "There are other cool apps that can be used but the purpose for which it was bought is being served well.Just one thing Amazon can do though.", "I will probably use this one to play games while my granddaughter is watching Netflx on my Kindle Fire.", "Difficult (though not impossible) to install apps from Google or other sources except the Amazon store.", "Works pretty well for a 7&#34; Tablet, although I do wish that someone had made some sort of deal with Adobe to continue flash player support for Android.", "There are some things I would like to stream to my Tablet, that won't play without flash player.", "I love their fast shipping and their awesome customer service...but I couldn't love this tablet no matter how hard I tried.The main thing that killed it for me is the absence of the Google Playstore.", "Essential apps like Youtube are missing in the Amazon App store.A lesser complaint was the layout of the user interface.", "Furthermore, I now have BOTH Amazon Appstore and Google Playstore.", "My daughter loves watching Netflix and playing her videos and other apps I downloaded.", "My ONLY con to this item is that it does NOT support Google Play.", "If kindle stocked every app that google play does it would not be a problem but there are A LOT of apps i want to run that  i play on my phone that i can not get from the kindle store.", "There are a couple of apps I wish it had, but the market is still building and hopefully they add them soon.", "Easy to carry in my purse and with awesome clarity and definition.Update on 7/23/13....only downside is it doesn't have Google Play.", "Its easy to download content, watch it, check email, facebook and use apps.", "You can find plenty of free apps at Amazon.com.", "Or if you did that mostwall warts do not have the output to properly charge it.When reading one has to be careful about the touch screen because you can turn pages unintentionally veryeasily.The amazon apps that are available at this point is limited compared to Google's play store.", "For example my local news station has an app that can notbe found anywhere other than at the play store.Seeing that this is a new product, and knowing amazons history of paying attention to users complaints.I am sure that the shortcomings of this tablet will be addressed in future firmware updates as they havedone so with their other kindles, excluding the kindle dx.", "For those who say you can't use the kindle fire HD for business, just hasn't found the right apps.", "I took one star away for a few reasons: No voice recognition capability, can't use apps requiring Java (like VPN), pesky adds (even after I paid the extra money to not have this feature), clunky at times.", "I'm still exploring all this Kindle has to offer, but am absolutely enjoying what I've found so far (books, games, videos, Pinterest).", "It's the only Android device that allows you to get the most out of Amazon Prime.As far as not having the Google Play store, it doesn't bother me at all.", "The more important factor is that Android doesn't have a great library of apps available for tablets anyway.", "So far in the two months I've had this, I can say it's easy to use, with plenty of apps.", "The Kindle Free Time app is also fantastic!", "via parental controls, as well as limiting times and types of games/videos that can be used.", "The advantages of the Samsung is that is has GPS, an operating system that allows both the Amazon App Store and Google Play and what is just great is the ability to use it as an IR remote control for your tv.", "The only real advantages that I can see for the Kindle Fire HD is if you are very invested into prime and use instant videos and rent a free book from the Kindle store.", "This has plenty of memory and a great picture for games movies books anything.", "The only cons is the smudges it gets on the screen and the lack of apps in the Android store.", "I would say a good 50 percent of the apps I had on my Nexus are not available via amazon.", "Internet, reading, games,etc.", "I have the Kindle 3rd generation and was happy with that...NOW I am able to read full color HD picture books with my 2 young boys, download games for myself and for the 4 year old!", "When you&#8217;re reading a book, playing a game, watching a movie, etc., you don&#8217;t even see them.", "This is not just a reader, but I can access the internet, compose documents and create presentations, I can watch movies or current tv episodes with the available apps and an Hd cord, I can get organized with the calendar,  I can take pictures, I can check my email and also go shopping for anything I need.", "super easy to get content - books, apps, everything.", "I dont know if I loaded a bad app but I hope this doesnt happen often.", "While the hardware is decent, there are a few things that I don't like which made me choose the Nexus 7 over this.1) Lack of Google Play Apps.", "Youtube, Chrome browser, Google Now, Google Maps, Gmail, Google Earth are all must have for any tablet owner.", "Amazon's app store does not have these and it by itself is a deal breaker.", "From games to reading she just loves it.", "As a curiosity there are games like Super KO boxing that works on the first edition of the kindle fire 7\" but not in the kindle fire 9\".", "I had held off on purchasing a kindle as I've had the app on my phone for years and didn't see the need for an actual kindle as the phone app worked perfectly for my needs.Then I started contemplating an ipad.", "In my research for an ipad vs. other tablets, I read through many of the other reviews for the kindle fire hd and decided for my needs it was perfect.", "The suggestions are a good idea, they show you some apps you might not have found otherwise.", "When I have handed her my android tablets previously I have found it way too easy for her to download games that cost me money, Freetime eliminates that risk completely.", "I bought it mainly for games & accessing the internet.", "The are lots of apps, games & books available ( along with loads of free ones) , for it so I'm sure I will enjoy it for a long time !", "So many articles brag that the Apple App Store is second-to-none, and maybe that's so to folks who need an app to wipe their noses for them.", "There's an app to help you out, but when you're in an app and can't figure out how to get out of it, that help app isn't much good.", "It is very easy to flip pages and view the article in text mode.I also downloaded some apps via the Kindle app store.", "I have over 40 apps loaded on it and use it every day.", "Amazon has somehow limited the operating system to only be able to use certain android apps.", "It was so nice to be able to check my favorite web sites and apps while on vacation, I found I greatly preferred it to the Netbook.I don't really care for the Carousel, but the lack of the Google Play store is not an issue for me.", "I wanted to be able to read books, play games (Sudoku, etc) and sometimes surf the web on the go, and this does it all in a nice-sized package.", "I've put several apps on it (games, calendar) and have had no problems running them.", "My only complaint so far is you can't easily put a Digital Copy movie on it, and there is no vudu app, to-date.", "It can run graphic-intensive games just as well as basic puzzle games.", "Easy to read, play games, etc.", "It is small, fast and great for my three year old to watch shows and play games on.", "It's easy for me to navigate on the web, and never freezes or gives me problems that way.I do have a few complaints about it, one being that the shopping for apps isn't the same as a normal droid tablet, so you can't get certain games on it (like candy crush), which I think is super lame.", "I love my new Kindle HD more than I could have ever imagined, I initially got it for books and had planned on using it for a few games here and there but I found it is so much more than that.", "Amazon app store is very limited.", "Fortunately you can side load many apps.", "The calendar works file.I found out you can't use google apps unless you root the kindle and do a lot of downloading apps from google store and then side loading the app.", "You have to find a porgram that will allow you to download app from google store to your computer.", "Now I know why they all just read, play word games and check their email.", "I am a little disappointing with the app selection in the app store.", "Couple of things I wish, like being able to access Playstore for android.", "Also not being being able to have flashplayer.", "My eleven-month-old grandson was enamored with the apps and videos of Mickey Mouse.", "Holy cow, he was into to it from the start.The variety of games for a toddler is enormous.", "But its great for reading books and playing games.", "You do not have access to the entire google play store.", "I don't use much apps on this device but i use it to buy amazon product thru my amazon prime.", "The ease of use with accessing the store, books, apps, etc.. is just flawless.", "The apps are good,too.The only thing that bothers me about this is that sometimes it drops the wi-fi connection temporarily...but just long enough to interrupt what I'm doing.", "The Amazon app store is smaller than Apple and Android but I have not really ran into an app that I had to have that is not avaliable.", "All the big name apps, Skype, Facebook, Netflix, Espn etc are available and work great!", "**EDIT**I found several apps for free that allow me to print to network printers on my home network!", "I love being able to play puzzle games on it too!", "I have opportunity to look a many free apps and begin to assess which ones I can rely on and which ones do not live up to their promise.", "I love my games, email, facebook, everything it can hold and do, but WHY NOT IM TO CHAT ON?????", "My kids enjoy the games and apps.", "One of my favorite apps is IMDB.", "Also, great for checking gamescores using ScoreMobile, a free app from Amazon.6  Device is thinner & easier to carry along than a book.", "Her book reading wasn't affected, but the games she loves to play seemed to bring on the heat.I called Kindle support, and the response was wonderful.", "Love everything about the Kindle there is plenty to buy but if you don't want to -the amount of free games books and just about everything else will last you a life time!", "it is meant for skyping and taking photos of yourself (or with others)I hardly used this when I had an Ipod, but I began downloading books,got amazon prime and now I dont even use my laptop, let alone the Ipod.Im sad to see some apps go.", "Ipads you need the Ibooks app and Netflix app.", "Kindle Fire makes it all easier to access and you dont need a million different apps for it.", "Works great for books and games, otherwise I don't find a use for it.", "I really love the Kindle, and the freetime app that I put on for my kids.", "I like my Kindle fire, it was a little smaller than I expected, but a decent size with lots of functions when you start adding apps and learning the system.", "It works well with my sons Free Time app so he can use it as well if needed...even though we no have our own kindles.", "There appears to be ample CPU power to run the various apps and games with no lag or degradation in performance.The real annoyance is the ease with which someone can reset the device.", "He loved it, we do play games on it with each other such as board games!", "It has the few apps I wanted and the browser works just fine.", "I would have liked it to have flash player but apparently it may be possible to install it, I haven't tried yet.", "There is also a lot of free games to download, which makes plane rides easier.", "A ton of apps.", "A few games and other apps.", "Downloading apps and keeping track of what's in your personal cloud is super easy.", "Downloaded some free movies and games with Amazon Prime.", "It plays, music, goes anywhere on the WEB, has books, you can download just about any app you like to play games.", "It is also great, because you have games, videos, music, and other apps at your disposal.", "Email app has been improved.", "Love the calendar and contacts app.", "ES File Explorer is another must have app.", "My only wish is for full native access to my Google account instead of having to use Amazon apps.", "Its the one which most of the apps that say it do work on, and if they don't a real live person at Amazon will help you fix it.", "Kind of hard to put down at times, with with the books to read, audiobooks to listen to, games to play, the ability to &#34;surf the web&#34;, and the massive selection of apps (a lot of which are free).", "I would've been happier if it would allow flash to install.", "Fully capable this tablet runs all apps, including anything off the Google app store, at a fast rate without any lag.", "Lots of apps.", "Emails, netfix, weather, TV shows, games, and banking apps lets the world follow me on my trips.", "I have purchased a few games and they play flawlessly.", "I bought this tablet without knowing a darn thing about tablets, apps, etc.", "I was able to view every game my small FBS alma mater played.", "She couldn't wait to get home to get it set up (we were at the lake when she got it and unable to get wifi) and start using the various apps and books she had saved to get.", "I read books, play games, read e-mail, check up on my Facebook page, watch tv and movies, and now I can use Skpe without being tied to my pc.", "There are a lot of apps for it and I have found that all of those which I have tried work well.", "I suppose it's a good thing it doesn't support Flash games or I'd be playing Farmville and such all the time on it.", "Apps have not been a problem and he has found all that he wants on the Amazon store.", "Apps is still one of the downsides from this product, but all in all if you want sub $200 product instead of $ 300 to $500 product than this is the one to go.", "Give it the Google Play store and a lighter design and I would love it", "They are perfect size and our 6 year old loves to play her games on it.", "All features I enjoy, the HD is better than with my 3rd Generation Kindle Fire, and so far it seems to work well with the apps I have on it.", "My oldest boy he loves it, the kindle its great for homework, games, reading, web, videos, etc.", "I use this tablet a lot for reading, checking emails, FB, and playing games.", "Apparently this device doesn't support flash, but I couldn't care less since flash is a dying platform and I'm used to it with my apple devices anyway.Number of apps is extremely limited when compared to full android play store and apple app store.", "However, general quality of apps is good.Overall, I am enjoying this device.", "The kids can read books, play games, and watch movies!", "Great connectivity on WIFI at multiple locations and Apps galore.", "Make sure you go to the App Store every day to check out the free App of the day, sometimes a really great buy.", "the next problem is that AMAZON seems to not care about its customers when it comes to removing falsely advetised applicatons on any of the app stores.", "books so far are the only safe haven it seems.So all in all don't buy anything on the appstore unless you read enough reviews don't expect many app choices, but know that the Kindle Fire is otherwise amazing and i really like it, but not love it.", "It's very easy to use and the apps available seem endless, not to mention all the great books I can load onto it and read.", "This also means you buy your apps through Amazon not Google Play store.", "And from my experience Amazon does not offer the same amount of apps as the Play store.", "It is important to note that concerns that the Kindle devices limit you to the apps available on Amazon is a myth.", "You can undo a default feature in the settings, designed to protect the device from malicious apps, and download apps from other sources.", "There are tons of great apps for the Kindle and reading ebooks is a joy on here.", "I am still learning what it can do,  and you can certainly spend $10.00 - 50.00 a month in games or apps.", "you can enjoy this a lot every month without paying for apps.", "a few apps only open in one direction.", "The kids love the gaming apps & the Ipad is probably better for that, but for me I prefer having access to the file system which is easy on the Kindle, & near impossible on the ipad even with a file manager app."],
        ["app", "game", "app store", "play store", "google store", "google play", "kindle store", "flash game", "flash player"]
    ],
    [
        ["HD is no joke this thing has a beautiful picture, and when streaming music from the cloud sounds pretty good using its built in speakers.", "Web surfing is great too.", "Wifi is terrible ,and  since that's the only way to use it, it's an issue.", "Browser is pretty cool especially for writing reviews and perusing amazon.", "Does all the things you can do on the web well too.", "Highly recommend this to anyone looking for a good book reader and something to surf the internet as well.", "The video streaming capabilities is excellent.", "This is a great Wi-Fi device.You will need a Wi-Fi connection.", "The Internet does load up very fast I must say.It is good for steaming movies off Amazon and Netflix.I also downloaded books,too.", "Also side-by-side, the Wi-Fi performance is improved.", "After buying a kindle fire for myself, I got one for my mom, but dad kept taking it, so even though his birthday was six months out, I surprised him with this gift and he can now play words with friends without stealing my moms book!Very easy to use, for games, books and even for searching the web!", "I use it to read books, watch movies and tv shows, surf the Web, and play games.", "I wish I could set it up like my phone, with widgetsIt's either super loud or super quiet, there's really no in-betweenSometimes it glitches and the WiFi says it's connected, but won't give me a signal.PROS:Books by the dozen!I can do my homework on here, although the typing is difficultSuper amazing pictureEasy to shop, find what I want and also look it up on Amazon to buy.If I were more into all the GB and techie stuff, I could say more.", "Now that wifi is so readily available I didn't feel like I needed something with 3G capability (I have an iPhone for stuff like that) and wasn't ready to shell out big bucks for something like an iPad.", "It has an actual web browser, handles games and apps extremely well, and is just fantastic for reading books.", "There are a few things I would change about it that others have mentioned.", "Yes I've used other Kindles in the past for reading, but now with my Fire HD I can read, play games, get on facebook, listen to pandora, shoot off emails, and a million other things!", "She uses it to read naturally and to surf the web.", "Watching movies, reading, browsing the web, email all works well on this.I also looked at the Nexus 7.", "WiFi really does seem faster than other tablets, as Amazon claims.", "After several unbiased websites said it was greatly improved, I decided to try again and I'm glad I did.I do wish I could find out how to stop reading a book in the middle and return to the main page without going to the end of the book and exiting thru the kindle review page.", "Upon delivery, I set it up for our Wifi and downloaded the apps she wanted.", "I will recommend these to my friends.Kindle Fire HD 7\", Dolby Audio, Dual-Band Wi-Fi, 16 GB", "The Wifi setup was easy on the first try, even with our security settings.", "Fast web browser.", "Easy to get books, check email, watch movies, play games, etc.", "It also did a great job of detecting and connecting to wifi.My Kindle kept me sane during the hurricane!", "I use it as an E-Reader, for email and movies.", "The color while watching my Amazon Prime Streaming movies is just AWESOME!!!!!", "I would kind of like to have the Wi-Fi at all times, but for me I just couldn't afford the expense of it.", "But then again, the webpage does say, &#8220;Battery life will vary based on device settings, usage, and other factors such as web browsing and downloading content.", "Wi-Fi range is fantastic&#8230;picks up Wi-Fi when my laptop will not!", "I had to keep turning the wifi connection on & off for it too load any anything.", "The keyboard in the first kindle also let to hide the keyboard with a special key,key that is not present inthe HD's versions.I thought that the software in the kindle fire Hd were going to be improved notto make somethings worse or to lose capabilities of previous versions.Anyway those characteristics can be improved with a software update.Would be a release of an update for the amazon silk browser that adds flash to it?", "E-Mail, Weather, Movies from Amazon, Netflix, Hulu and more!", "Web browsing is less painful with the upgraded keyboad and vertical, side-mounted nav bar which gives you more vertical space for each page.", "I would like to see the ability to turn off the display while streaming over hdmi so there is not the distraction of the video playing over the tablet as well as the television, but all in all this is a great device.", "The text of web pages is so small it is difficult or unpleasant to read.", "I didn't like hunting for passwords to WiFi.", "Also I miss the early Kindle access to the web when WiFi is not available.", "\"The Nation\" is so far my favorite.", "I'm able to read my e-mail, read e-books and surf the net.", "She absolutely loves using the Kindle for its ease of use for Facebook and -email, as well as for the videos she watches.", "), I could not get the wi-fi to work.", "Seems a little dependet on Wi-Fi.", "The item also seems to want to keep your login information saved as well as your Internet history no matter what settings you change.I got this as a gift for two dict year olds.", "By default the Kin connects to a strong unsecured WiFi network, that would be my guest network.", "Make sure to switch to a locked/encrypted WiFi network soon after getting started.", "I bought the kindle fire hd because it was on sale and I wanted something I could use to browse the web and read articles.", "The browser is a bit slow and doesn't work too well when trying to zoom.", "Streaming videos and music is simple.", "I can review and respond to all of my emails from my Kindle.I was able to load a different browser making surfing the web more pleasurable.A plus.", "We have an iPad II as well, so I'm comparing the Kindle fire to the industry standard.Couple early observations:-The WiFi on the Kindle is faster.", "Using it every day for web browsing, social media, streaming movies/tv shows and some reading.", "i use it mostly for web surfing and reading web articles and youtube.", "Finding that easiest to select/queue books on PC, them stream to the Kindle.", "I love that i can read books, search the web and play games and watch movies/ tv shows on this.", "It's very fast and responsive when browsing through apps, it looks very sharp, the colors and contrast are real clear and vivid.", "I am able to access the web when I need to without having to drag my laptop around all over if I just need to get quick access.", "I have an iPad for web browsing but I found the kindle to be faster.", "It streams music and movies beautifully.", "It's great for surfing the internet (web pages, videos, etc.)", "and, using an HDMI connector, can be used to watch streaming Amazon Prime videos on an HDTV (make sure you get the correct micro HDMI connector to fit in the Kindle).", "Something portable to browse the internet, check email, stream videos.", "As a reader, a simple game machine, and occasional simple web-browsing device it works fine.Our one complaint is the e-mail capability.", "E-mail is tedious, particularly trying to down load new e-mail.", "Even with the best of wi-fi connections, the Kindle will sometimes sit and churn for long periods of time without displaying any e-mail at all.", "Since one of the reasons we picked this model was to have e-mail access while traveling, this is a major disappointment.", "For anyone just looking for a device to search the web, play games, watch movies, and emailing the Kindle will take good care of you.", "I also wish the cloud could hold my Wi Fi connection and not have to connect to a diff one.", "The other day I could not connect at Dr Office because they dont have an open wi fi for the time we SIT in the waiting room...", "I have a couple of computers so I really didn't care about what anyone had to say about the web platform.", "Books and apps take no time to download, and the streaming for PRIME  videos is simply awesome.", "I recommend getting amazon prime with it too, just easier to buy stuff and you get to borrow books for free and stream amazon movies, well worth it for the annual fee.", "I can watch Amazon Prime movies on it, game, surf the web, etc.", "She was able to connect to the WIFI in my house easily and has downloaded a bunch of her music library to the unit.", "I use it primarily as a reader but also like the calendar function and the wi-fi capability.", "Try taking a photo with the facebook app or saving a photo from web.", "like maxthon browser.", "It was  a better browser, easier for viewing photos and saving them.....but thats nitpicking.", "I am an avid reader as well as extensive internet user.", "The sound is just better and it streams better.", "The WIFI works great but doesn't make me portable.", "Therefore, I am disappointed that I paid over $300.00 and can't access the Internet, E-mail, etc.", "without WIFI.", "It actually makes you want to spend time using it.In the past I have used a tablet for web browsing and light email.", "I can now stream movies on any TV in the house - much more comfortable than using my laptop!", "I have had no experience with any product that used the Wi-Fi technology.", "I was on vacation and my cell would not work, but with a neighbors wifi, a long ways away, I was able to use this tablet for everything.", "I track work emails.", "I was looking for something to buy my daughter who uses her iPhone for email, games and internet.", "There hasn't been a day since I received my Fire HD that I haven't used it for e-mail, web surfing, or it's intended purpose.....reading.", "The speed is phenominal, and with dual band wi-fi, I never lose a signal.", "Great product, when watching movies over Wi-FI.. great buffering system, great antenna/reception, quick delivery, great reading device.", "The Wi-Fi works without any problems with wide range.", "I already had the Kindle, Wi-Fi, 6 &#34; E Ink Display (black and white) but the Kindle Fire HD is really, really worth the extra money.", "I just returned from a 2 week vacation in the U.S. and whether in a plane, or hotel, the HD provided me with access to WiFi and well as my reading library.", "Another problem has been connecting to my house Wi-Fi.", "I read with it and also browse the internet."],
        ["streaming", "wifi", "web", "email", "internet", "web browsing", "browser", "web browser", "browse", "web browse", "browsing", "webpage"]
    ],
    [
        ["They should include the power adapter cause charging with the usb cable takes too long.", "First one usb port was loose in order to charge it you had to prop up connector with something, if you hold it it in it would charge fine as soon as you let the connector go it would stop.", "We exchanged it with Amazon and the wife received the replacement it charged ok no usb problems.", "My new Kindle Fire HD 7\" wouldn't appear on my desktop computer(using Windows 7)when connected via USB.", "I purchased a Microsoft Bluetooth keyboard and the OfficeSuite Professial 6 software.", "Being able to use my Bluetooth keyboard makes handling email a snapAlthough I have a large tablet by another company, it is too big to lug around, bu tit fits nicely in my purse.", "I have really enjoyed taking it with me on business trips and using it to stream movies onto hotel TVs using a HDMI cable (not included).", "I havnt tried it yet but it also has a mini hdmi to hook up to your hdtv.", "I wish it had a usb slot to show my pictures I have taken.", "With dual antenna, I get very fast internet connection in my house and other places.", "I have no problem with wireless and it is fast with no technical problems.", "Working in the wireless industry I am no stranger to electronics.", "Now if Amazon could only find it in their collective hearts to include a charger and USB cable with the device...", "The nexus 7 doesn't have a micro-hdmi, and while there are ways around that this was just better for what I need.", "Also a little disappointed that it didn't come with a USB charger wall unit.", "Only a USB cord.", "The bluetooth works on speaker systems, headphones (not the microphone), keyboards, but not the mouse (Logitech android mouse).", "Got the hdmi cable and the picture looks great on a 47 inch lg tv.", "This one was my buddy for a year till I broke the USB connection keeping the charger in on my stomach in bed.", "i was happy at first because i could hook up HDMI to my TV, but after several app crashes and reboots, i feel like i am testing an unfinished product.", "Since there are a million reviews, I will be brief.I love how easy it is to hook it up with a micro HDMI cable to my TV in order to watch Prime videos.", "With an optional HDMI-miniHdmi cable - movies look great on my big-screen TV.Taking half a star for:1.", "It does work but it's very hard to setup and get reconnected again via Bluetooth.", "I was able to download a highly rated Office-type app not available on the Amazon app store, which works with my Bluetooth keyboard."],
        ["bluetooth", "usb", "wireless", "hdmi cable", "usb cable", "port", "connector port", "dual antenna", "hdmi", "mini hdmi"]
    ],
    [
        ["But the &#34;new Kindle Fire HD 7'' has no cam..", "I read the specs and the new Kindle Fire HDX has improved features but why downgrade the new Kindle Fire HD to a Kindle Fire... so you can justify the higher cost for Kindle Fire HDX 7'' ?Anyway I say I would have given my now older Kindle Fire HD a 5/5 but since the new Kindle Fire HD (without a cam) came out I  give  it maybe a 3 or 4 star.", "I have 6 registered Kindle Fire HD (with front cam) and now they are older generation... i will have to wait and see next few weeks / months if i will  have problems now that the newer version of Kindle Fire HD (without cam) is out soon.", "------- my needs are really basic.My phone actually IS less-smart than I am; I am NOT on Facebook; My camera has, actual, 35mm FILM in it; NO-body thatIvote for EVER gets elected; I can't figure out Yoo-Tube; and, a teenager had to post THAT photo you just looked at.THAT said, my wife ----- who is MUCH younger than I am ----- has aKindle Fire HD 7\", Dolby Audio, Dual-Band Wi-Fi, 16 GB.She seems to enjoy IT in bed, more than me.", "I already have the Kindle Fire, but this one has the camera.", "But unfortunately it is odd that you can not see what you are taking a picture of because of the front facing camera.", "If only it had a better or different type of camera it would be perfect.", "I was hoping for a regular camera and not just one to use with Skype.", "I keep my calender on it, it fits into my purse easily, and the only wish I might have is for a camera that you don't have to be &#34;skyping&#34; with.I need to experiment with the camera more, perhaps I just don't know enough about it.", "I loved the first Kindle Fire, but this is faster, has the camera, has HD & lots more!", "Great resolution and so far, I can't think of anything I would love except for.. dual cameras.", "I put Camera Fun Pro on it and IT CAN TAKE PICTURES.", "I wish, though, that the camera was back-facing as well as front-facing.", "I did download [...] app and have access to over 300,000 apps.If I had to do it over again, I would probably have bought a Samsung Galaxy II because it is a true android device, has a rear facing camera which kindle doesn't, has gps, which kindle doesn't, has upgradeable micro sd 32 gig expandable memory, which kindle doesn't and has access to Google Play with over 700,00 apps.Also Kindle has the cloud, but doesn't tell you that the cloud only works if you have wi-fi connected.But, all in all I like the Kindle Fire HD and it is a very good, stable, great product.", "But I can do so much more with the Kindle Fire, like listen to music, watch videos and even monitor my wireless cameras from the comfort of my bed.", "My son loves the camera and HD, so his football games on the go are just like being at home.", "The kindle doesnt have a camera where you can take front camera pictures or video chat.", "I have the first generation Kindle Fire and I was happy with it but wanted the Samsung Galaxy 7\" for the camera.", "(I really like it)  It's also nice not to have to tilt the kindle this way or that to lose a reflection.The camera/video is pretty nice too, but you will have to buy an app to use it's full function.", "There was NO app for the camera!", "Skype does work with the camera but that's it.You can't use the camera to take picture.", "No back camera it's okay, although it would be handy sometimes, but It's good enough to do what I want (web surfing and skype) and with an excellent resolution.", "I am glad to see improvements, for example a calender and camera.I'd like to tell everyone that you do not need t purchase a camera app to activate the camera icon in the Photo's tab.", "Be sure to get this one though, and not the new kindle hd (not talking about hdx) as the new version of this doesn't have most of the features this one does like the camera and hdmi port.", "The camera could be improved upon but otherwise it is great.", "I would add a front facing camera but that's the only thing I can think of adding to this Fire.", "My only disappointment is not having the camera face the back instead of the screen side......maybe two cameras, Amazon....hint, hint?", "There's two small things that i didn't like though; no charger (only USB charger) and no camera.", "i searched for this version because the newer version didnt have a camera."],
        ["camera", "cam", "webcam"]
    ],
    [
        ["Well the only reason he doesn't like Kindle is he doesn't like android, he says all the different phones and tablets have different interfaces, so I mentioned that was the whole idea behind android, what he said after that made very little sense but it was at a very high volume.I highly recommend it, it's everything Amazon says it is.The only problem I have is with the stupid usb charging, but I understand it, Amazon is trying to make a little money since they sold the Kindle at a loss.", "If there is a tab or button somewhere, it's not easily accessed.", "I have the wireless keyboard and wireless blue tooth headphones for it which greatly enhances my enjoyment of it.BUT,1- I do not like the fact that or some reason Android advertized apps do not work on Kindle.", "The software, limited as it is, works great.. One thing I love is the swipe that it has for the keyboard..Its a little wide because of the camera compared to the original but it makes up for it in thickness..  Only gripe I have is that I bought it one day and almost the next day it went on sale for 30 bucks less, makes ya feel a little cheated.. OOH and the now having to pay for no ADs ( I did )..", "It has Swype or you can buy cheap keyboards for it that work great too.", "The keyboard is another annoying aspect of the product.", "What good is a tablet without the apps you need?2) Lack of Android 4.3 OS interface.", "If you have a lot of books (I have 1000+) you cannot sort them into collections like you can on the Keyboard.", "The curve in the speakers even makes it sound very good when you set this thing on a counter.I have also come to appreciate the interface upgrades.", "Finally there is the favorites button.", "It is available wherever you have the home button, and it lets you get to your favorite items without going through the well-traveled home>carousel>hunt pathway; your preferred music app is always one tap away.The original fire is still fine for kindle books and text-only web browsing.", "The interface is quite smooth, but it is a bit different than a typical android device.", "I got it the day of release.The Kindle interface is wonderful.", "She had the kindle e-ink with buttons and just loves this in comparison.", "Haven't regretted the purchase at all.I'm not big on the interface (carousel) and the Kindle Freetime isn't quite what I expected.", "Another complaint is that the power button is really hard to locate in the dark.", "It is designed too sleek..the volume and power button are on the same side, and are designed to blend in with the kindle, so it is merely impossible to find in the dark.", "They can do the basics but they still seem to be a little bit confused by what is going on with the user interface.", "I don't really like the user interface of the kindle as the front is nothing but a side scroll of all the content you have opened and I haven't found a way to change this.", "I have eye implants after cataract removal so I, personally, own a kindle keyboard with the black ink display which is less likely to irritate and tire my eyes than backlit screens.", "It has taking awhile to get used to where the on/off button is along with the vol, which are technically on the side now and not the bottom.", "The interface, although not breathtaking, is a satisfying and minimalistic design that I have come to appreciate.", "Like on the iPad, the little ones press the home buttom or get out of the app really easy.", "The interface is not as snappy as the nexus 7 but the wireless connection speed and browsing speed in my opinion is much better!Bottom line, does what you need for home use, entertainment, browsing, games etc.", "I love this product but it needs host mode on it's usb port so it can use external usb keyboards.", "Reading the magazines B&N; has an \"Article View\" button where ALL pages in pretty much of 90% of their magazines are in plain text and big so you can read nice and clear.", "Once she learns and gets used to the touch gestures, I think there will be no stopping her.. Only fault I find is the on-off button which is flat with the rest of the tablet and feel that a slight protrusion such as the the plain Kindle Fire would be better.", "The other issue, and perhaps its just a &#34;getting used to&#34; issue is the buttons.", "Not thrilled they came out with the HDX model 2 months after, but with the exception of my keyboard being in Mardarin Chinese one AM when I turned it on, and that required 4 phones and a Complete Factory Reset.", "My only beef with it is that the power button is simply too flush.", "For one it now has volume control and I like the GMail integration which the original didn't have.I still don't like the fact that you're stuck with the onscreen keyboard and you can't change it like you can with Android tablets so you're stuck with the keyboard whether you like it or not just like the iPad.", "Love the Kindle user interface and just the layout of where things are."],
        ["interface", "button", "keyboard"]
    ],
    [
        ["Was tempted to get an iPad mini but when the fire HD went on sale the price was to good to resist.This feels better in my hands than the full sized iPad.", "I have an iPad, but I bought this Kindle because it's smaller and lighter weight.", "I find this to be a better size, value and a well rounded product.", "Love the size--it's portable but not cumbersome.", "One thing being it is kind of heavy, especially for its size.", "I personally don't worship at the Apple alter, so I don't have experience with Apple products.I also have a Toshiba Thrive tablet, which is nice, but I believe I prefer the Fire HD simply for the size.", "I like the size and weight.", "The size is perfect to carry with you.", "At first, I had hesitation that a 7 inch tablet is too small.", "It is the perfect size as I could even put it in my inside coat pocket as it is truly portable tablet.", "Other Androd tablets and smartphones allow you to increase the text size on web pages.", "I've downloaded apps to help control my diabetes, I've begun using it as a portable cookbook, a PDA, a study tool, and a million other things.", "I love the size.", "I stayed with the 7&#34;, same size as the other one, because I can so easily put it in my purse or computer bag and feel I have all my entertainment whenever I get stuck waiting somewhere.One of the main reasons I ordered this unit is because I'll be updating an ebook I put together before the Fire version of Kindle.", "The screen is beautiful and the size is compact enough to slip in my bag and go anywhere with me.", "I thought this would be smaller in over all size.", "I am so happy I bought it, it is the perfect size for reading, I love the carousel option and although people complain about the ads and the customers also bought items on the kindle, I can care less.", "I feel it is just the right size, between the smart phone, and the laptop, more portable than an IPad.", "Size is bigger.", "Also, side by side comparison with the non-HD version shows no difference, except the dimensions of the Kindle, same overall size but the HD version is wider.The apps for the Kindle are sorely lacking.", "It's just the right size.", "It's versatile, portable and easy to use.", "It is the perfect size.", "Best small tablet for the money, hands down.", "With Amazon Prime, this thing is a total portable entertainment device.", "The size is appropriate and it has a great deal of FREE APPS on Amazon to download.", "It serves our purposes with a portable hot-spot device and gives us that lightweight portability needed for home, fun, work, and school.", "He loves the size for his 13 year old hands and really enjoys the content.", "7 inch is just the right size for me to carry around from room to room place to place."],
        ["size", "portable", "thin"]
    ],
    [
        ["I was told this replacement had 16G of space but yet I only use about 500mb for apps, 200mb for books and another 100mb or so in other and the device is saying it's out of memory and I need to delete some apps!Either it wasn't refurbished properly or its still defective.", "Just wish it had a mini SD slot, but with cloud storage it probably isn't necessary.", "This alleviated much of the storage problem...we have space for things other than books!Technical stuff: The screen is sufficient for reading, it is comfortable to hold and page through, the battery life is sufficient for my purposes (I've not tried any other tablets, so I can't compare...I know it works more than well enough for my purposes).", "I'm waiting for a tablet with a SD slot and pressure sensitive stylus (like WACOM), before I feel like tablets are &#34;there&#34;, but this is a very useful and fun device for use in our home or when traveling.", "If I have to give a complaint it would be that there is no sd slot but 16 gb for 200 bucks it is great :)", "I wish it would have a slot for micro SD cars slot so I can look for thing up and store thing.", "For some reason, the &#34;Others&#34; storage accounts for 10GB of 12GB of memory, and my device is near nonfunctional.", "Would have been really nice to have SD card...", "All flash memory con only be written to so many times, after that that memory is useless and this product will be operationally dead then.", "First they helped me clear the memory and try to load just one book and one game.", "Is that it doesn't have an sd card slot..but so far I haven'tRun out of memory yet...Amazon, PLEASE ADD EXTERNAL MEMORY to future model's."],
        ["memory", "sd slot", "sd card slot", "storage"]
    ],
    [
        ["The form factor on the Kindle Fire was very good for my use as I commute a lot and want something that's easy to get out, hold and use, then quickly put away.", "I finally bought a tablet .I have been looking at this since 2012.Indeed the weaknes of this one is Software but the hardware is great but...My goal for this tablet is to be able to read my kindle books without using my glasses, check my email and type with bigger keys without using my desktop or laptop and check other forum sites , check my audiobooks with ease without logging my laptop around.I do wish it has  an expansion external memory ports to transfer files to and fro and have more Apps since it is Andriod base.For set-up and memory usage .", "And the picture quality is awesome.", "I can't say enough good things about this product.", "The HD has a great picture quality and the Camera is awesome.", "Thanks Kindle for putting out such a great product.", "' This is a great deal better than the original kindle fire..", "Overall it works good, but this should be a $150 tablet.", "Works great and the battery is long lasting.", "Seriously Amazon?On the positive side, the hardware is decent (while not as good as the new Nexus 7, it is comparable to the old generation Nexus 7) and if you are a paying Amazon prime customer ($80 per year), you can also enjoy the streaming video service.", "Exceptional build quality, great size, good speakers - it's an almost perfect kid tablet.", "Since receiving my kindle fire hd, I am glad that I decided to go with the kindle over an ipad or other tablet.The screen quality for the movies and television programs I've watched so far has been excellent.For my needs, this is a great product, especially for the price.", "Great device.", "A great company, a great product--what more could you ask for.", "The Kindle Fire HD is really great !", "This is a great device and a lot lighter then taking my laptop everywhere I go.", "Great product!", "Good product and seamless experience so far.", "Great product with great technical support... what more could I ask for?", "As an e-reader the kindle fire is pretty good.", "It's a great product.", "Overall, I'd say this is a great product!", ":)Over-all it's a great device for a really good price and there's room for improvement.", "Amazingly clear.-The quality of the item is much higher than I expected; it's got some mass to it, and feels good in the handBottom line:  For the price difference, the Kindle wins HANDS DOWN.", "Great buy, very satisfied customer", "A great guy named Norman spent a lot of time with me making sure i learned how to use it and answer all my question (which were many).", "The kindle is a great product to keep in the car or handbag,...always entertained.", "I had the original Nook Color which was pretty decent however very slow and the OS was not really great.", "The Kindle Fire HD is a great tablet with superb sound.", "LOVE...LOVE my Kindle Fire...I love reading books, this is a great product for just that...saves me money and trees!", "This best tablet on the market.", "Basically thats what it is.......its no ipad, but if all you want to do is surf the internet and read books, then this is a great product at a reasonable price.", "I think this a far better product.The HD is great and the Amazon Instant Video looks fantastic even on a 4mbps connection.My father in law uses it for reading, watching movies, music and audio books.", "I would stick with a Nexus 7 or other android for an adult, but for kids this is great.", "Overall, she is pleased with the product (as well as I am).No issues with it as of this update.", "Remarkable quality for a tablet.", "It's a great device.", "This is such a cool device.", "These are really great.", "I think they make great hardware and just and okay OS.", "Great product for the price.", "Very nice product, combined with the kindle store, it is amazing.", "I use other devices for documents, most of my communication, and picture-taking, so I want a tablet strictly for entertainment.The new Kindle Fire HD is awesome.", "You should get a very good cover for it though but it's a great device to take on long flights because it travels very well.", "Other than that, seems to be a great product!"],
        ["quality", "product", "device", "hardware"]
    ],
    [
        ["It runs very slow, and other users that had older versions have said the same.", "Using my Dual Band Router, running the Kindle which also supports dual band, w/MEMO Technology and Dual Core processor at 5GHz is quite fast.", "i have a nook tablet not HD and this is 1000 times better - easier, faster, better content.", "The processor is surprisingly fast.", "It is a little slower than Ipad in some apps, but over all for the price a great unit.", "The carousel scrolls so smoothly.", "It is more responsive, faster, and has a ton more app options than the KFHD.", "It connected faster and stayed connected better, and re-connected faster, than the Dell Netbook that we also took.", "It is so fast and easy to use and such a vast improvement over the kindle fire.", "I don't see these as laptop replacements anytime soon...the systems are too slow and they are much harder to get into even with a stylus, than a laptop.", "So that was 2 1/2 years ago bought along the service plan for almost $350 with that being said the Nook you can get for about $100 now if that.I wanted something faster and smaller as I have an ipad but don't want haul everywhere and need something in between by Galaxy Note 2 and Ipad for reading purposes only.Now here are the disappointing parts.1.", "It operates like a smart phone rather than a computer in that sense, however it's on WiFi so it is pretty darn fast, and has great reception.", "I compared them all on speed, picture quality, sound and ease of use.", "They are just more user friendly and faster and smoother.", "things are so clear, and it seems to be faster.", "Its not as fast as the larger Ipod or a computer; but the speed is not cheezy either."],
        ["response time", "processor", "speed"]
    ],
    [
        ["I loved my Kindle Fire my son bought me for Christmas.", "Well, it died on me so this one is a replacement.", "Well, this new one didn't save it so he lost all of it.", "He was heart broken.", "I would of thought that since they had all the other stuff they could keep the progress on the games too.Besides for that it is great.", "It took a while to remember the setup and all but eventually I got it.", "I would recommend this to anyone.", "Especially for young ones.", "Kindle has come up with a new Kindle Fire HDX...", "Mine is  the older version now.", "I dont get it.", "the newer Kindle Fire HDX is like the old Kindle Fire...", "It gets confusing.", "Personally, I feel that these units were NOT Properly tested before marketing these tablets.I wish I had waited until these were out for quite a while before I got my 1st, 2nd, 3rd, 4th, 5th,6th, AND 7th Kindle Fire HD.", "Getting any of these has been the utmost worst experience inmy whole life.", "I feel extremely disappointed in Amazon over these units.", "I feel I was played asthe biggest chump in history.", "I got 2 of the 7&#34; Fire HDs, and 5 (FIVE) of the 8.9&#34; Fire HDs.I, myself, would not recommend these to anyone at all.", "My First Generation Kindle Fires workbetter then the Kindle Fire HD Tablets.", "Spare yourself, your time, your energy, effort & focusby NOT getting any of the Kindle Fire HD tablets.", "I bought this for my wife as her first tablet.", "She absolutely loves it.", "Ordered another one today for my daughter.", "Netflix and amazon instant video are really good on this baby also.", "As you can probably tell from my Amazon Profile Photo ----- I'm a little behind the times.", "But THAT is all right.", "She no longer pokes me with a fiery stick, and she'salways THERE when my energy is low and I need a new charge.Get a KINDLE FIRE for YOUR wife.", "SHE'll figure it out, and love ya for it!She used to swear at ME, but now, she swears by KINDLE.Great product!", "She LOVES it.", "I cannot figure it out: \"Fire!", "Bad!", "\"Sincerely Yours,\"Big Blue Mac\"Frankenstein, Bavaria", "I'd get an Android tablet instead, after all Kindle runs on Android.", "It has proprietary software on it , so Amazon controls it all even though any app that will run on Android will run on your Kindle, you have to &#34; side Load&#34; it.", "I bought ad free, but there are still Amazoin ads on it.", "It works, and it works well.", "I am once again pleasantly pleased with Amazon's refurbished goods.", "I bought this Kindle Fire HD 7&#34; tablet as a gift for my wife on mother's day this year, and she is in love with it.", "The build quality is extremely good, and there were absolutely no noticeable physical blemishes on the device whatsoever.", "It looked like an untouched, unused Kindle Fire.It performs flawlessly, too.", "We've also been able to download, install, and run a myriad of apps without a hitch.It's great for vacations, entertaining the children, and unwinding in the evening before heading to bed.At the end of the day, it's another high quality product from Amazon, and just another reason why I am definitely going to purchase certified refurbished devices from Amazon once more in the future.", "I purchased the HD version shortly after I (tragically) lost my original Kindle Fire.", "When I replaced it, it was right after the HD version was released, so I was able to &#34;upgrade&#34; for what my husband originally paid for the first one.", "I love it and it is with me almost 24/7.", "I have the one with the ads and initially, I didn't mind those terribly much because I received a few offers that got me free music.", "However, nothing great has been offered lately and I am considering paying the extra money to get rid of the ads.", "I love this thing!", "I have a friend that is an apple tech, he's been telling me not to buy one for months the only tablet to buy is an apple so he says.", "Like the kindle fire.", "no issues... for me the kindle was more for the book reading.", "Other than that you can find the same things on a android/I phone.", "Its a good computer subsitute incase you dont have a primary laptop/desktop with you.", "Also the Sound is excellent with this little device....", "This is one powerfull machine!!", "it will do everything you want it to do, and look fantastic doing it!.", "It just has a great feel and balance.", "The screen is gorgeous, the unit is light, its really very user friendly.", "I liked my larger kindle fire until I got this one.", "E-reader, netflix viewer, internet searcher... this is the right size for them all", "My college senior daughter loves this device.Absolutely perfect engineering and a high-quality build.Works beautifully.", "I've had other tablets before, another after none feels the same or performs the same with media.", "It has its drawbacks, they still haven't fixed the speech to text feature, But any drawbacks it has are with android and not with the hardware design Which is practically flawless.", "I have access to a few devices find myself time and again reaching for the Kindle.You will never be able to put it down.", "I've been wanting a smaller tablet type device and this is awesome.", "My experiences have been with iPhones, ipads an older kindle with keyboard and a current kindle white.", "The amazon experience is certainly a key benefit if your into shopping, prime videos, Kindle books/magazines, audible and more.", "I like the spotify app for music but some of the others are not as good as the Apple counterparts.", "I don't see it as a productivity tool but it's a great little media machine.", "I love my Kindle Fire HD 7&#34;.", "I also bought the Fire HD so that I could read magazines in color on it.", "There's a lot you can do with this, but I'm using it mostly for reading.", "Great selection of books.", "The Kindle Fire HD 7&#34; is a nice tablet, but not a great tablet.", "I purchased this for my wife after she became jealous of my Nexus 7 and told me she wanted a Kindle Fire for herself.", "Also, if you are accustomed to rooting and tinkering with android devices be warned that the Kindle was the least friendly device for rooting and does not have a large developer following.I want to be fair to the device though, it is great for what it is.", "Unfortunately, I thought I was getting my wife a full on android tablet and it was not that (at least not out of the box) and that is why I gave it 3 stars.", "I bought this for my wife and she is thoroughly enjoying it.", "This does not take away from the rating of the product.", "I recommend this for all bookworms.", "You can load thousands of books.Simply Wonderful!", "So far I've enjoyed this upgraded version.", "It took a bit getting used to the ads, but now it's not an issue.", "Prior to adding a protective cover, it got a little to warm for my taste when holding it....", "I love the Kindle family.", "I have had them all.", "I find this product far Superior to the ipad (which I got for my bday a couple years ago).", "Plus you cant loose when it fits neatly into your purse for travel :)", "Just received it a few days ago so still playing around with it and learning all the wonderful things I can do with it.", "Much more fun than my smartphone!", "I've purchased several iterations of the Kindle starting with the Kindle 1, then a Kindle DX then a Kindle Fire and now the Kindle 7\" Fire HD.", "With the price point being so low it's hard not to pick it up.", "I couldn't be more please with spending so little compared to the other tablets that iQuit(pun), I have to look at the kid protections as well as this is something I wish others had.", "I love it, I love it, I love it....", "Don't get me wrong, for most people this machine is a no brainer, but for me, it's just &#34;OK&#34;.", "For it, it was a gift.", "My problem is, I don't read from eBooks.", "I only read paper books.", "There's just something about an actual book in my hand that I can't get from holding up a Kindle or any ereader, for that matter.", "I can honestly say that the reader DOES do books good, because I did read at least 1 using this.", "Also, the fact that Prime members have access to an unheard of amount of books they can &#34;borrow&#34; for free?!", "For the people that are looking for the best tablet on the market for the price,....the KINDLE is just that!", "I held off on getting a Kindle Fire HD.", "My father has the original Fire and the HD one and after testing them both out one night, I decided to get the HD one and am so happy I did!I bought the special offers one and it has paid off.", "So far I have received $4 of MP3 credits, a $10 credit for changing my one click method, and also 500 `coins' in my account which you can buy games for your Fire.The size of the HD is perfect in my hands and also my daughter.", "It also has an hour timer, after that, she is logged out.This has been very handy for both me and my daughter.", "Next week they come out with the new Kindle Fires but I am happy with this one right now.", "Give it time though, I know I will upgrade.", "ALright ...", "I just need to transfer my music files and books to Cloud and then i can easily access them ,no biggie since I have been doing that .And for 159 + tax , its not bad of a tablet that is well built.Dual core is fast enough for what it can do .", "lolSo for now , this Kindle Fire HD will serve its purpose which is  pretty much a toy to me.", "Purchased this as a gift for my aunt.", "It is a huge improvement over the original Kindle Fire.", "Nice tablet.", "100% positive.", "Delivery on time.", "Good and secure packing.", "Excellent value for the money, easy to navigate.", "I really like all its features!!", "Great company to purchase from and they have never let me down.", "My husband bought this for me because of our anniversary and I graduated college.", "I thought I would be able to take pictures of my granddaughter and use it with the Yahoo Messenger and Skype.", "So I this unit works great for a refurbished.Save some money and get more Gigabits.", "I went back & forth between the Kindle Fire HD and an iPad mini.", "The iPad is significantly pricier, but does more.", "In the end, since what I wanted was something to watch/listen to media while at work the Kindle is the better choice for me.", "If you need to do spreadsheets, word processing, business apps on the go, this is not the best choice.", "But if you need something to pass the time on a long trip and are already an Amazon customer, in the long run this is the way to go.", "Great screen, very good speakers for this type of device and a huge media selection.", "One note though: not all Android apps are compatible.", "The Kindle uses a custom version unique (i.e.", "limiting) to Amazon.", "Love my kindle.", "It has some great apps.", "I will say that it is heavier then I thought but you get so used to it that you dont notice.", "Works perfectly and cant be happier.", "I just wish that it had live viewing capability as some similar devices.", "The only thing I have to say that is bad is trying to type on the thing to set it up was almost impossible.", "My daughter had to do it because her fingers are smaller.", "This is just what my granddaughter wanted for her birthday.", "tried buying one from ebay first.", "thought I was saving $.. paid $80 and it quit after 6 days.", "This is the way to go for the long run.", "All i can say is wow!", "ps have a pair of beats solo hd now and audio is awesomer wow!", "Just received my 2nd Kindle and for the music alone...the sound is great.", "Been having some problems like my 2nd email address can receive but having a problem sending any emails.", "It keeps asking me to retry but still doesn's send.", "Can't find my 1st Kindle library.", "A little annoying but I'll work thru it.", "Probably will call Amazon for help later.", "I think this was a good investment.", "It is great to read my digital books on and other on line things that my &#34;Dumb Phone&#34; can't do while I am out and about.", "This is my second Kindle and I have nothing but good to say about it.", "In fact I am so pleased with it that I plan to buy one for my granddaughter for Christmas.", "I give this Kindle Fire HD 7&#34; a 3 stars b/c of the following items that need to be improved,1.", "There is no YIM - Every time I need to read a reply, I have to press the refresh tab3.", "Hard to book sites into favorite so those sites can easily be accessed4.", "This is a Christmas present from my husband.", "I was afraid to try this but my friend is so techno, I knew I would have a good resource to &#34;hold my hand,&#34; as needed.", "There is so much to learn..how to navigate around.", "I downloaded some of the &#34;free&#34; kindle books this weekend.", "HOW COOL IS THIS??", "I love that we have the classics available and cookbooks too.", "I have much to learn but it is a new adventure for a new year, in hopes to put all the bad of last year behind.", "WHAT WOULD WE DO WITHOUT AMAZON?", "?", "I'm a longtime Kindle owner, starting with the Kindle 3, and then Kindle Fire.", "I recently bought my wife a Kindle Fire HD for her birthday, and was blown away at the upgrade in quality from the Kindle Fire to the HD (and let me emphasize that I LOVE my old Kindle Fire) ... it's just in a different league.", "For Amazon Prime and Instant Video customers, it's been an issue before that if you own an HD video, you could still only see it in standard definition on the older device, even if you could get it on HD on your smart TV hookup.", "You can now see the full HD on the Fire, enhanced by the new sound.", "This also applies to HD content on Netflix and other services, of course.", "After our old kindle ate it.", "I contacted Amazon and they gave me five options to replace at a deep discount cause the warranty was up.", "It arrived and you cannot tell it is a refurb.Works perfect.", "My loves it and I sent a link to her friend who is also gonna get one.Very pleased and would buy another in a flash if I needed one.", "I bought this for me after buying one for wife and seeing how much she envoys it.", "There seems to be a war ongoing between Google and Amazon over using some great apps on Kindle.", "I wish the two companies would get this worked out.", "Very annoying.", "I suspect that a lot of people bought a Kindle before they knew of this problem.2- I am tired of all of the ads on my Kindle.", "I only found out recently that I could have opted out of these annoying ads by paying a higher price for that option.", "I do not remember that option being available or being properly explained.I like my Kindle but #1 and/or #2 would be deal breaker for me today.", "I bought this for my friend's grandchild, because he enjoyed playing with mine when I had it, I own an ASUS tablet now, he loves it and enjoys all the games he gets on it, he's only 4 years old now, but I'm certain as he gets older he'll see more benefits with owning this as long as it survives....", "LOL!!", "!...", "I bought this for my wife but I use it more than she does.", "I dont read on it a lot but I love to watch netflix and youtube on it.", "I sit in bed with it and do just about everything you can do on a computer but its compact.", "I can't go on enough about the Kindle Fire HD!.", "It's by far my favorite toy I'v ever owned.", "And as far as Amazon...", "I cant say enough good things about this company!!", "!", "I have been using this jewel for 6 months now and simply love it!", "Excellent picture, great sound (for the gadget), you can actually be productive with it once you get accustom to the size.", "It is very light even with the rooCase on it.", "LOTS of free apps that simply work!", "I can work with Word, Excel, PP, and Publisher with no problem.", "I am looking forward to the HDX 8.9.", "Here is the best part - it was a premium for opening a checking account!", "Even when the first one bricked by itself the 2nd one as has been running flawlessly for 5.5 months.", "i highly recommend this little 'tablet'.", "I love Amazon.", "It's clunky to scroll through everything to find something when on an Android tablet you have dozens of icons filling the screen.The browser is wack, and I'm limited on ones I can download.The tablet itself is quite fat as well.On the plus side, I did enjoy the screen clarity and the speakers.", "Very nice on that part.In the end, I returned my Kindle and got a new $80 Asus tablet on clearance.", "I love my Kindle.", "My kids use it, too.", "The only thing that I would like to see redesigned is the carousel.", "It can get a little overwhelming, as it is not organized or categorized at all.", "Also, any time a video is watched on Amazon prime, it is added to the carousel--a virtual nightmare after my three-year-old has it for a couple of hours.", "Other than that, it's perfect.", "But my favorite thing about it is Amazon's customer service.", "I cannot say enough good things about the awesome service I have received time and time again.", "Both were replaced with no drama.", "I LOVE AMAZON.", "I love the Fire HD.. We have a regular fire and it has been great..", "There are loads about the HD that dont even compare to the regular though...", "I love this Kindle Fire Refurb.", "I secured it with Square Trade Warranty in case she drops it or it decides to stop working.", "Will definitely recommend!", "I'm really not tech-savvy whatsoever, and that's why the Kindle is so great for me.", "But that's all I got!", "I purchased 2 Kindle fire HD's for Christmas, one for the wife and one for my son.", "They both love them but my wife has had three of them.", "After she charged it and started using it the kindle would randomly turn itself off or restart itself, so often she stopped using it.", "I am not getting another one we will be getting another brand of tablet, so disappointing.Update 10/2013Amazon the replaced defective kindle fire and we received the new one in the mail and it works perfectly, thanks Amazon for excellent customer service.", "It is great except for you often have to open the book 4 or more times to get them to stay open.", "I hope they will issure a &#34;fix&#34; for this soon.", "It took me a long time to finally decide to buy a Kindle and I am really happy I did.", "The Kindle surpassed my expectations for it.", "I bought a case for it with an elastic band that I can use to help hold it up, or prop open with the case inverted into itself, but neither is particuarly convenient (not to mention having to purchase a whole other item and research options, etc).", "The case I bought puts it into sleep and automatically wakes up the screen when I close/open it so I guess I can live with it.", "Other than that I have been nothing but happy with my purchase and highly recommend it to anyone thinking about buying one (especially since the recent price drop).", "Love this Kindle Fire HD.", "I've been using it more or less like a computer instead of a reader.", "I could root it but that would simply ruin the experience of the kindle for me.", "My only disappointment with the Kindle Fire HD is the fact that you can not download contact information from Outlook or Apple Mail.", "The help desk did not have any work-a-rounds to load these contacts.", "Product didn't do what was advertised.", "Lacked sufficient and compatible software and operating system for my needs.", "I was very disappointed and hope they work harder to making this more compatible.", "This is my second Kindle Fire, I decided to upgrade and I am very pleased with the decision to go with the Kindle Fire HD.", "Gotta love that customer service!", "What can I say?", "I've used iPads, Android tablets, Windows tablets... but the fire by far is my favorite.", "All for less than $200!?", "Yeah, can the iPad say that?", "I don't think so.", "When I purchased it I used the discount code to get an extra 20% off, I thought, hey, it will be worth it.", "I figured I'd like it and I'd use it enough to justify buying it, but I SERIOUSLY USE IT ALL THE TIME!", "It's with me everywhere I go.", "The wifi is incredibly fast, and matched with the kindle silk OS, it's just a gem.", "I can't explain how happy I am with this purchase, but if you have one and are reading this, you know what I mean.", "Totally awesome.", "Just sayin.", "Absolutely love it!", "I also have a paperwhite, which is nice, but I've only been using my KF HD 7\" since I received it.", "I've read a lot of reviews by folks who also have a iPad doohickey, and most of them prefer the Fire HD.", "It is not obtrusive, isn't heavy, easy to carry, etc.", "I definitely recommend the Fire HD 7\", and I'll probably be upgrading my wife's first gen Fire with a new HD.", "(Don't tell her, though).", "Got it today...still playing with it.", "I can't use several of the apps that I have on my phone.", "Google products have Amazon App, why not the other way around?", "If you like to read, maybe watch a movie or two every now and then, then this is for you.", "You will be supprised at what this can do, so before running out a spending $400 on your basic Ipad, consider this.", "I got this Kindle on sale!", "They are or were on sale for something like $199 for this 32 GB version.", "I have a Galaxy Tab also but I won't do a comparison because I have each tablet for different reasons and they are both excellent in their own right.", "Having a Prime account is definitely an investment worth having.", "If you do buy a Kindle, beware of one thing which I found to be totally ridiculas.", "WHen it was shipped to my house it was left on my porch by the delivery driver.", "That in itself doesn't sound too awefully bad except it wasn't wrapped in any brown paper or placed inside a box of any kind!", "No!", "It was in it's original Kindle Box left out for the whole neighborhood to see.", "If someone had wanted a new Kindle it would have been a snap!", "Thankfully no one took it but if you live in a more dense area you never know what could have happened.", "I have a Nexus 7, Nook HD and a Kindle Fire.", "All are very nice units and each has its distinct advantages.", "When Amazon had a sale on the HD units I couldn't resist since frankly their ecosystem and software is just superior.", "I have the older edition Kindle fire and I think it's great.", "I bought the new 7 inch fire hd 16gb for my daughters birthday and it hasn't left her sight since.", "And lest we forget the real purpose of the Fire HD she has started buying books from Amazon.", "I love my kindle fire hd.", "I don't use a ton of apps some for the kids, some for list for the grocery store so I may not be the best at judging that but so far whatever I've wanted I've been able to get.", "Easy, fun, and affordable", "I really am enjoying my Kindle Fire HD.", "It does so many things.", "Splurged and joined Netflix.", "My husband and I have always disagreed on television programs.", "This way I can also enjoy my evening of relaxing.", "Also able to download plenty of free books and can lend books also.", "So far this product has exceeded my expectations.", "Would highly reccomend this.", "Tech support is A plus.", "Resolved my issue immediately.", "It's amazing.", "I love this device.", "The capabilities are amazing from downloading straight from the website to being a prime member and loaning and receiving books.", "Almost completely eliminates the need for a smart phone.", "Purchased for my wife so she doesn't have to lug her notebook with her on trips.", "It meets all her needs to read and send emails, review MSOffice files, skype, facebook, games and best of all &#34;reading&#34;.", "We have several magazines being received electronically (no more bed full of magazines!!!!;-(=)).", "It fit easily into a normal purse or suit pocket.", "With the Kindle for androiods I can share books and magazine on my Android phone.", "Unless you're fully invested in the Amazon ecosystem, this isn't the tablet for you.", "It functions more as a storefront for Amazon than as a tablet.", "I bought the Google Nexus 7 instead and have been far happier with it.", "We were looking at the Ipad Mini for awhile before we decided to go with the Fire HD.", "Our friends bought a Mini and we figured if we ended up liking it more we would just pick a Mini up and I would use the Fire.", "I do like some features of the Mini, but they are far from justifying over $200 dollars more.", "We could buy two fires for the price our friends spent on their Mini.", "I'm sure someone is gonna argue semantics between apple and kindle.... go ahead and save yourself the time because you for darn sure didn't save yourself the money.", "When was the last time you contacted a customer service department and had a problem resolved within hours?", "Within an hour of sending an e-mail, a tech rep called me in an effort to resolve the problem.", "Unfortunately, nothing worked.", "When I connected my year old Kindle e-reader, it showed up on Windows Explorer immediately, so it was determined that the Fire had an internal problem.", "As a result, Amazon issued a prepaid return label.", "I can't say enough about Amazon's ability to \"do it right\" when it comes to customer service.", "The Fire is an amazing device, but Amazon's customer service wins every award possible!", "Received it two day ago and it is very well built.Outstanding screen display and the ad's are not as horrible as other reviewers have complained about.The touch screen takes a bit of getting used to, and the learning curve on using it is not bad at at all.Using the built in browser on internet forums is good, no need for 3rd party apps to read or post on thatI have found.", "Great to keep up with mail and people, especially if you do not have a cell smartphone whenout and about.", "I use it with an external blue tooth keyboard with no issues.", "It is much better than carrying a laptop.", "It is easy to use with limited user ability to customize, which is no big deal.", "Multi media works great.", "I was previously using the basic Kindle for the past couple years, and received the Kindle Fire HD 7&#34; for Christmas.", "The definition is outstanding; colors are vivid.", "And now my husband is getting hooked on it as well (have to hunt him down sometimes when I can't find my Kindle!).", "Never thought I would enjoy watching a movie on a screen this size, but I've found that it's great to cozy up with a blanket in my favorite lounger and a cup of coffee while my husband watches his favorite TV shows in the other room.", "Would definitely recommend this product!", "I looked into Ipads, nooks, nexus and Azus transformer tablets but Kindle did it for me.", "far superior than any of the others.", "I have no complains currently.", "Words can not describe how much I love this product.", "I know I don't use it to its full potential, because I use it almost exclusively as an ebook reader (although I do have a few games on it which I enjoy at times).", "Considering how many books I read in a years' time, this device also saves us considerable space in our house, as I had several bookshelves full of my reading material, and more stored in boxes because I didn't have room for them on the shelves.", "I am so glad I did the upgrade from the Kindle Fire.", "My daughter is now able to Skype with her grandparents that live out of state.", "And with a fraction of the cost of an iPad.", "I bought the Kindle Fire HD for my wife as a Christmas present.", "She had a Kindle, but complained about glare, with or without the clip-on light I bought.", "She loves her Kindle Fire HD.", "She uses her Fire everyday.", "Her &#34;old&#34; Kindle?", "You guessed it, it's mine now.", "I like it just fine and don't have any problem with glare.", "I bought the KFHD 8.9 a month ago but decided to return it.", "I haven't noticed any difference in performance between either of them.", "Why the Kindle HD?", "First, if you really want a program, you can find it online and sideload it, so that point is moot.", "However, the Kindle Store actually gives me more than I could get otherwise.", "USA Today and PBS app are two that come to mind.", "Do they work on other Android devices?", "Yes, but not all.", "They work on Kindle.", "I've also sideloaded Google Chrome, Maps, Gmail and even Adobe Flash.", "Just a few clicks after searching Google.I'd like to see it a little bit lighter, but it really isn't bad at all, and it is much lighter than the 8.9.", "I wanted to test this product and then a I Pad mini.", "Not as quick as I'd like, but good for reading.", "I'll have to post again when I get the mini", "I am really happy with my Kindle.", "I like the idea that I can change the background page color when reading.", "I use Sepia for evening reading and don't need a reading light and it is not as glaring as white background.The only thing that I am not pleased with is the fact that I am a Prime member through someone else and found out after I purchased the Kindle that I was not eligible for the free Prime books.", "You have to be a paying Prime member and I was disappointed in that.", "But there are some free books available anyway.", "I owned version 2 of the Kindle reader and splurged on this.", "So far, I it meets every expectation and more.", "I watched a movie on it (never did that before) not a huge music fan so can't really comment, and the reader is excellent.", "Great apps!", "I read so much that I hardly have time for more than that, my calendar, and calorie counter, and Picasso, and Solitaire, and...... =)  Happy Camper.", "Love--love---love my new Kindle.", "It's my 3rd Kindle.", "I started with a basic one about 3years ago and just keep upgrading.", "My Fire goes everywhere with me --- especially since I can do anything on it that I can do on my PC.", "For $200 there is nothing that comes close.", "The Nexus doesn't do everything this does, research it.", "It's terrible.", "Plus now it's around $300.The ads are kind of annoying, but far from a deal breaker.", "I love this tablet so much I am thinking about buying another so my wife doesn't have to use mine all of the time!", "If you use Amazon for your music/cloud like I do you would be dumb not to buy this.", "This device has restored my faith in Amazon.", "&lt;g>Don't listen to the Apple Hype, try this device and compare it directly to the IPad.", "While it may not have all of the apps the IPad does it works very well.", "It allows me to write and edit Microsoft Office (word/excel/pp) documents with ease.", "It has allowed me to mostly retire my Thinkpad X60 for daily use.", "I am very impressed with my Kindle Fire HD 7\", the dolby audio sounds amazing while watching a movie and the graphics are just sharp.", "While I'm returning this, I think it is a great tablet for those who have a lot of Amazon content (prime, etc) and are looking for a very simple tablet.", "I bought this for myself, and was initially quite impressed.", "However, I soon became frustrated with the lack of ability to add apps I used often if they were not in the Amazon Kindle store.", "You can add some of them if the .apk files are available, but if they are only available through android central or google play, forget about it..As a consequence, I bought a conventional Android tablet.", "The Fire HD was commandeered by my 8 yo daughter.", "As I was setting it up for her, I was very impressed at how easy to manage the parental controls were.", "Well worth the small monthly fee - it gives her TONS of content that she loves - you can also limit by age, etc.", "Tremendously useful in the summer.So, there is a happy ending to this review.", "The Fire was not ideal for me, but I am a power user with specific needs for work (and screwing around).", "If you are willing to live within the Amazon ecosystem, it is a fantastic device.", "Enjoy!", "Having previously having the previous Kindle Fire, the KFHD 7 blew my mind.", "The volume is so good that I don't have to hook my KFHD to my van's sound system; the volume is so loud that I can just put it on my console and listen to a book or music.", "However, it is only a matter of getting used to the slight differences.Being able to put the system to sleep by just shutting the case is incredible.", "HOWEVER, when recording something, the cover can be closed without turning off the recording.", "It comes in handy during lectures.", "I tried one of their competitor's products...I gave it to my brother as a birthday gift and kept my Kindle.", "It is still lousy to type on for the left handed, even with a stylus.", "The keyboard could use arrow keys for maneuver ing.", "I have an extra period and space here I can't get rid of because kindle won't let me.", "Needs backspace as well as delete.After the original kindle failure, I kept kindle software on my computers for ages.", "The on board help is a joke, there is no manual and I don't intuitively pick up the stuff that is supposed to be intuitive.I would pay good money for an actual paper manual.", "Don't tell me I don't need one.", "I'm a dinosaur and I need one.I typed this on my kindle to show you can do that and to show you can't get rid of mistakes either.", "you.", "I read so much into this device and was sold on the advertising that I didn't look nearly as far into it's competition as I should have.", "Bought this as a replacement for my Nook HD, since Barnes & Noble seem to be having extreme difficulties these days.", "B&N; had a bad habit of charging to your card with the largest balance instead of using up the smaller cards first.", "Worse yet, they took the attitude that if you don't like it, leave (this was the result of several emails) and customer service was practically non-existent.", "So I left and haven't looked back.", "I am so thankful I made the switch.", "Bought this for our Anniversary (but more for my Wife), it does everything she wants, she was disappointed that the last version was gone.", "I insured her the new one would likely much better (we had played around with my Sister's Kindle).", "In fact, I just bought another one for my Son's wife who is expecting in six weeks.", "The Kindle Fire HD is an outstanding tablet for it's use, for my wife and me, it has earned 5 stars.", "This is our first tablet computer.", "It works very well so far.", "Have had it less than a week.", "The transition to a tablet with &#34;apps&#34; takes a little getting used to, but there are a ton of free apps to try out.", "Touch responsiveness seems very good, fast and accurate, but a little too sensitive at times.", "I'm very happy and I use it for everything.", "Love it.", "I am not going into what you all know by the reviews and press.", "I will say that people are blowing the ads out of proportion.", "They do not interfere with any aspect of usage nor are they overbearing.", "I was expecting horrible things and was like THIS was the big deal, really?", "My only complaint is the dang carousel.", "I do not want the last things I have done to pop up there it is irritating.", "If I remove stuff it returns when I turn the fire off then back on.", "I do not need my last 20 books or so to load there, if I am rereading I would go further back then 20 books.", "I also read on my ereader for the most part so rarely would a book be what I am looking for quickly.", "A customizable carousel would garner the fire a 5 instead of the 4.5 I am giving it.", "I am a Kindle groupie.", "I was Slow to come to tablet reading, I love books too.", "But let's face it, carrying around a whole pile of books in my hand is just too wonderful.", "I work and travel  a bit.", "I used to over-pack my books.", "I have this phobia about being trapped without a book I like.", "(I get it, pretty tame phobia.).", "And my husband is always late, but I always have something to read.", "Anyway, I started with a basic Kindle, and when this came up, I pre-ordered.", "The Firenis great.", "The light is adjustable, and doesn't hurt my eyes which I feared.", "The access to email is wonderful to have in a reader.", "I love having the dictionary built in.", "I even watch a show or two.", "It fits in my purse.", "I can get online.", "I wish this size fire had 3G.", "That would be my only reservation.Of course I would recommend it to any age, but for an older reader, I think you will also love it.", "If you are thinking of taking the plunge, I would do it.", "(and save a few trees)", "The sound and resolution is excellent.", "Oh well.", "I had a 6 month old Nexus 7 that I LOVED.", "The lender's library is terrible!", "1 book per month?!?!", "Seriously?", "I read an average of 4 -5 books a week!It's not all bad though.", "Display is nice and crisp.", "Video playback is awesome.", "!However, I am only giving 3 stars due to Amazon being cheapskates.Buy a charger (ALL other tablets come with one) and don't buy this thinking you can read a ton of books via the lender's library.", "I went for the refurb since the warranty and customer service is the same.", "Does this about 10 times then shuts down for good.", "Only thing I can see is the Kindle Fire logo, then black.", "Amazon customer service was great though, exchanged the item for a like product after a 5 minute chat online and it came in 2 days.", "Replacement has been fine for about 2 weeks now, no issues.", "Replacement's can be new or refurb units.", "2 stars instead of 1 because of stellar customer support (the reason I went with the Fire instead of Nook in the first place).", "Love my kindle.", "So awesome.", "Bought this as a gift for my 70 year old mom.", "She loves too.", "I purchased the Kindle Fire HD a few days after it came out and I liked it well enough.", "However, it became my true companion and best friend this past week during the aftermath of hurricane Sandy, and I have a new appreciation for this awesome device!We lost power for a week, and this is when my kindle really shined.", "I couldn't be happier with our Kindle HD's.", "All my kids now have one, and they all love them alot.", "You can do so much on them, and the enjoyement never ends, from reading, to playing games, to surfing the net etc........ Can get enough of our kindles:)", "My wife loves this tablet.", "She says it is the best present I ever gave her.", "She uses it all the time for everything it does.", "Get the official case with it as it fits perfectly and the magneting sleep switch is built into the case.", "My kindle fire was for my friend...", "He is very crazy with it,so I like too...I recommend you to buy it because it has many benefits,features and amazon prime!", "!", "The kindle fire hd 7&#34; is amazing.", "I really like what it offers.", "I am new in tablets and I decided to get a kindle fire, of course I am very happy with my choise.", "I've had the Kindle now for many months and love it.", "I chose the Kindle over the iPad as I am an Amazon Prime member.", "Please reach out to me through this post if you have any questions about use or what it can do, I love it and use mine for everything from banking to controlling my NEST thermostat.", "This unit goes far beyond the original Kindle.", "I charge mine at night, and seldom run low on power even on a day filled with heavy use.", "I love my Kindle Fire.", "I just wish it was more customization.", "Instead of being about to customize backgrounds there are advertisements.", "That seems weak to me.... but great device other than that.", "Love my kindle Fire, way better than iPad.", "I may have to do a factory reset soon.", "My wife owns an iPad 2... it's OK!", "But this one is SOO much faster!!", "It does everything I want it to do in the blink of an eye!!", "I would definitely recommend this over ANY Apple Product!!", "!", "I LOVE my new Kindle Fire HD 7!!!", "This has already been a lifesaver for car rides and waiting at his doctors appointment.", "I enjoy being able to switch views.", "I also like that you can enlarge or shrink just by using your fingers.", "Also the camera on this is not meant to take pictures-it is front facing only and just meant for Skyping and for use with some apps.", "I hope this review helps-so YES I am happy with my Kindle Fire HD 7 and know IT DOES N O T COME WITH A CHARGER SO BUY ONE WITH YOUR ORDER!!!", "!", "For several months I had been looking into purchasing a tablet of some sort to read my college textbooks on.", "I couldn&#8217;t decide, but was leaning towards the Kindle Fire HD when I received an email from Amazon that said I had won one.", "I absolutely love it!", "Actual results may vary.&#8221; In my opinion, the ads honestly aren&#8217;t a big deal at all, and I don&#8217;t understand why some people make such a huge deal about it.", "As of right now, I don&#8217;t have any complaints about my Kindle Fire and would highly recommend it to anyone looking for a tablet/e-reader.", "Oh, have you figured out, I love it!", "The Kindle has returned me to the ability to carry a &#34;book&#34; with me at all times, and have the print large enough to read.", "I have limited vision and have loved reading since 3 yrs old...", "Started with the Pooh books which I now love to read to my grandchildren.", "With all of the &#34;tablet hype&#34;, but unable to purchase an iPad due to the cost, I have a couple of friends who have the Kindle Fire and LOVED it.", "I took their advice and purchased one for myself and my daughter.", "I am adjusting to reading books on it, but living in an apartment, it is definitely a book shelf saver.", ":)  I hope that more and more websites begin to offer electronic books.", "All of those $2.99's would definitely add up quick.", "There is no product that I love more than the new Kindle HD.", "I do have a 10.1 tablet as well.. which is a different brand but is similar to an IPad.", "The Kindle wins for me.", "I take it everywhere.", "It fits into my purse easily and with the recommended cover.... it is fantastic.", "I especially like the fact that when You close the cover, the Kindle goes off.", "This makes it so easy when you are interrupted in an appointment.", "I have had all the Kindles.", "I have passed them along to friends.", "You can buy other tablets but the biggest reason for getting a Kindle HD is the support you get from Amazon.com.", "Buy a Kindle HD!", "You will never regret it!", "i have 2.  customer service is great, too!", "love this!", "i checked out all the other tablets - including the off brands.", "glad i went with this one.", "This is my one and only high-tech toy and I love it.", "I love this product.", "I read all the reviews on this tablet good and bad and I'm sure you can find fault in anything if you want to but the truth is what do you need or want and if you want something are you going to use it.This is the best 7 inch tablet period I take my fire hd every where and love it there's nothing I can say bad about it this is the first time I bought something that was as advertized what you read is what you get great everything.I never thought I would say that reading a magazine was a experience but it is on the fire hd its also simple to use smooth to the touch and has a first class screen and viewing of anything.Everybody talks about apps and how Amazon has the least amount of them but this is a huge leap in the tablet market and I'm sure there's more is to come real soon.People forget that when the Ipad first came out that they had a much smaller amount of apps than they do today and a lot less of all the other things Amazon already has like books,magazines and movies free movies with prime membershipThe best way to say what I'm trying to say is if you make it they will come and Amazon just made it.", "There are lots of comments here where people is complaining about.", "I completely agree, not sure why Amazon did that but it is what it is.I was ready to pay the extra to remove the ads but I wanted to give it a try first.", "I realized that we barely put any attention to these ads.", "They get displayed when you open the Kindle but that precise moment you mind is focused in typing the password and the moment you click OK, the ad is gone.", "Is it really a big deal?", "I don&#8217;t think so.", "So my recommendation in this area is not too concerned.As far as expectations and usability, the size is definitely too small for day to day activities, I still prefer the iPad or the larger Kindle where you can see more details and browsing the web is not that difficult due to the screen size.I would recommend this size for children and people who may do mostly reading or perhaps frequent travelers concerned with size.", "Besides that, it is a nice device, it has been working without bugs or issues and it allows a nice integration with other Amazon services such as Prime.", "I love this product.", "I had delete everything off the Kindle but that didn't do the trick.", "I'm wondering if any other users had the same problem.", "It keeps on auto correcting words so if your not careful it will type in the wrong item.", "One last thing to complain about it is all the extras.", "For $199, it's worth every penny.", "Hell even bought my mother one for Christmas.", "However, Amazon charges you $10 for a charger (a must), $80 for prime (another must), & whatever else items you might want to purchase.", "I wish they'd just have the kindle, prime, & the must haves all in one package for a certain fee and that's it.", "A small gripe but I do love the Kindle and recommend it to everyone.", "If not for this I would have given it 4 starts.", "However, since I already have Netflix, I didn't bother with it.", "I watch YouTube and Netflix more than anything else.", "This is a reasonably competitive Android tablet.", "Some of the apps are awkward to use, and it takes some digging to find out how to get non-Amazon books onto the tablet.", "The built-in Silk browser is too Amazon focused; I added the Dolphin browser.", "As an original Kindle Fire owner, I wasn't expecting much.", "The original Fire was way too limited, though a good concept at the time considering it's price point vis-&agrave;-vis other tablets in the market.", "But what killed it for me was the laggy response.", "The Fire HD still has lag, but it's acceptable.", "But it's truly a whole different beast.", "Add to it a Prime and a Freetime subscription and this is awesome for kids.", "I think an adult would appreciate it too, but I would probably still go with an iPad mini for myself.", "I have the 9 inch fire hd and truly enjoy it.", "My daughters old kindle reader died so I replaced it with the fire 7 inch hd and she rarely puts it down.", "There are too many reasons this gets 5 stars to list here.", "Mainly, my daughter has gone from reading 20 minutes a day to at least an hour or more.", "It is definitly the biggest hit ever as Christmas gifts go.", "She LOVES it!", "It stays charged for a long time, days usually.", "I must say I didn't know if it would be worth buying, but I'm glad I did.", "I can use kindle to go on the internet and it has a very nice connection speed here at home.", "I used it to travel and it was nice to take along with me like sitting in the airplane for hours.", "I used it to get my advance seating on the airplane for my trip home to.", "Just find a hotspot and your set to go.", "Wow!", "This is very impressive.Of course the books are easy to read, I read one the first evening I had the Fire HD just to see how well this worked, actually listened to music while reading!One of the items I checked before buiying the Fire HD was the availability o the Cisco AnyConnect VPN client, the first app I installed was the VPN client, no problems in installing or configuring, flawless operation and the connection is persistent, I can establish it at home (also on the College network), walk to work, and have it reconnect as I get within wireless range of the College.", "Excellent.", "This means I can access private financial records, anywhere in the world, and be connected as though I were \"on Campus\".I am very satisfied with this tablet.", "I bought this for my 11 year old nephew and he loves it.", "He does some reading but mostly plays games.", "Once I set it up for him he has been able to figure everything else out easily.", "He's had it for over a year now and hasn't been able to break it, it seems pretty kid proof.", "There are parent lock settings that my sister likes, I'd definitely recommend it for adults and older kids.", "I got one for christmas, and this one is for my wife.", "We love them, and such a wonderful deal for the money.", "Neither of us truely needs an Ipad.", "I got even a better deal buying it on sale.", "Sometimes the 32gig might be nice to load even more on, but that is what the cloud is for.", "I have not even come within 5 gigs of filling this one up.", "Its the perfect size for us.", "This is my first kindle and I am enjoying it while learning how to use it.", "Really did not know if I would like it or not however, the more I use it, the more I like it.", "So far I am loving my Kindle Fire HD.", "I am super-happy with my Kindle Fire!", "This was a gift from my husband, and after only a couple of months, I cannot imagine going without it.", "He opted for the &#34;no-ad&#34; upgrade, so I can't tell you anything about the advertisements other than I don't have any.", "It also came with a one month free trial of Amazon Prime; which we are continuing for the next year due to the convenience of ordering and FREE two-day shipping on just about everything.", "I will more than make up the $79 just in shipping savings alone.", "Amazing!", "Love, love, love this Kindle and Amazon Prime!", "!", "My daughter has had a Kindle , and a Kindle Fire HD for  months, so she told me to try a Kindle, because she love both of her Kindles, I ordered one, thinking I would not like it because what had happen wit the other unit I had.I have had it for about 2 months, and I think I have used it every day all day since I have had it.", "I LOVE MY KINDLE FIRE HD.", "Kindle Fire HD is so great!!", "I don't really like the ads, but I didn't want to pay more to not have them & after you get used to it they are not that bad!", "Dont get me wrong.", "I love the Kindles!", "I have the original kindle fire and love it!", "Gave it to my granddaughter last year.", "Tried to replace it with the HD version, 3 strikes.", "Meaning I bought 3 and have returned 3.", "I am doing this review on a galaxy tab but hope to replace my beloved kindle one day.", "Thats why it got 3 stars!", "Also, amazon, how about giving me one of those new HDX versions?", "I will test it out for you!", "I was hesitant to purchase this Kindle Fire HD as I have a Kindle reader.", "This has been thebest purchase I have made.", "I still use my reader but even my husband uses the Kindle Fire HD.I would recommend the Fire HD to everyone.", "Other wise its reasonable and ready to use...", "If you do, don't.", "Ice cream sandwich looks and works great.", "Silk is good but you can use other browser.", "This device works with flash and you have a ton of apps to choose from.", "I got annoyed with finger prints and smudges that I had to get stylus.", "For the features, you get plenty of bang for your buck especially if you are an Amazon fan....... As for the ad complaint, it takes 1 second to unlock/swipe.", "It isn't a big deal at all so I am surprised to hear complaints.", "You would think that there were constant pop ups and 30 second forced commercials to watch.", "Not worth it to take off ad unless you need that one second.", "Even if you pay to take it off, you still have to swipe to unlock so you don't even save one second.", "Great unit for kids or family.", "must get the cover to make it easy to stand.", "My kids use it all the time and I can control the content.", "In the comfort of my bed, I can do almost anything.", "That would be the only thing missing.", "I bought my Kindle Fire HD about a month ago.", "I was so happy with it, and quite honestly just sick of having to share it, that I ordered a second one for my husband.", "It arrived on Monday, and my husband is enjoying if very much.", "I'm happy as I no longer have to share.", "We both have computers, but the Kindle Fire is just perfect for curling up in the lounge chair or outside by the pool.", "We're really looking foward to taking the Kindles with us when we travel.", "I can see us now on the deck of a cruise ship, Kindles in hand.", "We'll be two happy old people.", "The reason I choose a Kindle product was due to the great customer service Amazon always provides.", "I also have a Kindle Keyboard and had to make a lot of calls for customer service.", "Each and every rep. was always very helpful and kind.", "Buy a Kindle Fire (or two) and you won't be sorry.", "Will be even greater when I learn ALL about it.", "A FREE manual should be included with them.", "They are not easy to learn and you pay enough to get a free manual included in the box.", "There return policy time was up.", "I upgraded to this from a Kindle Keyboard.", "So far, I love my Kindle Fire--EXCEPT for one thing.", "This makes it really hard to find particular books in my collection.", "I tend to read 3-4 books at the same time, switching back and forth, so this is a real issue for me.", "I would give it 5 stars except for this one problem.", "I can't see why Kindle Fire can't have the capability to organize downloads into manageable collections like the older, less sophisticated models.", "Otherwise, it's super and I've having an absolute blast with it.", "We bought this to use as a distraction tool for when our son goes for a hair cut, starts acting up at a restaurant, or needs to be calmed down.", "We also bought it so we could download apps such as Pandora, which he listens to all night while sleeping.", "The quality and sturdiness are great.", "Wanted primarily a reader as I have an iPad already.", "Love my iPad and won't give up, but the weight of the kindle, clarity, and it's easy to order books from amazon have made it a favorite.", "Slips into purse nicely and not heavy.", "I love it.", "I love it, loveit,love it!!!!", "Perfect choice for our family in these economic hard times.", "It is our tech gift to ourselves for the year.", "Perfect compromise for the money.", "My first &#34;Tablet.&#34; Intially purchased as an E-Reader.", "Then I discovered the device does so much more!", "And I've only scratched the surface!Since I've never owned or used a Tablet before, there was a little bit of a Learning Curve for me, however, it has not been difficult.", "Initial setup was a breeeze!", "Connecting to my wireless network was simple.", "Battery life is 10-12 hours, screen brightness is excellent, sound quality impressive, touch screen responsive and has smooth performance with the Apps I use.Be aware, the Camera image quailty is weak and the no charger is included, however, I still give the Kindle Fire HD a 5-Star rating as it has exceeded my expectations for which it was purchased!", "I purchased this for my granddaughter and she loves it - takes it everywhere she goes.", "I really think what she loves the most if the music through the cloud.", "I have purchased several cds through Amazon for her and myself and they are on the cloud so she takes it with her and plays it in the car or just about anywhere we go - she likes to watch netflix on it and of course play her games and read.", "A Big Hit.", "Between our personal laptops and our smartphones, I can't really figure out why I would ever need a tablet.", "I have an iPad3 and only gave the first Kindle Fire a casual glance before ruling it out.", "So far I am quite impressed with it.", "I have the version with ads and find them insignificant.", "The device does lots of things I probably won't use, but I am very happy with my purchase and would recommend the Fire HD to anyone.", "I also bought the Amazon leather case which is another great product and adds very little weight.", "Love my Kindle Fire HD am so glad I bought it.", "I arrived quickly and in good shape.", "No problems getting around it it.", "There are alot of avertisements but I can live with them not worth the $25 to get them removed to me.", "I will use that money for others things for my Kindle.", "To say that I am delighted with my Kindle Fire HD would be a dramatic understatement!", "That said, it works well; and it meets my needs just about perfectly..This device was a gift from my wife; and I could not be happier with it ... or with her!", ":-)I would buy it again in a heartbeat!", "The options at the top are awkward to maneuver and there are functions that are simply not intuitive.", "However, I still love it.", "It's such a convenience to be able to get my email while reading a book.", "I moved from the E-Reader to this.", "Big jump but worth it.", "This is our first tablet and so far we are very pleased with it.", "Time will tell.", "I was surprised that it didn't come with the charger and it didn't come with a book to guide you along and help you learn about it.", "Since doing while reading is how I learn best it is taking me longer to figure out some of it.", "But once I ever figure it out I think I will love it.", "We bought this for my daughter for Christmas and she loves it.", "My son, now wants his own.", "This is amazing.", "First of all, I have to comment on the fantastic shipping.", "I bought it Friday afternoon with standard shipping, and it arrived Monday.", "Amazon has great service.", "Now to the KFHD.", "I love it!", "Everything works so well on it.", "I get tired of people comparing this to the iPad.", "It is not an iPad, therefore it will not do everything an iPad can.", "By the way, I do not find the ads intrusive at all.", "An ad when you turn it on is not a big deal in my opinion.", "I can't compare this to the original Fire, as I don't own one.", "Someday I will probably upgrade to an iPad, but for now this is perfect!LOVE KINDLE FIRE HD!", "I purchased this for my son, his computer quit working and he was looking for something new.", "He loves it, he can pretty much do everything that he needs to without having a big computer and can carry it around with him.", "In the past year or so I have found myself addicted to Amazon so when someone offered this in trade for an item I had for sale on Craigslist I thought what is there to lose.", "Kindle Freetime was a big plus, my daughter is quite the fan.", "She likes the freedom of doing whatever she wants, I like not having to look over her shoulder.", "Battery life is great, and streaming via the microhdmi slot to the television with Amazon Prime is really nice.", "I am a huge critic of these type of devices and this one has won me over.", "Great job Amazon!", "You would have to be crazy to spend over $130 MORE for LESS in an iPad mini!", "I have enjoyed my new Kindle Fire from day one.", "It is fun to have.", "It make you not to want to put in down.", "It try not to stay on it too long because it take me away from my hosuehold chores .", "It will keep you spell bound, All of the things you can learn and do with it.", "It is way better than the Kindle I had before.", "This Kindle is like having a walking computer, VCR, DVD Player and Television right at your finer tips, and you can carry it with you every where you go.", "I love when I go to the doctors office.", "Thank you so much.", "I have not learned all of the feature yet but I am working on it.", "Thanks.", "I really enjoy my Kindle Fire hd 7\" tablet.", "I agree with many of the accolades mentioned by other reviewers.", "The purpose of my review is to draw attention to the inability to increase the text size of text on web pages.", "I have added a customer image of a side by side comparison of web pages with my smaller smartphone and the Kindle hd.", "The text on the smartphone is considerably larger and easier to read than on the Kindle.", "I often find myself reading the internet on my smartphone instead of my Kindle for this reason alone.", "Hopefully if this gets enough attention the developers will add the ability to increase text font size.", "Otherwise, very pleased with my Kindle Fire Hd.", "this thing does everything i want it to do and then some.", "Big advantage there in temporary power outages", "Kindle Fire and accessories were a perfect gift.", "My wife loves it and will reserve her old Kindle for a back-up or in locations where she would prefer to not take her Kindle Fire.", "This is so much fun.", "I'm remembering all the times I carried a stack of books weighing 15 pounds.The Kindle is light, compact and perfect for my reading needs.", ".", "It was a step up from my paper white and I was super impressed, it does everything I would want on a tablet type electronic device, but, I needed to have the convenience of the 4G.", "I travel around a little and I am going to send this one back and upgrade to the Kindle Fire HD 4G.", "I didn't think I would like reading on it, but once I tried it, I was hooked !", "It is SO much handier than reading a regular book !!", "I did a lot of research, comparing various tablets, before I bought the Kindle, and all in all, I am thrilled with it !", "I bought the fast charger & I would highly recommend it to anyone too impatient to wait for it to charge.", "You can use the Kindle while it charges, of course, but it's easier to use it when it's not plugged in.", "!", "This thing has so much more, though.", "Really like this product.", "It is OK for sending pictures of the user (but don't want to do that), but very awkward if you want to take a picture of anything else, a feature that would be very useful.", "It is almost impossible to peek around it and see if you are focused outward to get a picture of what you want.", "Pretty much useless for that.", "I love my Kindle, but I was surprised to find it came with NO instruction manual.", "I'm fairly good with technology, and I don't often read instruction manuals, but a quick-start guide would be helpful, showing some standard icons and what they are.", "I had a little circle with a number by my name for 3 days before I figured out what it was (notifications) or how to view them (swipe down from the top).Aside from the lack of information, I've been very happy with my Kindle.", "I like the anti-slip rubberized coating on the back and I find it to be very well-made.", "I wish the power and volume buttons were a little easier to find though, they are very smooth on the edge and I can't usually find them just by touch.", "I love this new Kindle.", "The Text reader voice and recognition have been improved and will encourage me to buy more books.", "I do wish there was a snooze timer or an application that would let me set the reader to turn off closer to when I drop off to sleep.", "That would give access to navigation information while traveling.", "This device can be almost all things to all people.", "We enjoy the Kindle 7hd.", "Within the first day, the tablet locked up.", "I contacted Amazon and two days later, I had the replacement with no problems.", "Amazon backs up the sales and service remarkably.", "I cannot think of any company that provides better customer service and satisfaction.", "I ordered my 16 GB Kindle Fire the day before it was released and chose one-day shipping.", "It is very easy to navigate.The display is crisp, clear, and bright.", "The web browser makes sites easy to view.I was pleased to find out that my previous Kindle purchases (I \"purchased\" free Kindle books via the Kindle app on my iPod Touch) were already available in the cloud.Today, I bought some magazine subscriptions on my Kindle Fire HD.", "Facebook looks amazing on my Kindle.", "I am disappointed that there is no Tumblr app on the Kindle Fire HD, but I can view Tumblr just fine in the Silk web browser, so not much loss there.", "And I am pleased that Skype is on there.", "I have an unlimited U.S. landlines/mobiles subscription with Skype, so this comes in handy.", "The sound quality of the Kindle Fire HD makes Skype a joy to use on there.The only thing that disappoints me is the fact that Amazon's OS is a stripped-down version of Android.", "I would give this review six stars if Amazon allowed you to run the full Android experience.", "There are some Android apps which don't work on the Kindle, and some of these apps are among my favorites such as Tumblr and CSPI's \"Chemical Cuisine\".Other than that, I am pleased with my purchase!", "One problem I incurred was that I like to read directions and would like a manual & not have to type a question to Amazon.", "I'd rather look through a paper manual  & mark it up so I can learn on my own time & highlight what I really need.", "It took awhile to learn how to get into my library to download e books.", "Also have trouble with answering emails and putting emails into one of my folders.But the convenience of reading emails, reading anytime night or day etc.", "is fantastic.", "My primary reason for ordering the Kindle Fire was simply to have a built-in lightedscreen for reading at night.", "It was perfect!", "I also enjoy listening to relaxing musicwhile reading.", "I am very glad I ordered it, and woulddo it all over again!", "I tend to research things a lot before buying them.", "I waffled back and forth between this and the nexus 7 for a while, but eventually I went for the KFHD 7\" 16GB tablet because I am a Prime member and wanted something that would stream instant videos from Amazon.", "My receiver had a free HDMI port so this worked out well for me.", "I have a dual band n router which works wonderfully with the KFHD.", "I haven't had a movie drop or skip yet.", "I have played some online games on this and have yet to get the boot or experience much lag.", "It's great for books.", "The battery life seems slightly better than my wife's old KF.", "My mother in law let me use hers for some time and it is a sweet device.", "In the end, if it wasn't for the prime membership and streaming content you can get with the KFHD, it's no contest.", "The Nexus 7 is better.", "However, for me the KFHD does what I want better than the Nexus 7 would do.One star off for the crappy processor and borked/forked version of ICS.", "I hope they end up releasing a forked version of JB at some point.", "It really is that much better.", "I already have a Kindle Fire HD, so I decided to get one for a friend of mine for his birthday.", "It disappeared when it arrived.", "A month later, my neighbor said he was sorting thru packages he had setting in the corner, and notice something from Amazon.", "When he picked it up, it was addressed to me instead of him, so he rushed it over to me.", "I called my friend, and told him about it being here, and he came over and we got it registered (it had been deregistered because we thought it was stolen) and set it up for use.", "Now, he cant stop using it.", "He absolutely loves it.", "The HD has more going for it than anything  I have seen.", "I enjoy the apps available, the quickness in getting what I want placed on the Kindle, and how I do not have to worry about checking my email or Facebook when I am away, because I have my Kindle to do that for me, when I take it with me.", "So many great features, I cannot begin to describe them.", "And all a plus.", "I love mine, and he loves his, too.", "It was his birthday present, abit late, but he finally got it.", "Thanks, Amazon, for helping me with my problem of trying to shut it down ( I called it in as stolen, so when I called back and told them it was found, they were as delighted as I was to hear the great new, and they went thru the registering process with me since I registered it in my name for him).", "I would highly recommend this to anyone, and everyone.", "I am very happy with my kindle fire hd.", "It does everything it is advertised to do.", "I did not completely understand the Kindle/Android opperating system when I first purchased it.", "I was under the impression that I could load any android app on the kindle, but found out quickly that I could not.", "I would just advise people to do their research before they buy.", "One thing good about my purchase was, I only paid $129.00.", "I bought the kindle at Fathers Day for $179.00 and signed up for an Amazon/Chase credit card and got a $50 gift card from Amazon which I was able to use for the kindle purchase.", "I like the convenience of the Fire.", "I bought this for my wife (and me of course) as she has 'user' issues with our laptop pc.", "There are many things i like and dislike.", "I am comparing with the regular kindle fire the very 1st edition.1.", "the hd is amazing.2.", "the carousel when you first use the kindle hd only has like 10 of your purchases instead of the entire list of everything you purchased.3.", "it is lighter.4.", "it seems to be more organized.", "I love my Kindle Fire HD 7\".", "So I sold that and bought the Fire HD for myself.", "It has been great, working perfectly.", "(I also highly recommend the official Amazon case)Amazon Kindle Fire HD 7\" Standing Leather Case, Onyx Black (will only fit Kindle Fire HD 7\").I just got back from a trip to Ocean City MD and the wifi connected instantly once I got the login straightened out.", "I have everything I want on it.", "It is really one of the best tablets for the money available at this time.", "This Kindle Fire HD does just that.", "I also like reading books on my new Kindle Fire HD.", "There are a few improvments.", "Love everything about it so far.", "Well done!Update 5-10-13.", "I have had my new Kindle Fire HD for 2 weeks now and I love it even more than ever.", "I totally love everything about it, in fact I have zero complaints.", "I am so happy with it I could almost jump up and down!", "I am thinking about buying the bigger version of this Kindle Fire HD and selling my ipad!", "The little Kindle Fire is one  the most usable small computer available.", "It works on all my applications thus far and is with me daily.", "Would recommend it highly.", "Boyd", "I spend a lot of time in waiting rooms, and kept several books in the car to rotate through as needed.", "My mother has the original Kindle Fire and loves it, so I figured what the heck.", "Fits in the purse nicely and lasts as long as I need it.", "I couldn't ask for much more, and I'm very happy with it.", "Keeping this short and sweet .... the product is fine for the price.", "Perfect for someone who only needs basic functions.", "My wife says she loves it !!!", "I like the Internet connection (to check our email) and the fact that the instant you you open it its ready to go!", "Virtually, no boot time.", "Seeing that I don't even have a smart phone, I was amazed!", "I bought this for my wife's birthday.", "We couldn't be happier!", "Other than that, best purchase ever.", "I like the look and feel of a regular book, however, I now realize this method of reading is the up and coming way to go.", "This product has many features I have not yet used and am looking forward to nailing the many applications available.", "No muss no fuss with this appliance.", "Bought this for my fianc&eacute; for Christmas & he loves it.", "It's his first tablet & he hasn't put it down.", "It's small but large enough for his self described \"banana fingers\" to navigate & the sound & screen resolution are awesome.", "The only drawbacks is that some apps aren't available yet (ex: the @TV app) but I'm hoping more will be available soon so that this tablet will compete more closely with the iPad.", "Despite spending 6 hours and 2 telephone calls to robo-customer service (they no nothing if it's not on the piece of paper they are reading from!", "What is needed is the ability to type in a special code from my router to the Kindle so that my router knows to let it into the network.This device could find the networks just fine but would not connect.", "Going to get a Samsung Galaxy Note instead.", "From the minute I opened the box I was in love.", "It is very sleek and the screen is perfect for my viewing as well as my daughters small hands.", "I borrow books from the my library without any problems and we recently watched our digital copy of Oz The Great and Powerful.", "I love my new Kindle, I'm very new to it and have a long way to go to learn all the things I can do with it but now I don't have to leave the TV room at night if I want to sit and play a game on my Kindle and watch TV at the same time.", "I like it since I can transfer music to listen and download also.", "pretty nice and convenience.", "I bought it for my wife and she just loves it.", "Of course it is sponsor and ad centered, but I knew that.", "I love how much she appreciates me getting it for her.", "Fits in my hand nicely.", "All the functions work well.", "The email was painless to setup and that makes my life easy.", "What I do not like is that I cannot delete things on the desktop that I do not want.", "Could be operator error but it is annoying and surely an issue for those that desire a clean display.", "All around good tablet.", "Everything is stream unless you download.", "Which is great but don't plan on downloading much if its HD.", "Operation takes some time to getting use to compared to Android and Apple OS but once you get the hang of it, its not bad.", "First let me say I love Amazon and have been a loyal customer for 12 years, back when all they sold was books.", "They have always had the best customer service.", "They got this one wrong though!", "I have seen a bunch of reviews where the Kindle starts to lose battery life in less than a year and I can definitely attest to that.", "I think they should offer to fix it for free.", "It's like recalling a car.", "That thing works well by the way, but both devices take forever to charge to make a 4 hour flight.", "I bought this tablet a couple weeks ago, and I'm absolutely LOVING it.", "I've never owned or used a tablet before, so it was very exciting for me.", "The only negative thing I can say is that it feels delicate - I feel like I have to practically hug it when I move it around.", "I'm waiting on my protective case to arrive and that problem should be cleared up.", "I'm probably just paranoid about my new baby, though!", ";)If you're thinking about buying this - DO IT!", "It's absolutely amazing.", "You can't beat this for the price, especially as a Prime member.", "This is primarily for our son and he loves it.", "I considered the other 7&#34; tablet options, but kept coming back to this one.", "I wish it was easier for family members to log in or out and only require a password when logging into a profile.", "I have a $700 Asus tablet, and and I like this Kindle better.", "This is perfect for their everyday Internet needs.", "While they sometimes seem confused I have to say they have never complained about it and they always have it near them.", "Very nice.", "Sound loud would like better control...button does not seem to adjust.", "Would be nice to be able to access Netflix & the New York Times as I have home delivery & do not want to pay a second access fee.", "We love the HD version of the Kindle Fire.", "In fact, if I were to complain about Amazon it would be t say that they should honor a lower price within...say a 30 day period for fheir faithful customers.", "Oh well.", "Like we said, its a great item & yes we would recommend it to all.", "This is a nice one as its my first and love the ease of it and the sizeis not so big as the other ones my friends have is not easy to takewith you in my opinion.", "Hey, what more could you want.", "It works great.", "Love the display.", "Made a great gift.", "This means it pretty much works right out of the box.", "So i bought this for my fiancee an I because were always fighting over the iPad.", "I am in awe of this device.", "Great job amazon.", "I love my iPad but i think i love the Fire HD more especially the price point.", "Keep up the great changes!!", "!", "I don't regret the decision but my next purchase will be the nexus.", "I don't like scrolling through each content one by one.", "Overall it does what I bought it to do.", "I was also happy to see that it arrived partially charged so that I could play with it a little right out of the box.", "Purchased this for my 13 year old daughter as an X-mas gift and she likes it very much.", "I'm not happy about the advertising though.", "It gets a little annoying, daughter thinks so too,  and haven't figured how to get rid of it.", "You can pay for the removal, which I thinks is a little excessive, but I cant seem to find out how to do that.", "I went to the help site and followed the instructions but it didn't lead me to where i need to go.", "Ill have to sit down with it when she gets done playing with it.", "Would it really hurt to include a cheap unit like this?", "Also didn't see any options for wallpaper.", "It has to be there but currently its the add's.As we get the chance to play with it again I'll post another update.", "But for $200.00, this is a pretty decent tablet.", "We already have a first generation iPad and I wanted to get my wife something that she could use primarily as an eReader, but there was no way I was going to pay for another iPad.", "Too expensive.", "This works perfectly and has just the right amount of functionality that she needs.", "The quality is generally very good, and if you find the right deal, it is a bargain.", "This technology changes so quickly that it makes little since to sink much money into one of these.", "I've purchased several of these, all were gifts, but everyone has loved them.", "The image was beautiful.", "It fit so easily in my backpack or purse.", "In addition, it could not have been any more intuitive to use.", "Absolutely fabulous.", "I upgraded from KF to KF HD with more Gigs.", "I rarely use my desktop computer anymore.", "I do find that some of the android apps on KF are glitchy compared to those on my i phone but tbey are different products and I Recommend this product.", "I've had this in every generation.", "I buy these as gifts.", "The platform is great.", "Our house shares one Prime membership...obviously.", "But really?", "We have five Kindles and they can't afford to loan more than one free book per month?", "How much $ do they need to make from us?I highly recommend the Kindle.", "The little complaint about one loan per Prime membership is not a biggie....", "KINDLE should have NEVER removed the HDMI  output...or at least offered a indle that still had it!.", "BAD decision just to mke it smaller.", "A 7&#34; kindle is just fine.", "dropping the weight by a few ounces doesn't make a difference.", "..especially when you remove the HDMI feature.", "I've only used this device for a few days but so far it does all they said it would.", "We have different types of devices from the fruit company to the alien looking character.", "This being based on droid, I like the fact that it works seamless with the Amazon services and can be secured for the kids.", "I wish there was a bit more control for the kids, a bit more granularity.", "I was skeptical about this product as the &#34;touch&#34; technology has been spotty at best.", "I have been learning my Kindle and with the help of Amazon have learned how to navigate this new Kid in my home.", "Now if someone could recommend a name for this new member of my life?", "Yes, I name everything!", "My daughter gave me this wonderful gift for my birthday and I love it!", "I've had the original Kindle for a couple of years and it has been a constant companion, so this has been an upgrade for me.", "Probably because I am 71 years old, I am not as quick to figure out how to do some of the things this Kindle can do... but the Kindle Help people are so wonderful that when I call them, they walk me through whatever I'm trying to do.", "There is no way to create collections for my books.", "They is no way to indicate which books you have completed.", "I literally have to charge it every day.", "And with the charging cables I received or bought not working, it is incredibly annoying.", "The email option is also nice.Since I got it more for reading my books, I wish I had kept my old Kindle Paperwhite and not given it to my husband.", "I got this for my husband ...he had a nook and he LOVES LOVES LOVES this Kindle.... he reads all the time and this Kindle is great for that obviously and he even plays a few games on it.... Really enjoys it... Great value.", "Gmail contacts, once on the kindle will not allow you to edit contacts.", "Work around is to use web site google gmail and then contacts.Also contacts will not sync.", "Unless you want to download to your phone and then figure out how to get on computer.I'm really surprised, after trying it out the Fire (and most tablets are just social devices) I have four friends who have a Fire and a wife who has one.", "That's ( in my opinion) is pretty much its usefulness.I contacts support about six times, three out of six the tech stopped in the middle of our discussion and said they had to go get a Fire to see what my problem was.", "In the end, as far as contacts are concerned, you can not edit contacts that were not entered directly into the Kindle contact app.I guess bottom line is that I'm really disappointed by this whole business.Now I return device and wait 2 to 3 weeks for my refund I'm told!", "I purchased 2 for my daughters (16) and (8) for Christmas.", "They love them and use them every day.", "They both read more because they can read on the kindle.", "Add Amazon Prime and it provides hours of entertainment.", "I'm very happy with the purchase.", "Easy to use, and does so much more than my older Kindle.", "I used the same water/sand proof plastic cover that I used on my early kindle at the beach.", "Readable even in the sun, although not as good as the old Kindle for reading in direct sunlight.", "Otherwise tons better.", "Ive had my Fire HD for 18 months.", "I'm fairly pleased but won't likely buy another Kindle since there are so many annoyances with this one.", "It's- sluggish- the feature-clipped OS is missing some essential things (like folders!!", ")- many apps available for other devices aren't available for kindle- clumsy navigationThere are things that i really like compared to iOS.", "I hope those are available with mainstream Android devices and not just features added by Amazon.", "I expect Amazon is much more about narrowing functionality than expanding  it.Bottom line: I cannot recommend the Fire HD (and am therefore very suspect of the HDX. )", "It doesn't seem the Amazon's mission is to provide an exceptional device ... they sell stuff, they don't build stuff.", "I really miss some of the features of my old kindle, like how easy it was to read outside.", "I don't treat my electronics very well and my kindle takes it very well.", "No problems with being thrown in purses and backpacks.", "A lot of the apps that I want are not available.", "It overheats sometimes and has a lot of moments were it completely spazzes out.", "I love my kindle, but there are quite a few things that I wish amazon would fix.", "The refurbished  kindle fire Hd with Dolby audio that I recently order is great.", "I love my Kindle Fire HD.", "I think it totally stupid not being able to.", "But over all, I love it, esp.", "Compared to the cost of an ipad, there is no comparison!", "It's responsive, quick and light.", "The beveled edges allow me to hold it well and yet I'm not concerned about it slipping.I'd like a bit more control over content.", "Mine seems to be greyed out.", "Perhaps that's a setting.", "I'd also love the cloud to be more flexible.", "Allow me to use the cloud for syching across devices for items I own and load personally.In general, it's a great product Amazon.", "I received my Kindle Fire HD as a Christmas present.", "I already had an older Kindle which I just love.", "I haven't used the camera much...yet.", "After playing with my 7\" HD  for a few hours I have to say that I love it.", "After reading the concerns about the original Fire I decided to wait for the \"next\" version and I'm glad I did.", "The processor is snappy, I haven't experienced any lag with loading videos, opening books or playing apps.", "Books are easy to read and i love the \"text-to-speech\" option.", "As a typical Amazon Prime user, I have another tablet, but not the Kindle.", "When an offer of a Kindle came at a good discount, I bought the 32-GB model.I am not disappointed.Pro:Came with my info already loadedEasy to useAmazon Prime!Also add Hulu, Netflix, SkypeCon:As an iPad user, I had some difficulty with the tablet -- from me, the operator.", "It's not a desktop/laptop, so don't expect to be massively productive.", "The 7\" HD screen is beautiful and has not much of any glare issues.", "For $200, you're getting a lot.", "People will compare this to the iPad, which I cannot do as I don't own one, but I'd imagine that if you want to do more with a tablet, spend the extra $300+ and get an iPad, otherwise, if what I listed is all that you're looking for, don't spend the extra money and buy the Kindle Fire HD 7\".", "The concept of value is different from person to person, so be objective when comparing this device with the iPad (and other tablets) and just know what you're looking for and what you can afford.", "The pros and cons from other reviews are pretty accurate, for the most part with there being some exceptions, so I wont bore you with what I see as pros and cons, but as they say, where there's smoke, there's fire.", "It was the Kindle Fire HD or the Nexus 7 and we are big Amazon users so I went with the Kindle Fire HD and I am so glad that I did.", "I love it.", "It is easy to use and has a lot of great options.", "I can connect with my local library and get free e-books that are for the kindle with no problem.", "I bought a Kindle HD Fire a month ago for my daughter, hubby, and their eleven month old son as a Christmas present.", "In that time, I loaded the Kindle with kid-appropriate games as well as adult apps like Frogger etc.Now Christmas is over and I had to Give.", "It.", "Up.", "ARGGGHHHH.", "I miss the thing already.I've never owned an Ipad so I can't compare.", "But I loved the Kindle Fire.", "It was worth every penny the device cost to see the look on his face.", "My daughter wouldn't hardly give it up either.", "Then my son-in-law!", "Great for kids!Don't pass this by.", "Highly, highly recommend.", "Maybe it isn't 'as good as' an Ipad.", "I don't know.", "I just know this was one of the best gifts to them ever.But there is one problem.", "Now I don't have one, LOL.", "So guess what I buying now :)", "I am not here to bash Amazon.", "I am a prime member and I own a few Amazon e-ink kindles which I love.", "This is a review about a single Amazon tablet.I bought the 1st kindle fire and returned in within 2 days.", "I thought this one would be different in terms of the user experience.", "Its not.Is it an improvement over the last tablet?", "Yes.", "Does that matter?", "No.I feel like I'm borrowing Amazon's property.", "Its cold and bland.", "A pure content consumption device with no ability to personalize it.", "AT ALLFrom the moment you turn it on your are steered in the direction to Amazon's content.", "After a while it gets really annoying.The ads and recommendations are everywhere.", "Why can't I turn them off?", "The item arrived in time for Christmas.", "Now all my children have a kindle.", "Having purchased an original Kindle Fire I was looking forward to this new release and was not disappointed.", "I liked it so much that I passed the original on to someone else.", "I love everything about the kindle fire hd got it as a christmas present for myself and for my wife and what can i say it does it all so happy and pleased with my tablet will recommend to anyone.", "Amazon has the best customer service around also which makes it that much better.", "If your undecided about this product let me assure you its awesome!!", "by the thousands .", "If this tablet could do my dishes i would have 3 of them !!!!", "And the  fair price this has makes it the best tablet for the money BAR NONE !", "Amazon hit it out of the park with the kindle fire HD .", "we've had no issues just loads of enjoyment might have to get the 8.9 just so we don't have to share this one .Affordable tech.", "that's what i like about this Amazon good job thank you !", "check it out their unbelievable !!!!!!", "!", "Everything is built on the Amazon store.", "It fits in my jean's back pocket!", "i like my kindle, i purchased one for my mom and another for my dad.", "Im an iPad user and i think i prefer my ipad because it has many more features.", "I just think it needs a little tweaking.", "While the tablet is nice, and well constructed.", "The Kindle version of Android was just too limiting.", "Sent back to get a Nexus 7", "I have 2 Samsung tablets at home prior to purchasing this tablet for my daughter.", "I tease her that I will take it away since it is so much faster in some aspects than my Samsung.", "No regrets in purchasing and will be buying another for youngest daughter soon.", "I have enjoyed the certified refurbished Kindle Fire HD, it is everything I was hoping for and more.", "Normally  I would not recommend certified refurbished item to any one, but this has made me reconsider.", "It is a great unit.Thank you amazon.com", "Bought this for his birthday to use with his mp3 player in the truck.", "He uses it ONLY as an audio book player so far but likes the idea of having the Internet available when Wifi is handy for emergencies.", "He spends enough time in his truck or his mancave playing with this now!", "I've looked through it a couple times and can see where it would be handy on a vacation.", "And I have the newest I-Pad and a Nexus 7 , the Kindle has a great sound and picture!", "I am getting older and the eyes were going.", "Now I just grab my Kindle and headset (if audio) and I can sit in the doctors offices and not worry about the wait.", "I would recommedn anyone that has cataracts and/or wants an easier way to read to buy a Kindle!", "I'm extremely happy with this purchase.", "I did some shopping/investigating prior.", "I'm glad I settled on the Fire HD 16GB w/adds.", "Top down - class act.", "Amazon hit this one out of the ball park!", "Oh, and the \"ads\" pose absolutely no problems, I don't even notice them because they are only on the start-up.", "NBD", "This \"Certified Refurbished Kindle Fire HD\" is a good value for the features and functionality.", "We own two of these, two of the original Kindle Fires, and another of the older Kindle readers, so have some experience and expectations with what this should do.", "I bought this for my sister and she just loves having everything at her fingertips.", "Great buy!", "This was a perfect deal ... and I have had good experience with other Amazon Refurbished electronics, so I had no qualms about ordering this one.", "In fact,  this was/is my second exact tablet within 3 months of each other.", "Maybe one will be a gift.", "i bought this refurbished kindle after having a horrible experience with amazon customer service.", "Do not buy from their warehouse deals-they will not honor warranty or replacement.", "however , if you buy a refurbished kindle hd for a little more they will.", "i love this device!", "highly recommended!", "I am a longtime kindle owner.", "I read constantly.", "I bought this for my daughter who reads a lot, too, and is pretty conservative moneywise.", "I got this so she could stick it in her purse and read on the bus going back and forth to work, afterall I have 1500 books she can load and read with no cost involved.", "this is a wonderful thing.", "I told my daughter it is Christmas/birthday this year, maybe next year, too, since she had a &#34;cow&#34; about the money.", "I consider it one of the best investments I have made for a long time.", "if you have a family member who does not have a kindle, just get one for them.", "you will feel really good, I promise!!!!", "!", "She loves this product have never seen her this happy with a new toy ,She had an older model kindle and she says one is head and shoulders above the older version.Yes she recommends to all her friends and family", "I debated a lot about buying a tablet, and have wanted an Apple iPad ever since they came out .", ".", "But the predictive text choices have come in handy!", "I drove off with my last Kindle on the roof of my car.", "By the time I realized it I went back, and it had been run over several times.", "Held up pretty well actually...except for the part that it was dead.", "I was going to buy a paperwhite, but decided on the Kindle Fire HD.", "I love it so far, but it's only been a few days.", "Our iPad gets really slow from time to time.", "I've heard it's an issue and have tried everything I find on the forums, but nothing works.-Kindle let me set up MS Exchange Mail in about 30 seconds.", "At $200 it's almost disposable, while the iPad is still crazy high.", "Love the iPad, but this device is truly amazing, especially if you like Amazon...which I do.I like Apple products, but I'm actually kind of burned out on their attitude; Apple and their enthusiasts still act like their products are beyond reproach.", "Probably time to wake up.", "This Kindle took a lot of getting used to from my 1st gen.", "This Kindle orientation is sideways unlike the 1st one which was like a book.", "I've gotten accustomed to having the web on the go with the free 3G service, however the HD doesn't support it so boo hoo hoo.And how is it possible for me to buy a book yet I cant download a video nor a game because its not offered in my geographic area???!!!", "!!!WHAT!!", "!Because Iove to read in bed the back-light feature is awesome.", "I JUST LOVE IT", "I received the original Fire at the end of July when I won it from a site.", "I decided to upgrade it to this one last week and boy oh boy am I glad I did.", "This one seems to run much smoother for me.", "Especially when using the menu.", "I used to always double tap it thinking that it didn't recognize my first tap.", "I love swiping this Kindle to get to the menu.", "I consider it worth the upgrade.", "I also have the Amazon case and LOVE IT too.", "I purchased this on a recent Amazon flash sale for $89.", "I didn't think I would like reading books on a backlit screen, but it's actually quite natural.", "The Fire HD functions well in all the ways I use it.The only cons I have encountered (as someone who has primarily used Apple mobile devices) are the high number of redundant apps, many of which are spammy.", "There are also some notable apps missing (Instagram, YouTube, Google+/Drive/Maps/Picasa).", "Most of these things can be accessed through the web browser though, so it's not a huge loss.", "I've only had the device for about a month so I'm sure I'll find the best options for the things I'm looking for.", "I love this device.", "The Kindle Fire allows for wide range content to be put on it.", "Much of the content available on the Kindle is free.", "I would definitely recommend this device.", "I love the design on the kindle fire hd.", "The only thing that disgruntled me about the product is that I don't have access to the wide array of applications on the Google market, but I am sure a in some time the apps will migrate.", "I loved the 1st Kindle Fire and was thinking of getting the new Kindle Fire at 159.00 but i decided on the Kindle Fire HD 7\" instead.", "One complaint is the flash doesn't work on some sites.", "I only use it for 2hours at a time but there is always 85 to 90% left after i use it.", "I am extremely happy with my new Kindle Fire.", "It makes reading so much easier.", "I loved it while I was on the plane.", "I find that I have been reading more since I go it.", "I bought one of the earlier model Kindle readers some time ago and its been trouble free, but after my grand daughter showed me some of the really neat things she could do with her Kindle Fire HD, I decided what I wanted for a birthday present.", "My daughter loves this.", "She had the kindle fire, but is loving the HD.", "She says the images are better.", "The camera was the main reason for this purchase.", "Now she can Skype with her grandparents who are a few thousand miles away.", "Aside from a few minor improvements that I think could be made, this is a terrific product for travel.", "I purchased the Kindle HD specifically for an international trip intending to load a travel guide and some other reading material on it (and so reduce the size of my pack).", "I'm generally stick to Apple products but I was uncomfortable with taking something like an iPad on my sort of travel (lots of hostels, hiking, ocean).", "I traveled for several months some time back with a netbook and this was far and away a better experience.", "Relatively light, thin, and easy to cart around.", "My only gripes: I can't rearrange the app icons to suit my preferences, I have to fumble about a bit to find the power button when I want to wake my Kindle up, I'd like the Books and Audiobooks to be easier to sort through, and I'm still trying to figure out if there's a way to organize documents and downloads (though it's a pretty intuitive product to navigate overall).", "All minor issues that didn't detract from my positive experience traveling with it.", "Also, just a tip: if you know you're going to read in very bright sunlight, try to remember to adjust the brightness setting to it's brightest before you're actually in the sun, otherwise you'll be groping around trying to blindly adjust it.", "Can't ask for anything more than that.", "Runs Android so that's good.", "Easy to &#34;update&#34; and tweak it to your own likings.", "And by &#34;update&#34; i mean to r00t it.", "It made me leet be default.", "I love my Fire!", "As an IPad owner as well, I was a little hesitant to purchase the Fire.", "It does everything my IPad does, but the direct access to Amazon and its content is just AWESOME!", "It's no IPad &#34;killer&#34;, but it doesn't need to be because the Fire is its own tablet that can stand on its own and for the price, it's totally worth it!", "I'm just sorry I waited so long!", "The kindle fire HD is so fast and so easy to use!!!!!", "I love it.", "I got the 7&#34; because I wanted it to fit in my purse.", "I love having access to everything from audible and amazon at my fingertips!", "Seriously, this is my 5th kindle product - I have had at least one of every generation - and I have given them to family and friends.", "They have all been amazing and everyone I give one to falls in love with the product.", "The sound is excellent and it's got great volume too.", "Don't wait, get it now!!", "!", "I wrote my review for the kindle on the cover for it.Well, I like this but haven't yet figured out how to set up my FB or email.", "It tells you but then won't accept it.", "????", "Technically, it works well.", "It comes with no book of instructions or charger.", "I don't get that.", "you have to read instructions on the internet.", "Also, when I first recieved it, I couldn't figure out how to turn it on.", "I still only know that I have to close the cover and open it, and then swipe to the left on the lock icon.", "Maybe it's because I'm older and don't have all this knowlege imprinted on my DNA like my daughters seem to.", "I am glad to have it.", "12/25/2012 - Received as a Christmas gift - just cranked it up and learning to use it.", "Looks good so far!Recommended.12/28/2012 - my wife just finished her first book; now I'm reading it.", "Amazingly simple and easy to acquire e-Books and read using this solidly built device.", "We love it.", "this is my favorite thing i own!", "would much rather have this than any other ipad, nook or anything out there!", "I couldn't be happier with my new Kindle Fire HD!", "I do everything on here now!I used to use my laptop for everything and would have to lug it around with me.", "Not anymore!Great gift idea!", "Highly recommended!", "Thanks!", "The quality and the features and the price of this certified dodo is remarkable.", "I love the Kindle Fire.", "Compact and easy to use.", "The screen clarify is great.", "I still learning how to use the Kindle and its multiple functions.", "So far I am very pleased with the unit.", "Able to download games and books without problems.", "I really love my kindle and haven't had any problems with it.", "I purchased it back in April and have had it now 5 months.", "It is replacing my library.", "I don't miss the dust from all the books.", "well sort of", "So far the Kindle Fire HD seems like a very nice tablet.", "I still like a few things my &#34;brand X&#34; tablet does better but that may be a matter of familiarity with the brand X device.", "We are still learning the Kindle.", "I would recommend it to others looking for an Ipad type device but also need a more affordable price.", "Being an amazon fan, and owning the previous kindle fire, I was glad to see when they were coming out with this.", "Oh, and the kid's &#34;free time&#34; is pretty sweet.", "Unlike most devices, and even my ipad, this app lets you regulate what your kids can do and see on the prime, and makes it hard for them to close it, or mess up whatever they're looking at.", "If that makes any sense.", "In the end, though I'm Apple fan, and have nothing but macbooks, iphones, ipads, in the house, this little tablet rocks.", "This device is wonderful.", "I absolutely love it.", "I have been using for about a week and learning how to use, so far It has been some what a chore for me, the operation manual didn't come with it.", "I had to order one, this should have been in the box.I will be a little more to check this out.", "This is my second Kindle and Oh my it is a major step up.", "I love my kindle its speed and access to what I need and the price it really is a great bargin for what we get.", "I love my Kindle Fire HD!", "I've gotten a couple of other small tablets and ultimately returned them but this is a keeper!", "I love the ease of use, the portability of being able to pop it into my tote bag.", "The endless supply of free books is amazing!", "I wish it had  a more comprehensive manual of operation,too.", "I'm learning about what all it can do but I'm sure there is more that I'm not even aware of.Overall, this is one magnificent little tablet!", "Love it!", "I love it, but I wish I got the larger one.", "I only wish you could down load auto books from the library, it now can do MP3 but most books at the library are in a different format.", "But, I like the talking with most books.", "A male voice would of been nice but still it's a great thing.", "I like getting the books from Amazon as well.", "Thank you.", "With Obama being in I don't dare get the Premium Club.", "I am a Senior and just can't chance that I will need that money else where.", "Is there a Senior discount?", "I had to call technical support on my first day of ownership as the device would not charge plugged into a Mac.", "I learned that Amazon's Kindle Fire HD MUST be turned off while charging.", "For many of you that have smartphones and tablets made by Samsung, Google, and Apple know that you can continue to use the device while its being charged.", "But not with the Kindle (at least according to the rep I spoke with).", "Just a heads up.", "The fire is the follow-up to the fire I had waited for.", "This one really competes with the iPad and more.", "I really enjoy the increase in memory and improved video capabilities with fire HD.", "I will be the first to say I love my original Fire but this is freakin awesome!!!", "I was amazed that it was as easy to use as the first Fire is....the HD does make a huge difference though!!!", "gotta say that I love it!!", "!", "After using the Samsung for 4 months, I find myself going back to my Kindle Fire because it works so well with the apps I like to use.", "I read the newspapers every morning.", "I like to check my emails and my Facebook and I find that it is easier with the Kindle.", "I do like the voice recognition that the Samsung offers as well as the camera, but for day to day use, I find that the Kindle does the job.", "I don't know what the new Kindle offers.", "I have the original kindle which I started to hate because it was so simple and there was no backlight and I use he kindle app on my iPhone and iPad but I must say nothing compares to an actual kindle fire hd.", "So what when the kindle is off and you wake it you see an ad big deal- at least it's not the same borrowing picture all the time.", "I bought it primarily for reading and it hasn't disappointed.", "Loving it so far, but it needs WRITTEN operating instructions, the online ones don't suffice completely!", "Once I get it figured out on my own, I'll love it more!", "This was helpful, and the nice thing is you can upgrade to the newer version, or better versions at the time of replacement.", "fast delivery, easy exchange!", "For me, this Kindle was the best entertainment investment for the money.", "It's incredible!", "The unit itself, when combined with the slick Amazon case for it, is so thin it barely takes up any room in my purse.", "I love having all my Amazon content easily accessible.", "I find that I'm reading lots more, but more importantly, retaining much more from what I read/listen to.", "This is a new feature on the latest generation Kindle Fire.", "It has taken reading to a whole new level!Amazon has packed so many features into this thin, elegant tablet!", "I highly recommend it to everyone!", "I love my KINDLE FIRE HD!!!!", "I upgraded from the original Kindle Fire.", "I gave that one to my daughter.", "She uses it now.", "I own and Apple Ipad Mini, and I love that too, but, not as much as my KINDLE FIRE HD.", "I have recommended it to several co-workers who are now going to purchase new ones for family members for Christmas.", "Received enough Amazon Gift Cards for Xmas so I could upgrade my Kindle Fire to an HD.", "I can hear it easily in the same room as the TV running without turning the volume on the Kindle up or the TV down.", "It's like it's aimed right at me.", "Everything else is great.", "When I turned on my Kindle HD, there was a credit to claim that will make the app free.The e reader is about the same.", "I prefer the original Fire's look, but I will say the anti reflection more then makes up for it.", "I can't say what is different, but something is...The XRAY feature is pretty neat.", "I don't know how many time I pause a movie to look up something on IMDb.I will be receiving a cable (from Amazon) that will allow me to hook it up to my HDTV.", "I knew if I waited long enough, I would not have to buy a Roko, which I always wanted.", "Hope this set up works.", "It's more simple to use than android tablets, user friendly for sure.", "Cannot do this with most printers on my iPhone, I assume it is the same with iPad...", "Ive had my Kindle Fire HD for a few days now n I have nothing but good things to say about it.", "It hasnt left my hand since its arrival.", "This device is the most perfect media consumption device ive come across.", "I highly recommend this device!", "Just buy it...Now!", "I ordered the new Fire based on the what I had heard from friends, but after some reading (which I should have done first, I know), I ordered the Fire HD 7\", and returned the first one.", "I'm really glad I did.", "I have been having so much fun.", "I have the 1st generation Fire, and this is such a nice improvement.", "I'm still getting used to the on/off being on top now.", "(At least, that is the way it fits in my cover.", "I'm using the same one from my 1st gen. Fire.", "So for me, not a big deal.The other thing is, I have been trying to figure out the immersion reading or professional narration.", "It is pretty easy to figure out if buying a new book.", "But, I can't find anything on if it is possible to add the narration to books I already own.", "I've paid up to $10-12 for some of these books and buying them again would not be a option.I'm happy with my purchase and know I will getting lots of enjoyment from it.", "Love a lot of things, but the &#34;Others&#34; storage issue causes the device to barely work.", "Couldn't shrink it with Clean Master; you need to reset to factory defaults to clean it out.", "So, as long as you don't mind wiping your device every few months (which obviously no one does), it is fine.", "Looks like people talking to Amazon customer service have found out the people at Amazon have zero clue what is in Others as well.", "Super duper.", "I absolutely love My Kindle HD.", "Originally i purchased this for the reader, and it blows the standard nook books out of the water.", "It gives a month of Prime membership for free, after that its like 79$ will decided if after this year its worth that.", "However, I have had a few hours of fun playing on this, reading email, facebooking.", "Not really worried about adds saved me some money on my sisters birthday present.", "She uses this daily and as a teacher its is a valuable tool to have.", "Just sad to see newer better version out every couple of months.", "This has got to be one of the finest Amazon products in the world.", "It is easy to learn and the support that Amazon gives you when you purchase it, well they are outstanding.", "It is more fun than a human should be allowed to have.", "I just can't say enough.", "There are many many type out there but kindle beats them all.", "I recommend Kindle above all, you won't go wrong.", "Again Amazon goes out of it way to help you learn about Kindle.", "This is one of the best investments in electronics you can make.", "I have had mine and being on military bases for the past 1.5 years this is in such great shape and works as well today as it did the day that I received it.", "I give it 4 stars because Amazon didn't answer our Kindle Fire requests to implement a book sorting option.", "Had it included this, I would have given it a full 5 stars.", "I would most certainly recommend this to anyone who asks!", "I haven't even used it for reading books yet.", "This Kindle fire was a great upgrade to my original Kindle Fire.", "Other than that, still the same great reader as my original Kindle Fire.", "I own the original Kindle Fire and this one definitely have the needed improvements...", "Here are my thoughts:PROS====1.", "Screen quality is awesome compared to last Kindle but not as good as iPad.", "Sound is great.3.", "Blutooth was a great addition.4.", "General improvements to GUI.", "Nice work.5.", "Came pre-registered in my name and loaded all my info from last Kindle.", "Nice time saving feature.CONS====1.", "Volume control was hard to find and use.2.", "Original Fire fit in my back jean pocket.", "This won't.If they make use of the extra space and make the screen bigger this would be nice.3.", "Why was it this way?", "Huh?4.", "but...Overall, I liked the product and for what I intend to use it for (mainly videos and reading) this is a worthwhileupgrade.", "Using this as a general purpose tablet?", "Well, that's another story... and maybe another device.", "(I didn't go into the technical stuffs becaue look like alot of people already talked about it)The FireHD and Prime membership would make sense... you'll loose alot of advantage if you just have this device and no Prime.", "This is my first tablet, but my kids have earlier versions of the Kindle.", "You cannot watch your DirecTv shows on the Kindle, only on an ipad.", "If you want a fully functional tablet that lets you do other things beside tether you to Amazon, get an ipad...I'm giving this away next Christmas and getting myself a REAL tablet!", "We have a 8.9&#34; Kindle also, but bought this one mainly for our kids to use.", "Works very well and my wife likes this one better than the larger Kindle.", "Mated up with an OtterBox, works very well and rugged.", "Love the kindle (have bought 3 for various people including my 4 year old for car rides).", "No problems whatsoever.", "I received this on Christmas, and I love the clarity.", "I have the regular kindle, and this one is alot easier on the eyes.", "It's alot of fun to use.", "The highlighting on the ebooks is a little difficult at first, but I'm sure I'll get the jest of it.", "It's really awesome!!!", "I noticed that some kindle owners gave it a 1 or 2 star rating.", "Personally, I think they are being way too picky.", "For the price of Kindle HD how can you beat this.", "My wife and I are very happy.", "My problem is, and this united might be excellent.", "However, I have not been able to get it to work on line.", "In other words it is a little confusing to me and I really haven't had the time to study, and get it working.", "So, if you are over 83, it may take a little time.", "I have had great success buying refurbished, one-generation older tech.", "It allows me to inexpensively introduce myself to new devices and really figure out both how to use the new device and what features I am really looking for when I upgrade to the more current level.", "The picture is clear and that sound amazing for such a small device.", "A huge upgrade from my old iPod Touch, which I also got refurbished and has served me well but is getting long in the tooth.", "What can I say except I love it!!", "I loved my original Kindle (the first white Kindle with the Keyboard), and then I upgraded to the Fire and loved it.", "My husband talked me into getting this one so he could have my old one, and I love it!", "Most of the features are the same, but there are a few differences between this and the original Fire.", "I have also recently purchased a tablet, but I still go back to my Kindle.", "I absolutely love it!!", "!", "This is my first tablet so I don't have anything to compare it to.", "I know that I just wanted something with a screen that's bigger than a cell phone and lighter then a heavy laptop to carry.", "This did the trick.", "I'm happy with my Kindle Fire HD.", "Reloading the e-mail data, and being careful to connect to Amazon often for updates, if they exist, has not helped.", "I was originally given a different version of a reader, but found out it could not be used for audiobooks, so I returned it for the Kindle Fire HD-7 which I love.", "I have purchased many audiobooks and listen all the time.", "I love my Kindle Fire HD.", "It has some weight to it which I like.", "I did try a Mini iPad before getting the Kindle and I liked the Kindle better.", "this is a real cool tablet and it can do all kinds of things that my other tablet could't do I think  everyone should own one of these  these awesome.", "it was also sent quick but, carefully.", "Thank you, catswayze", "I love my Kindle HD.", "The ONE big thing is I so wish I could download Instant Messenger on it.", "Bought this for my wife, here's what she said:  &#34;I used my son's ipad previously but I like the smaller size Kindle for how I use it.", "Great for grocery shopping where I use a list to write the things I need to buy.", "The minor complaints...", "I love reading from it... the lighting and all the features like how fast you're reading, bookmarking, how many pages are left, etc.&#34;", "I will not list the pros as many before me have already stated them so let me list the few cons I have found.", "Downloads are very slow.", "When charging cable is attached (which is often) the device is upside down (landscape) when in a cradle so games must be played (in the cradle) without the cable as most only work in the upright position (landscape).", "Thats about it.", "I bought this as a gift for my step-son so he could download electronic text books for school.He uses it for all of his reading material now and I rarely see him without it.When the price comes down, I may get one for myself as well.", "Our Granddaughter absolutely loves her Kindle Fire.", "We have loaded several excellent applications and books.", "The educational materials available are superb and very engaging.", "I got 2 replacements for my daughters that they got for Christmas last year because the kindles where just shutting off when they just tapped to go on the internet or something.", "I received new one's just before x-mas 2013 and It's January 8 and my oldest daughters new one is doing the same thing already.", "We did figure out that maybe they got hot and shut down because the kindle was kinda warm..not hot hot, but warm??", "She wants a regular old tablet now.", "If it continues I am contacting Amazon again!!", "Just get one a tablet at walmart or just some other retailer.", "also - it needs a memory card slot to extend product life by providing a storage solution so it';s internal built in only memory can be bypassed.", "These are big problems for me but the price for this product on the other hand is excellent for what you get (and you get a lot) still.", "I just found out that ALL magazine subscriptions need to be paid out for 1 year!", "B&N; you can get a monthly subscription and cancel at anytime so some magazines are only $2 per month.", "I don't want to pay for a year if I don't have to.2.", "Kindle doesn't have that3.", "B&N; offers 14 Day Free Trial without purchasing for pretty much every magazine.I just got the Kindle today but taking that I was buying it for reading only and what I mentioned above is quite a bummer.", "I have to decide if I will return it or not and just go with another Nook.", "I've really been hooked on my Kindle Fire HD, although there are some glitches with the Silk browser crashing or locking up on me, also a few apps that have done the same.", "All in all, this is a WAY better deal than Ipad or Nexus 7.", "The Dolby audio is loud, you can hear it clear from 15-20 feet away, probably the best sound on any tablet.", "The graphics look very good, Netflix and other video sites are crystal clear and text is very good.", "For anyone with Amazon Prime, the Kindle Lenders library is a superb feature, and Overdrive is great for renting books from your local library online.", "The only bad thing is a lack of customization, but atleast the Kindle OS easily allows quick access to web/photos/applications/books.", "I absolutely love this.", "No eye fatigue from reading, like you would on a computer.", "It is light and fits into the pocket of a pair of cargo pants nicely.", "Set up was as easy as tuning it on, Amazon pre loads everything, and sync's it to my prime account for me.", "Can't beat that, and it took 30 seconds per email account to register them.", "Simply put I am very happy I decided to purchase this.", "I find that I constantly grabbing it to look up information quickly.", "But I also access the Amazon website nearly everyday with it.", "Having the Amazon Prime trial convinced me to become member and I truly love it, too.", "I would highly recommend the Kindle Fire HD 7&#34; product to my family and friends!", "This is 3rd Kindle Fire HD that I've ordered for my family members.", "We love it!", "Being a Prime member only enhances the experience!", "It turbos on the internet.", "Love my Kindle Fire HD!", "Use it every day.", "Just turning it on takes it down from 100% to 90%.", "Some of the other tablets I looked at were 4x as much as this one.", "It does everything I need and much more.", "for hours before needing to recharge.", "I am very happy with this purchase.", "Amazon delivers another solid product!", "I wish these were available when I bought my Nook Color.", "My wife and I are very happy with our Kindle Fire HD 7&#34; tablets.", "They are especially good for reading where the amount of available light is insufficient to read normal paper books.", "So far so good.I haven't had enough time with it yet but its a sweet gadget.I will post back after my free amazon prime offer has expierd.But I love it so far..I also just updated it to 7.2 I got it with 7.1", "Had never had anything like this before.", "One of my sons showed me his Fire & told me what it would do.I really like it for reading books.", "Read two so far & am on the third.", "Got it for my son's Christmas present and he is really enjoying it.", "My only wish is that I had snagged the prime offer of $59 for the year when I bought it.", "So far, my wife loves this little comp.", "That 'feel' thing.", "Everything seems to work smoothly.", "Has and does pretty much everything she needs out of a device such as this without the \"overhead\".", "Not sure how to use it and guess the book or guide is internal as no instructions came with mine.", "I did not like reading after my chid hood as teachers required reading lots of books each day however will be starting back.", "I got mine last night at 8:15.", "I forgive Ontrac for being 15minutes late on delivery.", ";) .", "I'm just starting to discover all the features in this feature rich gadget.", "Skype skypes!", "and the Books book.", "I love the reader part the best so far.", "Scalable fonts, text to speech, Xray.", "I will get back to y'all in about a month..... Good JOB Amazon!", "First off I would like to say I am a huge apple fan and both my daughters wanted iPad minis for Christmas after waiting around on them forever to come out I started looking at other options.", "I do 99% of my shopping on amazon and always see the kindles advertised.", "I read a lot of the reviews and decided to give it a try.", "This thing does not disappoint.", "The graphics are incredible compared to my ipad2 and it is definitely faster.", "The value in this tablet alone is worth buying it over an iPad.", "The Fire was a Christmas present for my wife.", "She loved it immediately, but the unit began to overheat and shut down consistently within 15 minutes of startup.", "We gave that a go, but the overheating continued.So, a week after my first support call, I called again, and they had a brand new Fire on my porch the next day.This one works like a dream, with the brilliant display and responsive controls people have mentioned, and no overheating.", "Wireless access is quick and simple, and my wife and I used headphones to watch two one-day movie rentals on a long flight.", "I wouldn't hesitate to choose this as one's main reader.My criticism is based entirely on quality control issues.", "I learned through a quick search that overheating happens with some Fire units.", "The company's quick replacement policy makes it all tolerable, but I think we consumers shouldn't be the quality test staff.I had the same problem with the Boeing 787 I'd just bought, and that was fixed too.", "Yay, Amazon!", ";-).", "My mom really loves her Kindle!", "This is our third Kindle.", "Already have a DX which this item will replace as well as an original Kindle Fire.", "GREAT VALUE !!!", "My best purchase ever !!!!!", "I would strongly recommend !!!", "I bought 2 of these for my young sons ( 9 and 8 yrs.", "old ) .", "I now find myself trying to use it more than them.", "I can't wait to be able to afford a 3rd one for myself !!!!", "AWESOME is  the best 1 word to describe it !!!!!!", "!", "I had the kindle fire, and got the HD last week.", "The icon should hen appear.", "I see complaints about the cams location.", "Main focus is books.", "I think the organization is better than IPads.", "Making them both top features.", "Got it for my wife (also gave one to my mother and mother-in-law) and they all love it.", "It's certainly tied in to the Amazon universe but being prime members that's probably a good thing.", "None of them are particularly technologically savvy but they don't have any problems using the device.", "I've only had this for two days but I've enjoyed it so far.", "I am waiting to get my hdmi cable.", "I love the feel of the kindle fire hd, this is my forth kindle and my favorite.", "Can't wait to get the case tomorrow.", "Well worth the money...no its not and iPad....wasn't suppose to be.", "The sound..wow did Amazon get this right!", "Sell your old Kindle and make the switch.", "I love the adds, I was able to get a book for a $1!", "By the way, almost ever kindle, when in sleep mode shows the picture of an author right???", "That's an advertisement lol!", "I got to use this on a trip across the country...Maryland to Denver and back.", "I'm happy!", "I read books, or play them at bed time.", "I can read my email, use it as a camera and so much more.", "I encouraged my girl friend and yes even my ex-wife to purchase one.", "They both love me for making that suggestion!", "I waited a long time to finally purchase the Kindle.", "Also , downloading books is much more affordable than going to the book store; not to mention you can carry a whole library around with you to read anywhere (like the beauty salon or doctor's waiting room etc.).", "The screen resolution is extremely clear and it works almost as well as my desktop computer for web surfing, checking email, etc.", "Definitely a good purchase.", "I'd probably give this a better rating, but it's my first tablet, so I'm having a longer than expected time learning all of its uses and quirks...", "I mean, features.", "I originally had the Kindle 3 (keyboard version), and loved it.", "Spending more and more time at my kids' sporting events, I decided to try a device that was a little more versatile, and picked up a Fire HD.", "I am really satisfied with the functionality of this unit, and have no regrets from the purchase.The e-ink on the dedicated e-books is amazing, which the Fire HD really can't reproduce.", "Any time an app/game is launched or installed, it appears in the carousel.", "Clean-up is necessary from time-to-time, if you aren't the only user.Overall, I am really satisfied with this device.", "I would recommend it to friends.", "I really do like the Kindle Fire and the 7&#34; is perfect to carry.", "Very short compared to the original Kindle.", "I bought this for my teenage daughter for her birthday and she loves it!", "She needed a device that she could use to access the internet and this does that and much more.", "I love this tablet.", "I think the app selection could be better and a couple of them I have fail from time to time, but I'm pleased with the HD overall.", "No major issues to date.Update (2 months passed):  I have downloaded a program manual through the kindle book store and have been training myself for a while now.", "There is a convenient feature where you can place book marks and add specific notes at specific locations.", "I had a nice list of notes that all of the sudden decided to disappear.", "Soooooo, I no longer consider this feature convenient.", "Not the end of the world but disappointing.", "Therefore I am dropping the rating from 5 stars to 4.", "They have unlimited great apps for a small fee.", "I also wish it was easier to find the downloads.", "I always forget how to find them every time I buy a new one.", "I already have an ipad but I am such a  gadget geek I had to have one.", "The power button is so tiny and flat on the side its very hard to find and feel for.", "The second is the arrow back button- it is on the Kindles main function panel- when I type I consistantly think that it is the delete button, and I am trying to delete a word or letter and it takes me to another page...you have to use the delete button on the keypad...annoying but again could just be me.", "I also use my e-reader, netflix, hulu plus, FB and Mail to and these apps work perfectly.", "The web browser is just okay I dont really use it to surf the web, only to make quick reference to look things up.", "The Kindle is also a lot smaller to stick in my purse or to travel with.", "I dig it.", "This is my third kindle.", "I also have the original Kindle Fire.", "I just bought the Kindle Fire HD as an upgrade.", "I also just bought the Kindle PaperWhite.", "Not sure what I can say that others have not already said.", "I bought two of these...one for myself and one for my son.", "I bought mine mainly to use hunting...so I could read a book or something while out there waiting but I can tell you I enjoy it so much I use it all the time now.", "I had the Kindle Fire and I now have the Apple Ipad 3 and I just the bought the Ipad Mini the other day.", "The Ipad Mini is probably the best tablet I have ever used.", "The IPads were superior in most areas.", "The big advantage of the Apples is their simple operating system.", "Don't believe what anybody tells you about the Ipad mini it is a Fantastic tablet.", "It is a higher quality in almost every area.", "Take my word for it it just works better.", "Get the Ipad Mini.", "It is worth the $100.00 difference I guarantee you.", "I bought this for the Amazon Prime content when they came out with the HDMI output.", "The only problem I have is that when I try to use my user name into some of my accounts, the auto-fill will insert something totally different.", "I called Amazon help line to find out how to turn it off and they were unable to help me.", "I had to start selecting a word from the auto-fill before I finished, then finish the username.", "Bought 2 for my twins for christmas..", "The only thing the new one has over this one is a slightly faster processor.", "Well I got it on the first day of the expected super saver rate of delivery.", "That was good.", "I do have an added enhancement that I had not read from the others I read before buying it.", "The new keyboard that pops up seems to be better.", "I can actually two finger peck these reviews instead of using a single stylus.", "The letters seem to be spaced out more and it speeds up text entry loads.", "Thank you amazon for for making the improvement!!!", "I love my kindle.", "An added bonus, this comes with the option to purchase an extended warranty.", "HA!The only thing I do not like, it that there is sun glare.", "Not really good for outdoors, which is a shame because I like to read outside.", "Not worth returning, but it loses a star.", "I love my Kindle Fire HD but wish it came with 3G or 4G without having to pay an extra fee.", "My Kindle 6\" is 3G and works almost anywhere I go.", "I was able to access the Internet at work one day when our connection went down using the Kindle 6\".", "Hope Amazon reconsiders and offers a better choice.", "In my opinion this would put them one up on the IPad.", "Still love this product.", "Just wish my daughter would let me use it more!", "I won't bother comparing it to the iPad, which is my daily driver, but I will compare it to the 2013 edition Kindle Fire HD.", "There are differences between the base user interface that make this device a little clumsy when switching between this and the 2013 KF HD.Otherwise, the hardware is pretty decent and the screen has about the right amount of pixel density to keep text and images from looking grainy like they do on an iPad 1/2 or even the 1st generation iPad Mini.", "After a number of failed PIN attempts, a prompt appears asking if you want to wait 30 minutes or reset the device.", "Small children tend to touch the reset device option, which results in me having to re-download books and apps over my slow u-verse connection.", "Purchased it as a gift for my husband for his graduation from college (he did it while working 60 hours and being a fulltime student - not easy!)", "He likes to read his books on it as well!", "It is incredibly well integrated into the Amazon world and setting up email and browsing and wireless was painless.", "I was using this tablet within a few minutes.The first thing you notice is the unit is just a 1/2&#34; to big.", "While it is hold-able, it is a bit of a stretch for one hand.", "It is very light so it's easy on the arm but the surfaces are fairly smooth, so one handed use is not as easy as I expected.", "- what I am trying to say is that I am actually using this thing.", "Even more strange, I occasionally read with this instead of my Paperwhite.With all the choices in this space, it's hard to pick a winner but with the current pack of small tablets, it's hard to pick a loser.", "If you are deciding between the Kindle Fire and the Google Nexus, I think it comes down to ease of set up.", "The Fire will have you up and running in no time.", "If you are more tech savvy, the Nexus has a more configurable environment.", "Ultimately I chose the tight integration with Amazon.", "Hopefully Amazon can push some sort of software update for that.", "Other than that I'm liking everything about it so far.", "i have both the regular kindle and now the fire, I adore it, picture quality is perfect it beats ipad bb playbook windows tablet and anything else.", "I had been thinking of getting a Kindle Fire for over a year but was feeling guilty as I already had a basic Kindle.", "I was &#34;forced&#34; to buy one when Newsweek went all digital in Jan. 2013.", "(Thank you, Newsweek!)", "I made a conscious decision to go with the Kindle Fire over an iPad.", "I wanted the smaller form factor.", "The iPad mini had just launched but I've been a tech user for many, many years and have never been a fan of iTunes and the Apple ecosystem.", "(No, I'm not an Apple hater, I chose an iPhone over an Android phone.)", "I love having the HDMI output on the Kindle Fire.", "(See my review on the 12 ft. HDMI cable I use.", "It lets me control everything from the couch.)", "My experience with the Kindle Fire HD - sometimes the responsiveness is not as smooth as it could be, but the fraction of a second of hesitation doesn't hamper my user experience.", "I have already downloaded two books and a game on my kindle.", "This is the easiest tablet to use.", "Graphics are great.", "I was even able to buy the Coach purse when they had the 3 day sale.", "I do love it.", "I have alot of books on it.", "No problems in the 5 mths Iv'e had it.", "For the money, it's the best.", "I started with the Kindle keyboard, then got the Kindle Fire.", "My sister uses it more than me now.", "Now I have the Kindle Fire HD.", "Love it.", "It hooks up to myTV.", "Great", "This was a work purchase because I read and review ebooks.", "Actually a client bought this for me.", "I wasn't prepared to think much of it.", "Just use and have on hand.", "Now I'm addicted.", "I read and review ebooks.", "I read pdfs.", "I watch videos and manage my Prime account, which I love.", "Recently I bought the AmazonBasics Keyboard and now compose emails, write stories, do lots more.", "The only thing I find lacking is Bing.", "But I can search on Bing, just more slowly than Google.", "Small trade off for all I can do.", "Oh, and I'm a big Apple fan.", "Still I wasn't going to buy an iPad and now I wouldn't no way.", "I'm happy with my Kindle and would replace it as needed.Which reminds me: I did replace it once already because someone near by spilled her drink on it.", "Don't do that.", "On the other hand all my stuff was in the cloud and quickly available on my replacement.", "I like the cloud too.Also read through the guides and other books that tell you how to better use your Kindle.", "Lots of good ideas.", "And get the Chinese Lunar New Year of the Horse book to demo to your friends how much fun the Kindle is ... because showing them a book page doesn't do it.", "But looking up your Chinese Horoscope teaches them how easy everything is to find.", "I purchased my Kindle Fire HD a couple of weeks prior to a trip.", "Shipping was fast, and already to go out of the box as advertised.", "I was good to go for my multiple flight trip.", "I just love this product and use it all the time.", "It does everything but make phone calls.", "I use it for reading everyday and couldn't be more pleased.", "Also customer service is JUST AWESOME if you need help with anything.", "I highly recommend this product.", "First of all I'd like to give it 10 stars!", "Wow what a computer... ok I own 5 tablets including iPad, Lenovo android a nexus Samsung galaxy.", "And guess which one I use everyday??", "You got it!", "My Kindle Fire HD.", "why you ask?", "It's like a heavy duty personal pocket pc.", "It does it all and very well.", "And on and on.", "I can't say enough good thing's about it.", "I use it without a case and its in my backpack, you cant kill it.", "It's got special break resistant glass screen .", "On a little kick stand.", "The only one thing I don't like.", "We purchased this for our daughter because it has the text to speech option and it is a much nicer one than the one she had.", "I don't know if this is normal or what but it does get a bit annoying.", "My bad.", "Don't do that with my 2nd & 3rd Fire HDs I love.", "One for bedroom to replace this first one I broke.", "then one on sale before the Fiere HDX for den.", "Love them!!", "!", "I have an iPad and iPhone.", "Wala - the Kindle Fire HD7&#34; with Prime subscription!", "She loves it plus not heavy holding while reading in bed!", "no light needed... should I go on?", "I am a hit with the greatest Christmas gift ever!", "If your needs are those listed above - the iPad, not the answer, the Kindle Fire HD is!", "With the Texting App, and Skype and a Wi-Fi connection, this is all you need.", "These are great pads.", "Add in the Amazon cloud for their items, and these are perfection.The Cons/room for improvement:I was able to make the devices so they required a password to make purchases, it wasn't difficult, but it required an extra step.More attention needs to be paid to the settings for children.", "I would like to be able to buy Brave and 3 seasons of Walking Dead through Amazon without concern for my children watching things above their age.", "love the Kindle Fire.", "This is my second Fire also.", "I got the first generation Fire last Christmas when it came out and was never disappointed and now I purchased the new Fire and love it even more.", "It's much improved over the flagship model but then each item has it beginning and then hopefully gets improved upon.", "My next kindle Fire will be the 8.9&#34; version in a year or 2.", "I love my new/refurbished kindle fire HD in.", "I upgraded from the kindle fire.", "So glad I purchased this!", "I absolutely love my Kindle Fired HD!!", "My husband gave it to me for Christmas.", "At first I had no idea really what it was and why would he buy this electronic device.", "He said that he bought it to make more more efficient.", "Well, I took it on business trip and I can honestly say that I am totally sold on it.", "It is soo convenient, fits in my purse and everything.", "I thought that I would be kinda anxious not having my bulky laptop, but this is perfect for travel, especially if you just need to check email to stay connected to the office.", "I have several of my magazine and books downloaded, so it is a really great handy tool to have!!!", "Definitely a great investment!!", "!", "I absolutely thrilled with my Kindle and all that it does.", "I know I haven't figured out all it does as it is so chuck full of interesting newthings I am finding as I continue to work with it.", "MAJOR PAIN!", "!", "I love the settings that can be changed for reading....for my aging eyes, the black background with white lettering is great, seems to be less tiring.", "i was very impressed with this device at first, but that feeling has quickly changed.", "the Android OS is very buggy and unstable like most Android devices that i have encountered.", "as an E book reader it works fine, but if you are a power user and attempt to use this thing as a tablet you will soon feel the pain and constraints of this thing.", "Very happy with the new Fire HD 7 inch.", "Syncs with my Google account.", "Have sideloaded Google Earth and Maps using 1mobile.com.", "With it I can easily copy files back and forth with my home server, as well as manage whats on the Kindle.", "But for the price this device can't be beat.", "It is fast, never had it crash on me, and I believe free time is a must have for parents of young kids.My only gripes; the volume and power buttons are almost hidden on you.", "Its kind of hard to remember where they are and which one is which.", "The other, no charger in the box.", "This is OK for me because I had one from my Nexus 7, but if I had not, I would have been dismayed that a $10 part could not be thrown in with a $200 device.", "When I traded up from a Kindle to the Kindle Fire HD 7&#34;, I expected a few pluses but the surprise was all the fantastic super pluses.", "The sound is like no other tablet I've heard.", "And with the 32 GB memory, I'll never be lacking for space.", "I really love this and only hope I can learn to use it the way I want to for all the things I want to use it for!", "I am very dumb when it comes to all of the computors ,Tablets, Phones ect.", "But I am trying to learn and I find that the Kindle is very helpful!!", "!", "I thought it would be too technical, but it seems that children his age are somewhat &#34;geniuses&#34; with these gadgets.", "Really love this Kindle Fire HD 7&#34;.", "The ES3 file manager works in conjunction with the BS player so you can easily find your files.", "I have lots of books loaded onto it and really enjoy the text to speech feature and let the book read to me while I'm cooking in the kitchen.", "I plug the unit into my boom box stereo auxiliary plug so that the audio feeds through the speakers so I can adjust the volume while I'm cleaning up the mess I've created in the kitchen during cooking.", "Deleting files is also very easy.", "Absolutely love this Kindle Fire HD.", "Watch them on the Kindle Fire HD as well as, while I'm online through my computer.", "Over all this unit is pure joy!", "I got my first Kindle Fire HD almost six months ago and when it had problems, Amazon instantly replaced it!", "It was absolutely seamless from a simple phone call to the always helpful help to no cost to easily return my first one at no out of pocket cost to me.", "This is one of many reasons my Kindle, now my second one, is my Fun and Easy Device.", "It makes me think the next Kindle I get will be that one with the awesome Mayday button feature and live help.", "I may get one for less technically savvy members of my family (we won't say who!)", "too.", "My Kindle has become an essential tool for daily living, the most enjoyable one of my many devices, and its price is right too and the service is excellent.", "I ordered the Kindle Fire HD about 2 months ago and I find that I use it the most for reading e-books.", "I can also use for my email and facebook, as well as for many other things I haven't yet explored.", "It's easy to store and bring along with you to appointments and other places where you're sometimes forced to wait for some time.", "I think I'll enjoy this for years to come, and I'm glad to have received it as a gift.", "It does what it does very well.", "This was a gift for my graduating daughter and she loves it!", "So far, she's had no trouble with it.", "My first one came with a crack and would function sporadically.", "One call to Amazon customer service and an exchange was on the way, no muss, no fuss.", "Wonderful!", "This is the first time I have bought a piece of cutting edge technology.", "I usually wait a year or so to see what works and what doesn't.", "The Kindle Fire HD 7 did not disappoint.", "Very happy with it!", "I own an iPad, iPod and iPhone and my husband just gifted me the kindle Fire HD 7 for my bday... Im quite impressed with the screen , sound and utilities in the Kindle Fire HD and the ease to use it.Im not going to compare it with the iPad... to me is like comparing strawberries and blueberries.. love both of them....", "I m not very impressed with Apple C Serv.", "alot of promises and words , but not meat in them.", "On the other hand, Amazon right away takes  care of any questions and or concerns..I have been an Amazon fan for a long time and now family and friends are using it too... we all think Amazon truly cares about their customers...meanwhile, I will be using all my devices.... and enjoying them..... and who knows, I might end using the kindle for most of what I do... right now is hard to tell other than, I m loving my kindle fire HD and I believe it is a wonderful device", "I am sooooo far from being 'tech savy' so I was thrilled to be able to understand and navigate thru the 'personal' side of my new kindle HD using the 'online' help..", "I also was very happy that it came all ready 'set up' according to my account.", "I had ordered and used the charger that was on promotion for $14.99 and it did indeed charge very quickly!", "I was able to use my kindle in no time.", "At this time I am very, very pleased with my kindle HD and really hope I can continue to feel this way.", "I bought this because Amazon was selling them at a steep discount for a refurbished old model.", "Less than $100 for this is a steal!", "I wanted the old version because the video out plug lets me use a VGA adapter and I can use this method to lecture to students.", "As for the OS... well, there are ways of getting rid of all the Amazon stuff if you search the internet.", "Nice features.", "Is the iPad, better?", "In some ways, yes.", "But I have the iPad and I am not a huge fan, mainly because I am not a fan of any of Apple's OS.", "The Android OS in the Kindle Fire is better and for the millions who are Android users, the Fire is a breeze to use.", "For the dollars, the Kindle Fire wins......but the Google Nexus is virtually neck and neck.", "Tough to make that choice.", "I can know leave on long motorcycle trips without being out of touch with the net.", "More convienent that a laptop, with Starbux internet cafe's I am never far from keeping touch.", "Can't turn off completely.", "I think this is a problem with mine only.", "I have owned my Kindle Fire HD 7\" for 2 weeks and love it.", "Navigating through the various menus is very easy.", "Reading even in sunlight is very easy on the eyes.", "All-in-all an excellent buy.", "My Kindle works fine when I need to use it.", "But it was good for that too, when I tried it.", "The Kindle Fire HD7 is very user-friendly, and I'm amazed with everything I can do with this.", "Apps, such as WatchESPN, proved invaluable.", "I got this Kindle Fire HD for my 7 year old granddaughter for her birthday and she was ecstatic over it!", "So happy I found it on sale, as I got one for my daughter for her birthday as well, and am thinking of getting a third one for myself (looked like so much fun)!", "Couldn't make a better recommendation than total satisfaction from the recipients!", "I'm so glad I purchased these gifts.", "I am enjoying my Kindle Fire HD.", "I use it in so many ways.", "I think I have gotten my money's worth already.", "I've had mine for 10 months now.", "I had to have it replaced as the original started to fail.", "I contacted customer service and had a new one in two days.", "It has been functioning great.", "I really like my HD.", "I recommend purchasing the Fire HD case by Kindle as opening and closing the lid automatically awakens or puts the unit to sleep.", "The case is compact and provides good protection.", "All files, and a ps are automatically backed up on Amazons cloud.", "Great unit for the money.", "My grand daughter got this instead of the EXPENSIVE Ipad she wanted; but, let me tell you...she has NOT put it down since Christmas!", "She has customized it and started taking pictures...which are exceptionally clear and bright.", "There is a flash on it too!", "A cloud printer works well with this device too.", "I am glad she loves it and we found by comparing features of this tablet to the Ipad, we came out good!", "Save the money and go KINDLE instead of IPAD...but then, again, that depends on your personal preference.", "In fact, I may be going out soon to get myself one!", "Thanks Amazon!", "I bought this for school, because my laptop was just too cumbersome.", "I did not expect to like it for regular reading, but I do - I've transferred some of my favorite &#34;re-reads&#34; to it for recreational reading, as well as downloaded school texts and research papers.", "It find it useful for checking mail and looking things up on the web, and it shows off my photos very nicely from the cloud drive.", "Am buying my roommate one for her birthday, and probably my Mother one for hers.", "Definitely a good thing to have!", "So far so good!", "I am enjoying getting to know my Kindle Fire.", "I previously used an iPad so I sometimes get confused as to how to navigate.", "The Kindle Fire seems to be mich simpler and easier to use than the Apple device.", "The Kindle is more then I anticipated.", "When my 14 year old great granddaughter was able in 10 minutes to demonstrate it's use, I was surprised.", "I never thought I would like it better then reading a paperback, but most important was the ease of reading when you only have one eye.", "Light no longer a problem and retaining where you are at when reading, a snap with the book mark capability.", "Once you open the cover, it's back where you were.", "That helps an old memory.", "I highly recommend the unit for those with weak eyesight who still enjoy reading.", "Everything I wanted in a tablet.", "It just works for me.", "Plus it's a Kindle reader too!!", "How can you go wrong.", "Very happy with my purchase.", "Kindle Fire, )Oh YES !!", "Got this for Christmas, but due to moving, I didn't get my Kindle connected until yesterday.", "This little machine is &#34;HOT STUff&#34; !!", "i also got a laptop for Christmas, and had I known what a Kindle could do, I would have returned the laptop!", "i had an older Kindle, just to read books on, and cannot BELEIVE what this machine can do !", "Lovin' every minute of it !!", "Edith Degenstein", "It is much easier to get from one place to another with the touch of a finger.", "It has many more features than the first Kindle.", "It's just so cool.", "It has a camera which takes really good pictures but is backward facing.", "There are so many features that I haven't learned yet and probably won't because I'm not that smart.", "I am very satisfied with this purchase and I would say to anybody thinking about buying a Kindle &#34;Don't waste your time with a regular Kindle.", "Get the Kindle Fire HD or better&#34;.", "Many others have done excellent comparisons and such so I'll just keep this short and say &#34;I agree, this is an EXCELLENT tablet&#34;.As a parent, I appreciate the controls and ability to keep up on my boys' activities.", "Well done Amazon!", "The weight is comparable to other tablets but the price is unbeatable.", "Kindle is winning in books collection and other than that it concedes to many different areas.", "Great Gift for Computer Teaching Daughter.5 children in the family and third Kindle.Great shipping and fast.", "Buyer in Pa. and daugher in NC no problems.", "First off i want to say that the delivery was just as promised.", "I received my Kindle on Friday the 14th as scheduled, I love that of Amazon!", "I purchased the KF for my 11yr old son, but as soon I tried it I loved it for myself.The size is perfect, alot thinner, fits great in my purse.It works great, the screen and sound is so clear and it is fast.", "Hopefully they improve on that.", "Other than that I have no complaints.", "The KF HD is great, I would recomend highly.", "I was amazed by the way the kindle fire HD looks, and feels, and how it handles!!!", "Now anybody that knows me always sees me with my kindle and my iPad mini where ever I go!!!!", "You guys are the best!!!", "!", "I have nothing bad to say about both of our Kindles.", "Amazon called this a &#34;replacement&#34; Kindle for the original kindle that no longer held a charge.I had to pay almost full price, plus return my original kindle to them, at least I have a working Kindle now.All of my Kindle downloads were transferred over to this Kindle.This Kindle charges perfectly and holds the charge.I am unhappy that Amazon refuses to admit that there was a soldering defect in the original Kindle Fire's recharging area that causes it to be useless.", "I have a Zoom tablet, smartphone, several PC's and laptop's.This is some of all of them.The HD, size, and weight are great.I will spend a month going through all of the online available help from AmazonThis unit is capable of so much.Can't wait for my Prime account to activate.", "I hope this lasts a very long time.", "I love the Kindle so much.", "The last one would shut off on me once in a while so I'm praying this one doesn't start doing that later on as well.", "This is our third Kindle, and there are only two of us!", "I bought the Kindle HD for its new features, replacing my Kindle Fire.", "The ability to access Amazon.Com was a bonus feature.", "The one thing I don't like is the email format.", "Splitting the screen is a waste.", "Don't get me wrong; I use this every day several hours a day.", "I am only saying that the designers should work on that for the new one.", "I have used this device hundreds of times, and I still have trouble finding the power button on the first swipe.", "It should be raised a little.", "In my humble opinion.", "I love all of my kindles and this is no exception.", "I do wish finding the setting was easier.", "It is the right size for traveling and being able access the internet.", "I used it while on a cruise to Skype friends.", "Up to this point I have had very few problems but there is all kinds of good stuff that I have to learn.", "Any problems I have had are physical, not technical.", "Had no problem activating the system.", "There are very few guides in the box.", "But obtaining guide manuals on Amazon is easy and free.", "I would advise a Kindle account to download at least one guide to your PC or laptop so you can read what to do while working on the Kindle Fire HD.", "I had  several paper magazines that I now read on my Kindle.", "Be sure to keep track if writing down, and keeping, what you enter on the Kindle when trying any of its many functions.", "I use it for reading and it works like no other tablet i have seen.The first one i had broke up, but amazon sent me a new one in no time.", "i purchased this device it arrived at my house 100% good.", "I really like the Amazon Eco system so this tablet is perfect for someone like me.", "Its much nicer than the original in many ways.", "It is a little wider than the original more like a shrunken version of an ipad but still light enough to hold with one hand for a little while.", "The only downside is that it doesn't have Flash so you can't view certain websites that require Flash.", "When my original Kindle stopped working 11 months after purchase, Amazon immediately sent me a new one.", "Since most of my stuff was stored on their cloud I had no problem with lost information.", "(The only exception was that progress I made on a few games was lost so I had to start over at level one, but that's what I would call a First World Problem.)", "I just got the kindle fire hd for fun really.", "I actually feel like the viewing angles might be slightly better on the kindle fire hd.The device is thin and has a very good build quality.", "I actually typed this whole review on my new kindle fire!", "This is nearly a 5-star product.", "What I like about it:1.", "Ease of use - my Mom can use it and she is computer illiterate2.", "Great video quality and great sound.3.", "Volume and power key - color - black blends in and is very hard to find on unit.", "An off-black color would help me find these hidden keys faster.2.", "I don't know if it's Amazon or Ford to blame.", "Purchased this for my 9 year old daughter.Love the parenting control you get with this.", "It is hers though so she doesn't have to go into that part of it.", "Love everything about a Kindle.", "Tons of free apps for her and she loves it as well.", "We are amazon prime members too so I have used this to hook up to my sons (he's 2) TV and play videos on there.", "Very family friendly.", "We just purchased our 2nd kindle and it's great for the whole family!", "Amazon prime is an added bonus!", "Actually this was a great Kindle.", "Ideal for all uses I could put it through.", "Good reader indoors, not so good outdoors in sunlight,  Weight is a little heavier than Kindle Fire, but features make up for the SLIGHT increase.", "Make sure you get a cover that has magnetic on off strip, great feature to have and makes a big difference.", "Arrived on time and in great shape, I bought a kindle fire for my wife last Christmas she loved it.", "there  are a lot of things this thing is suppose to do, but I can't figure out how to use.", "I don't use iphone or tablet, so this is not intuitive for me.", "I use my Kindle Fire every single day of my life.", "I've downloaded some puzzle-type games, have access to my books and watchlist (and email and documents if I really really NEED them), so when I think Kindle, I think &#34;Playtime!&#34; This can do a lot more than I ask of it, but we have a symbiotic relationship -- it seems so happy when it's entertaining me.I like having my original Kindle Fire as a plaything for the household, and at these prices....", "well...If you aren't an Amazon Prime member, you really should consider it if you have a Kindle Fire of any kind.", "I don't even watch TV anymore because I have gotten so accustomed to watching without commercials.", "Amazon Prime rocks.", "I am computer challanged and probably should write a review in six months.", "So far it does more `stuff`then I thought it could do.", "Glad I chose this one.", "I would recommend this to anyone who was loking to buy.", "I agree with the raves for the Kindle Fire HD.Only one concern; it gets hot.", "While watching a free Prime movie the back of the Fire HD (near the bottom edge) is 103 degrees Fahrenheit.", "Never noticed that issue with its predecessor.Still giving 5 out of 5 stars because it's really cool (except for the bottom of the backside).", "I've always avoided this type of product, but my wife has loved hers the past two years, so thought I'd give it a try.", "Sure wish I had done this 2 years ago when I bought my wife's as a Christmas present.", "I love how it keeps the pages, it's easy to read format, and how the page adjusts itself as you turn the unit.", "I'm still learning the &#34;ins and outs&#34; as I sometimes wind up where I didn't want to be and how to get back to where I was.", "I'm also trying to figure out why certain things drop down at certain times as I'm sure I'm putting my hands or my fingers in the wrong place to cause that.", "However, I've read several books with this unit and I'm very pleased that I made the jump.", "The Kindle is everything Amazon said it would be and especially economical.", "You get a $20 discount the firstyear when you join.", "Like I said Great Buy.", "I loved my Kindle Fire HD 7 until the battery died, 3 months out of warranty.", "Better than nothing, but seriously not much of a bargain.", "Since we mostly use the Kindle for reading books, I think we will not be replacing it, just use our iPads.", "i love my kindle fire hd its great and all but i would like to be able to choose my own background!", "also the choices for games amd applications is very minimal so dont expect a huge selction like on the Apple Devices.", "Believe me there are a lot of them!", "The best part??", "Is you guessed it NO REFUNDS and AMAZON leaves those applications on regardless of the publishers obvious scam.", "for that reasoni buy nothing.", "I think the most important thing of this tablet is the strong ecosystem.", "We can enjoy  many services to make life easier.", "the company is improving every day for better things.", "I got this as a gift from my husband.", "I was so thrilled to get it and even more thrilled once I turned it on and started to use it.", "This is a 'rushed' project if I ever saw one.", "I hope the 'lit' kindle isn't as disappointing.", "As for this, I'm sending it back.", "I love the Kindle Fire.", "It is the device that brought my mother-in-law to the online world and we are grateful to it for that alone because that was no easy task, let me tell ya!", "And now, it is the device that we take with us as we travel or if we just need some fun entertainment on the go.", "Also love reading books on it although I tend to go to my plain old Kindle for just books.", "Money well spent.", "Love the Kindle Fire!!", "!", "Overall VERY happy with my decision to buy a Kindle Fire HD.", "It was between the Kindle and the Nexus 7.", "I decided on the Kindle mostly because of Amazon Prime.", "I mean the Nexus has nothing like that.", "I would say somewhere between 60%-70%.That really wasn't a big deal for me.", "I bought a tablet for two main reasons:Entertainment while travelingWeb/Email access while sitting on the couch in a compact device.", "I would not waste my money on an ipad mini, unless you are totally locked in the iTunes universe.", "this is a great product, bought it for my boyfriend for a Christmas present.", "only could find a certified refurbished one and you cant even tell its refurbished!", "came in a new box and everything.", "to this day he doesnt even know is certified refurbished!", "great buy!", "I have resisted buying an iPad, because they seemed so limiting (and many techies I know are selling theirs and going back to laptops for the same reason), but when you can get a fully functional tablet for the price of the Kindle, why not?For the features you get, you cannot beat the price on the Kindle Fire HD 7&#34;.", "I use it mostly for reading books, the newspapers, and watching Optimum Cable TV when working out.", "I also found the perfect case on Amazon for less than $4.", "If I had to identify a flaw, it would be the accelerometer, which is often slow to react when reorienting the device.", "All in all, a really great deal, especially since they are discounting them now in anticipation of the next generation of Kindle Fire devices.", "This Kindle Fire HD is awesome..I have had so much fun with it.", "A few months ago, I purchased a rival tablet from Staples and after having it for about a week, I returned it because it wouldn't boot up..", "I am so glad that I waited and didn't get another one of those tablets..", "I like the Kindle so much better..", "I had it out of the box and working in no time..", "I haven't had one problem with it except with getting my email to work..", "I think it is my carrier and not the Kindle..", "I am still trying to solve this mystery..", "It has downloaded all of the books from my old Kindle automatically and it is amazing that it is all just there on my device!!!", "The Cloud is great for extra storage..I debated getting the larger GB device, but think this will suit me well.", "I love the ability to pick up this Kindle and carry it with me.. We are looking forward to taking it to FL in the summer instead of lugging our laptop with us..I have no problem with using all of Amazon's apps...I can find everything I really want from them..This is a great item at a great price..give it a try!", "!", "This Kindle is working fine.", "So definitely satisfied with a certified refurbished version.", "My niece loves it and I would not hesitate to by other cert refurb products.", "The picture on the Kindle Fire HD is amazingly clear, I was instantly impressed when I opened it up and turned it on.", "It came already set up for me which made it easy.", "I had seen commercials for the Kindle Free time prior to buying this and I am really impressed with it.", "Each of these can be different lengths of time.", "I have no complaints about the Kindle it works great and I love using it!", "5 Stars!", "Love it!", "Beats my old kindle hands down.", "It is pretty impressive and I 'm glad We bought it for Father's Day for the old geezer !!", "Buy one you will love it !!", "I 'm gonna get one for myself !", "!", "you will love it.", "it seems quite durable works almost all the time with no quirks or glitches.", "the battery seems to last about 4-6 hours rather than 11 or so advertised.", "but that is playing angry birds , watching youtube , facebook , and such.", "nice job amazon!", "many are in the 1-5 $ range, many are free with annoying ads but manageable, a few are more like 15.00 but that is like the office suite.", "if the creen does not flip for yyou right away i just tilt the top of the screen tword me and it corrects.", "I received my Kindle Fire 7\" as a Christmas present.", "I was a reluctant recipient because I imagined I would prefer the look and feel of real books.", "I was surprised to find that reading at night, the little screen aglow, is actually quite pleasant.", "The ability to download books on whim can be addicting.", "Apparently, Kindle enhanced versions are for iPads.", "My computer and cell phone have no problems, but the Kindle repeatedly drops the connection.", "This typically -- but not always -- happens when the Kindle has been idle for a few minutes -- like, you make a trek to the refrigerator.", "On your return, no Wi-Fi.", "If you check the settings page, it says that it's connected, but actually it isn't.", "You have to shut the Kindle down and reboot.", "Most of the time that works.", "On occasion, however, you have to reboot several times, and this tends to shrivel the enjoyment.", "Apart from these glitches, I have been pleasantly surprised.", "Maybe when hand-held holography becomes available I won't wait so long to give it a try.", "This is my second Kindle - the first was a reader only.", "I haven't had this Kindle Fire for long, but I am really enjoying it.", "I have more to learn, but it isn't hard since the guide book is already in it.", "It just gets better and better to use.", "Exceeded my expectations.", "Great for trips  when you need something smaller than a laptop.", "Not use to Kindle format coming fromWindows.", "Need more time to learn all the features.", "I'm a Microsoft fan, but I got a kindle & ipads for the family this x-mas (since the real surface won't be available for a while).", "Comparing the ipad 4 retina 32GB with the Fire HD 32GB  I have to say I'd choose the kindle for myself.", "Once the music files are there, everything just works.", "I love Kindle fire HD.", "It plays Youtube HD video without a hitch.", "The resolution is terrific and the price is unbeatable.", "No wonder Apple is trying to come out with a 7 inch mini to compete.", "Highly recommend AMAZON PRODUCT AND SERVICE.", "DEFINITELY FIVE STARS.", "Love the product, only problem is the volume will suddenly drop on its own when watching something, pause it, start it, and the volume comes back up!"],
        ["_misc"]
    ]
]
