[
    [
        ["File transfers are speedy and have not had any corruption issues or memory fade issues as I would expect from the Sandisk brand.", "I like this SD Card because it can take music video downloads, personal videos, files,docs, and multimedia images with a fast transfer rate of Class 10 speed.", "It works, but file writes are a bit slower than expected on a USB3 reader.Also, both reads and writes are FASTER with the card inside the standard-size SD adapter (15 MB/s vs 10 write; 45 MB/s vs 22 MB/s read) on the same card reader.", "Solid SDHC card that is fast (at reading and writing) fast (for recording video and pics), has great capacity, and is reasonably priced.", "Fast read/write, came with adapter, small packaging, but that's all it needed!", "Class 10 Speed Rating for Seamless Full HD VideoThe SanDisk Ultra UHS-I card features a Class 10 and UHS Speed Class 1 (U1) rating, the highest video performance available for recording uninterrupted Full HD** video.Flawless App PerformanceThis card can retrieve stored data almost instantly, thanks to its up to 30MB/s read capability and fast bus interface.", "The read and write speeds are better than the Samsung SD card that I had previously.", "High transfer speed.", "I can't really tell the speed difference between this one and a slower card it replaced.", "Great hardware that is truly speedy, responsive and meets my needs!", "USB 3.0, not some crapple bs) it delivers the advertised speed.", "It's pretty fast compared to the 16GB cards I've been using.", "I've had no problems and no complaints about speed.", "I would recommend this card to everyone.Data Transfer speeds - excellent with this card on my Galaxy S2.", "I bougth this micro SD card after some trubles with other that i got from Kingston, i can tell that SanDisk is other quality, this is the best, my i9300 phone can read a 64GB very fast, the dta transfer speed from my pc to my is amazing, if you are looking for additional storage to you phone, for music, pictures and other type of files, this is for you.Pros-Very good quality materials of construction-Amazing speedUpdate after one year this memory is damaged I can not delete or put new files on it, I can not format this memory, I tried to format with my phone, with my pc, with a camera and nothing, now this is like a 64gb cd, the data in the memory is only available to read but I can not move, or delete it, I bought this memory to be used to backup all my data of my android device but now is only a readable memory I can not write data on it any more, I hope sandisk make a better products in the future!!!", "If you want something that can transfer files Photos, Videos, and Music faster this is the Micro SD card for you.", "A bit faster in my Note II, but still a disappointment for devices with quad core processors.", "It allows me to easily record hours of 720p/60fps video without running out of space or slowing down.", "Very, very fast read and write speeds at a good price, plus SanDisk has the best software and device compatibility.", "Used in my phone it's plenty fast and works just like it should.", "excellent quality, excellent speed.", "This card advertises itself as UHS1 but it's actually UHS50.This means that it will not go up to SDR104 speeds/throughput.Not necessary bad, just false advertising.", "But you need to look at speed class.", "It will not freeze because it can move the MB/s fast enough.", "Speed seems great as well, no complaints.", "However, this isn't a problem;  I bought the card for putting a music library on my phone.Like all class 10 micro-sdhc cards, it does NOT do 10MB/s, but it's closer than any other class 10 card I've ever tried.", "Most do 3-4MB/s.", "The copy process from computer to card was fast.", "I bought this SD card for my android phone thinking that a class 10 will be faster and more reliable than others.", "Works flawlessly after three months so far, no problems.In my card reader, I average 6-8 megabytes read and write to it.", "But in the mean time on first look, the person who said that the S 3 has problems with anything faster than class 6 may not have been correct - a full backup of the phone to the card was significantly faster than the backup with the old 16GB class 6 card.", "Super fast transfer rate.", "It works but the actual R/W speeds are 18/8 MB/s, not even Class 10.", "Is a very fast memory at a great price.", "Super Fast.", "I expanded my Samsung Tab 10.1 tablet from 1GB to 32GB works fast and don't see any lags.", "Fast!Was pleasantly surprised of the good quality Memory Card Adapter!", "The micro SD card was very well made it had great read and write speeds and it added gray amount of memory to my Samsung galaxy s4.", "Fast transfer rate, good capacity, and reasonable price."],
        ["speed"]
    ],
    [
        ["Purchased this for my device, it worked as advertised.", "it works as expected.", "This think has worked out great.Had a diff.", "It does what it's supposed to and SanDisk has a long standing reputation that speaks for itself.", "Works great with all SD card readers.Select with confidence.", "I have had no issues with it.Overall, highly recommend.", "So far I've had no issues with it.", "Works as expected.", "Works great in a Samsung Galaxy S3.", "Nice product and quality and works great.", "Stuck it in my S2, formatted in settings, works great!", "The memory card is an excellent condition and work as described.", "This tiny marvel does what it claims.", "I purchased this card to use in my ContourROAM2 and it works great.", "I ordered this for my new Samsung Galaxy note II, and it works awesome!", "You plug it in and it just works.", "Does it's job and fairly cheap for what it's worth.", "I bought this card for my Gopro hero3+ and it was worked fine.", "I have installed it in my wife's cell phone and it was immediately  recognized.", "Its working pretty good.", "So far so good.", "Cannot go wrong with SanDisk and to date it works as advertised."],
        ["works"]
    ],
    [
        ["It's the real deal, genuine SanDisk, and contains as many GB as it says it does.", "All though it states 16gig it only has 14.8gig available but I know that happens and expected it, keep this in mind if your wanting more storage you might want to order the 32gig card.", "As a matter of fact I've already exhausted the remaining space on the card so this 64GB will allow me to take more photos (of our son).", "You get a lot of storage at a small price.", "Initially, when plugged into the computer, we couldn't find the storage in the directory.", "Plenty space for pictures, videos and Android Applications.", "I have them installed on my smart phone, cameras and even used as a portable storage device and I have not noticed any issues with them.", "Not quite sure about the features this chip is supposed to have but for the amount of memory it was a good deal - extra features or not.", "Great storage size."],
        ["storage"]
    ],
    [
        ["It&#34;s great for video cameras and camcorders with the supplied adapter.", "Nice to have extra microSD adapters lying around since I always seem to misplace them.", "This was always going to be a one star or five star review - no middle ground.The adapter is a nice bonus too, though I don't think I have anything to use it with.", "everything about it was great, except for the adapter.", "Unexpectedly comes with mini and full SD card size adapters, which is nice.", "SanDisk is a company you can trust and offering such a good product at a low price.Comes with an adapter and small case to get full sd card size and keep it from getting lost when not in use.", "Appears to be Class 10, holds about as much as it says it does, came with an SD card adapter and they even gave me the option to forgo those ridiculous plastic packages that you all know and hate.", "Comes with a nice little adapter for your MicroSDHC so you can use it as a normal size SD card also.", "I used the adapter to connect it to my computer, but it wouldn't mount.I bought this directly from Amazon and not a third party vendor, so I know it's genuine SanDisk."],
        ["adapter"]
    ],
    [
        ["It provides all the space I need and for people who need a lot of space (videos, Quick Books, picture editing, games, etc.)", "this card is the one for you.", "Sandisk really needs to do better quality assurance on their products.", "Love it, good quality good performance, great brand.", "Very good product.", "I'm using this SD card in my Samsung Galaxy S3 instead of another one I bought with the same manufacture \"SanDisk 32 GB Mobile microSDHC Flash Memory Card SDSDQ-032G-AFFP\" (http://www.amazon.com/gp/product/B007KFXIDE/ref=oh_details_o04_s00_i02?ie=UTF8&psc;=1).It's working perfectly since October 2012.", "Great memory card.", "Works great."],
        ["quality"]
    ],
    [
        ["This card is reliable and solid!Cheers!", "Using the app, you can easily move files from your card to a number of cloud storage services.Durable DesignSanDisk Ultra UHS-I memory cards can capture memories from -13 to 185 degrees Fahrenheit with a shockproof, waterproof, and X-ray-proof design.", "I bought 2 of those SanDisk 32 GB microSD , used them on my Galaxy Note and Galaxy S4First one , my phone started saying it was removed , then recognize it again :) then diedI thought it's just a luck , plugged in the 2nd one :) stayed for about 2 months and died suddenly !", "Lasted a few months and then broke.", "I used this for a few months in my phone, then it decided to quit mounting.", "The new one's worked fine, but failing after 3 months in inexcusable.", "Forget thumb drives - this is your most flexible, durable option.", "very easy to use, reliable and the red stripe on the front makes it easy to find on a crowded desk", "it turns out, the difference in class doesn't really matter at least for Android phones.", "The SanDisk 32GB Micro SD Class 10 is a reliable SD card with amazing transfer speeds.", "San-disk is a pretty reliable brand as you won't be able to go wrong with it.", "I thought their new cards would be just as reliable, but I was wrong.The microsd card failed yesterday inside my phone.", "Got this because you can't beat the price and Sandisk has so far always been reliable for me."],
        ["reliability", "longevity", "durability"]
    ],
    [
        ["I can't believe how small it is.", "The only possible problem is that it is SO small that you may lose it if you happen to drop it during handling.", "Lot of questions about this memory card fitting the Samsung Galaxy Tab 3 10.1 tablet.", "It fits and works no problem at all.", "This item was priced right and fit right into my cell phone without any issues.", "I use it for my GoPro camera.", "Using it for a Samsung Galaxy S4 mini with zero complications.", "This product arrived in two days (Prime), it was exactly what I ordered and it works great in my Galaxy S3.", "Bought it for my gopro hero3 camera (silver edition).Working without any problems.", "The micro card works with anything that also takes standard cards due to the included adapter."],
        ["compatibility", "size"]
    ],
    [
        ["Bought it with Retail Packaging, arrived legit, in a orange envelope, english version not asian like the picture shows.", "arrived quickly, bought a 32 and 16 both retail packaging for my htc one sv and Lg Optimus, both cards in working order, probably best price you'll get for a nice sd card", "I received it in an unopened SanDisk packaging.", "Packaging was decent it just shouldn't have bragged about being impossible to mess up when I messed it up.", "it shipped fast and is a slight bit cheaper than in the stores i believe.", "I ordered this from Amazon on Tuesday morning, and it arrived with Wednesday's mail.", "Neither the packaging nor the Sansa Clip player inform the user that the player needs to be totally off before the microcard is inserted.", "Shipping was excellent fast and reliable.", "Shipping was fast , the product has a great quality and a great pricing.I like this manufacture and I am going to order them for my other devices.Lots of space"],
        ["shipping time", "packaging"]
    ],
    [
        ["You can never have too much phone memory, since I download a lot of stuff this was a no brainer for me.", "I should have sprung for the higher capacity.", "I think its made a bit cheesier than the earlier versions; the paint looks not as clean as before", "bran 64gb card and if went south after 3 months.This one has held up pretty well since I had my S3, now on my Note3.", "*** update 3/21/14I've had this for a few months and have had ZERO issue's since it was transferred from my S3 to my Note3 and into a note2.", "It's mini storage.", "It doesn't do anything else and it's not supposed to.", "I purchased it to add additional storage to my Microsoft Surface Pro tablet which only come in 64 and 128 GB.", "I have it in my phone and it never skips a beat.", "Great card to own.", "Why entrust your precious files to a slightly cheaper piece of crap?", "If you lose everything can you forgive yourself for not spending the extra couple bucks on a trusted product that goes through good QA?", "It's hard to believe how affordable digital has become.", "32 GB in a device one quarter the sie of postage stamp would have been science fiction less than a generation ago.I picked this up for portable music when I didn't want to schlep (or risk) a phone or iPod.", "It can take games with large files very easily and still have enough space for apps.", "Fits very easily into smartphones and tablets SD Card slots.", "I recommend this 32GB SD Card to everyone.", "Can't figure why...", "I bought this to use with my go pro hero 3 black edition.", "It requires a class 10 MicroSDXC card.", "Comes with a nice hard plastic case to keep both dry and together if needed.", "got this because i had a 2 GB one that filled up.", "i kept getting the insufficient disk space on my phone.", "my kids take my phone and do selfies.", "mostly my daughter.", "I had to get a bigger card.", "the 2GB one was a carry over from an old phone.needless to say this was sweet.", "plenty of space.", "and i dont have to delete pictures anymore.", "well for now at least.my daughter loves selfies.", "The SanDisk Ultra microSDHC and microSDXC UHS-I cards offer faster app loading and smoother, more fluid app performance.Storage Capacities Up to 64GBThis card has plenty of room to accommodate Full HD videos, MP3s, apps, and other memory-intensive mobile files.", "Available in sizes up to 64GB, it can store all the apps, music, and video you want.Android App for Easy File ManagementThe included SanDisk Memory Zone app lets you easily view, access, and backup all of your digital files from your phone's memory, additional memory card, and cloud service all in one convenient place.", "Your mobile device may not survive, but your SanDisk memory card will.", "I would not hesitate to buy another one of these great Micro SD cards from SanDisk.", "I also own their Clip plus MP3 player and it works very well.", "I think I'm becoming a fan of the SanDisk products.", "Mainly bought it to use in my Nikon DSLR since I can put the card directly into my (CM modded) Nook HD+ tablet in the field and view my images on a larger screen.", "Formatted straight away, full size there.", "I guess the IO in the phone can't take advantage.", "SanDisk never disappoints.", "As always SanDisk products are worth every penny.", "I recommend this product to everyone.", "I just received my card, it is the class 10 64GB with the correct serial#SDSDQUA-064G-A11A.", "I am going to use it on my HTC Rezound, I hope it works.", "From what I have read, it will work after reformatting the disk.", "I will update this review if I have any issues using it, if not, my rating will remain unchanged...", "Already filled with music, pics and videos...  Get this card, format it right, and you'll have no problems.", "If your phone won't do it right, should have got a Samsung!", "haha...", "I purchased two of these one for my Samsung tablet and one for my samsung galaxy note.", "As advertised, specs match.", "As long as the device you as using it in can handle it (i.e.", "P.S.", "The speed is READ, not WRITE, but you knew that, right?", "This item is great!", "Imagine 64gb this size back in the 70's when they had whole buildings full of computers that couldn't pack this much space!", "Great item.", "I've been trying for a while to get a hold of a 32GB Micro SD for my phone and tablet.", "I really saw the performance boost with my phone, which I have many apps, pictures, music, and other documents on.", "The phone boots fully stable in about 2 mins as apposed to 5-6 mins.", "My computer also can write to these cards much faster than the 16GB ones I was using.", "If you phone, tablet or any other device can support it I recommend you purchase these.", "Also you pay like half the price using Amazon as opposed to other retail stores who's price is at least double or more.", "I've seen these same cards going for about $72 in my area.", "and lost everythingnever buying from SanDisk again .. ever", "Dependable and easy to use.", "An excellent choice for the enthusiast who requires more storage.", "I've got a couple of these in varying sizes.", "I always end up buying more because the prices are so low for what you get.", "Didn't need to format the card or anything.", "I am 100% satisfied.", "Total disagree I will buy a Samsung memory card expected a better quality.", "This is a fantastic little drive, has all the gigabytes it says, works in all ways I can discern and I use it to hold the flac recordings I play on my excellent Fiio X5 digital audio player.", "This is the real thing and not one of the fakes that, evidently, are out there.", "I am very happy with this Micro SD.", "I could tell the difference in the response time in my BB curve as well as my Asus tablet.", "Now I will say this there are faster cards out there but not at this price.", "This does the trick for my devices.", "Now it you are a Professional Photographer you might want to go with the Ultra 3 Micro SD but if you are an everyday user this will work wonders for you device.", "I've purchased several of these little babies over the years, and I always buy SanDisk.", "I've never had one fail, the price is great for the amount of storage you get.", "Ordered this for a Galaxy S3.", "Is not accessible on several different PC's.Says \"limited lifetime\" warranty - BS.", "You have ONE MONTH for Eco Zone.", "Not only did I lose pictures but now I am out $$ because of a crappy return policy.In the future I will be buying Kingston, not Sandisk.-----------------Update:  Amazon Customer service made good and refunded my purchase price.", "I still will not be buying any more Sandisk memory cards however...", "more like 8mb/s in my Note 10.1 and that's using SanDisk's own app.", "Not sure if it's the card or the device, so benefit of the doubt and four stars.", "But with 16 GB capacity, you won't be handling it often.", "I lost some pictures of pets who died shortly after.", "I got a replacement card, but I had to send in the old one, giving up any chance of recovering its contents.", "A memory card either works or it doesn't.", "All I had to do was put the card in the camera, format it, and I was good to go.", "It was to tight i had to use a tool to take it back out of the adapter causing me to chip it.", "so my fault i guess, but i also bought a 16gb version and the adapter for that one was fine.", "Liked the first one I purchased so much, I bought a second one.", "Use direct in your tablet or smart phone and/or buy a decent usb card reader you can load this in and, voila, instant super-speedy, upgradeable thumb drive.", "Works great in my tablet and in my newer card reader - and still kicks the butt of every thumb drive I know of even when used with my old plastic USB 2.0 card reader held together with scotch tape, lol.", "Have purchased several microSD cards since they first came out, from 2GB to 32GB, and all still work fine - I cannot say the same re the thumb drives I purchased during that same time period.One point - beware of counterfeits.", "Samsung is the number one brand so, unfortunately, they get counterfeited a LOT.", "So check reviews and only buy from a reliable seller.", "I suggest buying direct from Amazon (or Memory Mogul) - I have purchased from both with no issues.", "&#34;Fool-proof&#34; packaging or whatever it was, that was laughable.", "This is just the standard micro SD card i would recommend this to anyone.", "i purchased this for my dad who is using it to expand the memory on his tablet!", "Installed it, and had no problems.", "I loaded all my music on it, and didn't even scratch the surface of the capacity of this card!", "I shouldn't ever have to worry about running outta room with this card.", "Highly recommended for any smartphone user!", "You'll pay $10 more for these anywhere else.", "I was initially leery of buying another SD card on amazon.", "4 years ago I did so, and the card was a fake (said it had 32 gigs when plugged into the computer, but you could only load about 11 onto it, and it would say &#34;full.&#34; Apparently there's a way to fool your computer into thinking there's more space than there is, and this is what the fake/counterfeit cards will do).Not so with this one.", "I'm a very pleased customer.", "32gb of storage for my new Asus tablet, what's not to love?", "I can't imagine paying more for the model with the upgraded storage, especially since it's usually like $100 more.", "This thing was cheap and works great.", "no complaints here.", "A lot of people want big memory which is fine.", "This one is class 10.", "Which is great when your taking pictures or video.", "Lesser speed cards will freeze or will say waiting for camera and you will miss the moment.", "Its also a Sandisk which is a name you can trust when it come to memory cards.", "There is something to be said about SanDisk.", "I've never had one be DOA or any memory issues throughout the years, both for my camera and storage products.", "I installed this in my Galaxy SIII and it recognized it right away and I was able to dump my music onto it.", "How do I praise extra memory?", "It fills my MP3 player with every song my heart desires, the sound quality is perfect.", "The ease of use is superb.", "It's great.", "It was exactly what i expected and needed so no complaints.", "Priced right, this memory card also reads and writes fast.", "It's a noticeable difference over cheaper cards.", "I put it in my phone and plan to buy another one for my tablet.", "works great on my sprint htc evo 4g lte.", "Formatted w/ fat32 so of course the maximum file size is 4gb meaning no full length hidef movies.", "Kingston 32GB did 7MB/s.", "This card does about 8-9MB/s.Can't wait till 128GB and 256GB cards become available and affordable.", "I loaded this card up with home movies for my Samsung Galaxy Tab 2.", "There are no skips in the movie quality and I have plenty of room left to go.", "Wish I had bought another for more collections.", "Bought this for my S3 and loaded it with 4 seasons of Futurama, 5 full length HD movies, several documentaries, and a dozen or so 30 minute comedy shows with plenty of room left over for pictures, etc...Only slight nitpick is when booting up into recovery mode on the S3 it will not recognize the card.", "Wanted to update the phone to the latest version of Android and it would not see it.", "Had to resort to a 2GB MicroSD I had laying around.", "That wasn't a SD card issue but I thought I would throw that in.", "I purchased this after my wife and I bought our Samsung Galaxy S4 to store all the music, pictures and videos.", "The S4 camera is capable of capturing 16-megapixels photos so the 16GB microSD that I had will not suffice.", "The only thing is that after installing, instead of showing 64GB available, it only shows 59GB.Tried formatting the card but with same results.Have no idea if this is a limit set by the the Galaxy Tab 3 tablet, or is it just &#34;normal&#34; to buy 64GB and get less than that.As this is surely not a problem coming from the Sandisk memory card, my rating is a 5-STAR.", "Excellent price, works great, and very quick delivery.", "When it comes to any kind of flash storage SanDisk has always been my go to brand because they sell quality items and stand by them if there's a problem.", "So as usual no complaints here, it works as descried and I haven't have any issues.", "Both read and write speeds are right where the specs say they should be.", "didn't really worth the price difference", "There is no noticeable lag transfering even the largest RAW images to it.", "Hadn't had any problem with it.", "Bought this to store music on my phone.", "I'm amazed.", "VERY impressive service from Amazon!As has already been reported, the card formats out to > 59 Gb, and it performs perfectly in my Samsung Galaxy S III (which is also new).", "Using two card readers on a fast PC, I transferred everything from my old 16GB card to the new 64 GB card in less time than it took to walk to the kitchen and get a cup of coffee.", "So I think the Class 10 rating is correct on the card.Once I have some experience with the card in the phone, I'll benchmark the card and I'll also benchmark operations such as internally backing up my Android phone to the card.", "Then I'll update this review with some accurate numerical data.", "Again no benchmarks yet but once I have them I'll include them here.Right now I'm very happy with this card and I'm really impressed - both with the card and with the unbelievably quick service from Amazon (and I'm in Atlanta where shipments like this one often take the full 3 days to arrive).", "I bought the 64GB MicroSD card at Best Buy because I needed one for my Microsoft Surface Pro.", "If you don't need that much space, consider buying one for cheaper with a little less memory.NOTE: Be aware that this is a MicroSDXC format card.", "While most new computers support this format, many of the older computers do not (This includes all but a few tablets and smartphones).", "Before buying this, MAKE SURE your computer, tablet, or smartphone is compatible.", "If it is not, it will not work, period.", "For others who claim that the card doesn't work no matter what they try, chances are their machine cannot support MicroSDXC format.", "I got this because I just couldn't pass up the deal, $17.99.", "It has been incredibly fast in my HTC Sensation 4g.", "Pictures are taken and saved instantaneously.", "Only had it a few days, but have been very happy.", "Shipping was fast and the packaging was easy to open which is always great in my book.", "Only issue I had was I had to format it on my computer first before my phone was able to recognize it.", "the micro sd with adapter, class 10 so it's fast .", "I am happy with this purchase and You will be too.", "I hope this review is helpful!", "The Ultra micro SDHC was fine once I got it working.", "If not, the unit will not read the card!", "Otherwise?", "Love it and the storage for even 16 GB, let alone 32, is tremendous...", "I upgraded to this after the price dropped.", "I originally had a 16gig sandisk card and it was in my mytouch 4g.", "I found toward my mytouch 4g's end of life that space is running low.", "So when I got my Galaxy S3 I bought this card.", "It works flawlessly.", "I highly recommend it.", "Now errors what so ever.", "Does what it is suppose to do and I don't know what else I could say.", "Being a class 10 it is suppose to be plenty fast for cell phone use which I am sure speeds up camera use to some degree.", "Has worked well and the shipping was fast.", "I got this memory card for my Samsung Galaxy S3.", "I was running out of room on my Sandisk 32gb Class 4 micro sd card.", "I also wanted a faster and more durable card.", "I was hopping to put lots of media on it.", "In addition to nandroid backups and custom roms.", "I later found out that since this card is formatted in ex-fat it would not work to make nandroid backups or flash custom roms.", "Most custom recovery and custom roms dont work with ex-fat.", "So my only choice was to format the card to fat 32, which meant I couldn't put any files larger than 4gb on it.", "Besides that this card is great and very reasonable price of $50.", "If your some one who doesn't root their phone or put custom roms, nandroid backups or put files larger than 4gb than this will not affect you.", "This memory card is fast and provides the most storage you can put on your mobile device at this time.", "The card is also water proof, shock proof and comes with lifetime warranty.", "Ive never had any issues with sandisk memory cards or usb flash drives.", "They last a really long time.", "I purchased this version to expand memory on my 16gb android tablet.", "Nothing fancy but it does the job.", "No problems and it played back flawlessly all the files I transferred.There are so many different microSD cards out now but if you see this on sale then you might want to consider it instead of cheaper no-name brand.", "I've ordered other SD cards before but this one is the best overall.", "I would recommend it to anyone who is looking for a quality product.", "Thanks again!", "I use this for my phone and it works just as it should and it was totally worth the money!", "Great place to store pictures and music for phones instead of using the phone memory so it will still run fast.", "I bought two of these one for Asus infinity and one for Samsung galaxy s3 international version.", "It worked fine with my Asus but it didn't work on my phone.", "I formatted this card using the phone,the tablet and my laptop  but didn't work I did some tests with apps using some apps nothing showed its not working the only way I got it to work is by formatting it in my Canon SLR camera.", "It should be marketed as \"Sandisk Basic\", not Sandisk Ultra\", unless they mean ultra slow.", "Now is 2014 and there is no excuse for such slow card from Sandisk.", "*** UPDATE ***I have redone the test with NotePro 12.2\" instead of using non UHS-I PC and the latest results are 32/8.6MB/s.", "Since the read speed hits 30, I believe the device is DHS-I ready.", "Still underwhelmed by the write speed though.", "You can't possibly go wrong with a San Disc product!", "Although I purchased this for my son, I have used San Disc in the past and have never been disappointed!", "I had to return my first one and exchange it for another because the first one was defective.", "The second one works perfectly fine.", "I bought this for my son's tablet for cartoon videos, movies and &#34;all&#34; games he will be downloading (He's under 5 yrs so they'll be small simple games).", "I bought this for a friend of mine to put some videos on it.", "However, after finding a micro sd to usb adapter...bingo!", "Worked like a charm after that.", "Install the videos, plugged the card in the phone, and we were off to the races.Not sure if we needed the adapter, but we couldn't get the computer to recognize it.", "We also used a Linux O/S.", "Go figure.", "The Sandisk Ultra 64GB Micro Card is a great addition to maximize the Samsung Galaxy IIIS, whatever version you got 16GB or 32GB.", "Good for the 1080 videos that the Galaxy IIIS use.", "If you got the most advanced smartphone in the market as I do, this is the memory to get at the right price.", "Could not find better product for my money.", "I know a class 10 is not exactly needed in a cell phone but it cannot hurt, right?", "I'm very happy with this purchase.", "I can now store more than ten movies on my tab and play right of the flash disc with no problems.Very happy with this card.", "This is my third purchase.", "I own 4 of them and they've been working fine so far.", "Now can turn it into my laptop directly.", "Really recommend this", "I bought this item to use in my gopro hero 3 because it's what they sell on the gopro website, but can be had a lot cheaper on Amazon.", "Have yet to have problems with the card.", "Needs little to no formatting and I have yet to see a SanDisk fail.", "Don't cut corners, almost every other brand of SD cards will fail on you except these (tried numerous brands with my devices).Just remember it takes a bit for devices to buffer the information off of the SD card and static can corrupt any SD card which is usually easily fixed with a formatting.", "Always back up your documents to a PC/Mac as soon as possible.Oh, and if you create playlists, slideshows, etc.", "on devices and remove the SD card, the device will not be smart enough to re-compile it after you put the SD card back in and you will end up with blank playlists even though you have the songs so WATCH OUT!Lastly if this SD card doesn't work for you for whatever reason google SD card formatting and it should help you out.", "These 64GB versions don't seem to have formatting issues like the 32GB ones do but even then formatting to FAT32 fixes it.", "The ones that the scissors refuse to cut and you just end up hurting yourself a few times before getting it open.", "Completely as advertised.", "Some people said they have problems with the cards in the new gopros but I have had no such problems.", "Have always had good experiences with SanDisk products.", "This was priced well.", "pretty neat.Considering for the price at 24$ for 32gb is pretty reasonable class 10 is fast for any HD 1080p video recording or DSLR camera.I bought this for myself to use with the GoPro 3.", "Taking picture & Videos working great as it didn't give anycorrupted files videos & pictures yet.", "I have an old SanDisk SD card that still works.", "I bought a samsung micro sd card from bestbuy and it somehow erased everything.", "So this is my second one.", "Hopefully it keeps all of my stuff", "Used it in my Galaxy Note 2 for the past 16 months.", "All the sudden it is no longer writable.", "I tried many ways to reformat the card.", "Even Windows says format successful but all files remain after I remove and re-insert the card.", "Since I have private files in the card I'm not able to delete.", "I do not want to sent it back to SanDisk for replacement.", "I own two 32gb UHS-1 cards and a few older (16gb, 8gb, class 4, class 6, etc) Sandisk MicroSDs not including my standard SDs or my USB thumb drives and they have stood up to my tests with only one card I can think of failing, which I was still able to recover all the data from (just not write to it anymore) and I'm pretty hard on my rewritable media.", "What more can you say?", "Using this along with out Roku3.", "What else could you ask for?", "The price wasn't a great cost savings but because it came from Amazon which has a great reputation to date as far as I am concerned, I purchased through them.", "Being the first adopter when it came out.", "Thought the sale price $119 is excellent.", "Got duped.", "It's been the same price since it was first introduced.", "Great for the action cam.", "Battery ran out before it ran out of memory."],
        ["_misc"]
    ]
]
